kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/CMSIS_Test_MKM33Z5_v1_3.c
void test_DMA(void) {
  (void)DMA_BASE;
  (void)DMA0;
  DMA_SAR0 = DMA_SAR0 + 1;
  DMA_DAR0 = DMA_DAR0 + 1;
  DMA_DSR_BCR0 = DMA_DSR_BCR0 + 1;
  DMA_DSR0 = DMA_DSR0 + 1;
  DMA_DCR0 = DMA_DCR0 + 1;
  DMA_SAR1 = DMA_SAR1 + 1;
  DMA_DAR1 = DMA_DAR1 + 1;
  DMA_DSR_BCR1 = DMA_DSR_BCR1 + 1;
  DMA_DSR1 = DMA_DSR1 + 1;
  DMA_DCR1 = DMA_DCR1 + 1;
  DMA_SAR2 = DMA_SAR2 + 1;
  DMA_DAR2 = DMA_DAR2 + 1;
  DMA_DSR_BCR2 = DMA_DSR_BCR2 + 1;
  DMA_DSR2 = DMA_DSR2 + 1;
  DMA_DCR2 = DMA_DCR2 + 1;
  DMA_SAR3 = DMA_SAR3 + 1;
  DMA_DAR3 = DMA_DAR3 + 1;
  DMA_DSR_BCR3 = DMA_DSR_BCR3 + 1;
  DMA_DSR3 = DMA_DSR3 + 1;
  DMA_DCR3 = DMA_DCR3 + 1;
  DMA_SAR_REG(DMA0,0) = DMA_SAR_REG(DMA0,0) + 1;
  DMA_SAR(0) = DMA_SAR(0) + 1;
  (void)DMA_SAR_SAR_MASK;
  (void)DMA_SAR_SAR_SHIFT;
  (void)DMA_SAR_SAR(1);
  DMA_SAR0 |= DMA_SAR_SAR_MASK;
  DMA_SAR0 &= ~(1U << DMA_SAR_SAR_SHIFT);
  DMA_DAR_REG(DMA0,0) = DMA_DAR_REG(DMA0,0) + 1;
  DMA_DAR(0) = DMA_DAR(0) + 1;
  (void)DMA_DAR_DAR_MASK;
  (void)DMA_DAR_DAR_SHIFT;
  (void)DMA_DAR_DAR(1);
  DMA_DAR0 |= DMA_DAR_DAR_MASK;
  DMA_DAR0 &= ~(1U << DMA_DAR_DAR_SHIFT);
  DMA_DSR_BCR_REG(DMA0,0) = DMA_DSR_BCR_REG(DMA0,0) + 1;
  DMA_DSR_BCR(0) = DMA_DSR_BCR(0) + 1;
  (void)DMA_DSR_BCR_BCR_MASK;
  (void)DMA_DSR_BCR_BCR_SHIFT;
  (void)DMA_DSR_BCR_BCR(1);
  DMA_DSR_BCR0 |= DMA_DSR_BCR_BCR_MASK;
  DMA_DSR_BCR0 &= ~(1U << DMA_DSR_BCR_BCR_SHIFT);
  (void)DMA_DSR_BCR_DONE_MASK;
  (void)DMA_DSR_BCR_DONE_SHIFT;
  DMA_DSR_BCR0 |= DMA_DSR_BCR_DONE_MASK;
  DMA_DSR_BCR0 &= ~(1U << DMA_DSR_BCR_DONE_SHIFT);
  (void)DMA_DSR_BCR_BSY_MASK;
  (void)DMA_DSR_BCR_BSY_SHIFT;
  DMA_DSR_BCR0 |= DMA_DSR_BCR_BSY_MASK;
  DMA_DSR_BCR0 &= ~(1U << DMA_DSR_BCR_BSY_SHIFT);
  (void)DMA_DSR_BCR_REQ_MASK;
  (void)DMA_DSR_BCR_REQ_SHIFT;
  DMA_DSR_BCR0 |= DMA_DSR_BCR_REQ_MASK;
  DMA_DSR_BCR0 &= ~(1U << DMA_DSR_BCR_REQ_SHIFT);
  (void)DMA_DSR_BCR_BED_MASK;
  (void)DMA_DSR_BCR_BED_SHIFT;
  DMA_DSR_BCR0 |= DMA_DSR_BCR_BED_MASK;
  DMA_DSR_BCR0 &= ~(1U << DMA_DSR_BCR_BED_SHIFT);
  (void)DMA_DSR_BCR_BES_MASK;
  (void)DMA_DSR_BCR_BES_SHIFT;
  DMA_DSR_BCR0 |= DMA_DSR_BCR_BES_MASK;
  DMA_DSR_BCR0 &= ~(1U << DMA_DSR_BCR_BES_SHIFT);
  (void)DMA_DSR_BCR_CE_MASK;
  (void)DMA_DSR_BCR_CE_SHIFT;
  DMA_DSR_BCR0 |= DMA_DSR_BCR_CE_MASK;
  DMA_DSR_BCR0 &= ~(1U << DMA_DSR_BCR_CE_SHIFT);
  DMA_DSR_REG(DMA0,0) = DMA_DSR_REG(DMA0,0) + 1;
  DMA_DSR(0) = DMA_DSR(0) + 1;
  DMA_DCR_REG(DMA0,0) = DMA_DCR_REG(DMA0,0) + 1;
  DMA_DCR(0) = DMA_DCR(0) + 1;
  (void)DMA_DCR_LCH2_MASK;
  (void)DMA_DCR_LCH2_SHIFT;
  (void)DMA_DCR_LCH2(1);
  DMA_DCR0 |= DMA_DCR_LCH2_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_LCH2_SHIFT);
  (void)DMA_DCR_LCH1_MASK;
  (void)DMA_DCR_LCH1_SHIFT;
  (void)DMA_DCR_LCH1(1);
  DMA_DCR0 |= DMA_DCR_LCH1_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_LCH1_SHIFT);
  (void)DMA_DCR_LINKCC_MASK;
  (void)DMA_DCR_LINKCC_SHIFT;
  (void)DMA_DCR_LINKCC(1);
  DMA_DCR0 |= DMA_DCR_LINKCC_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_LINKCC_SHIFT);
  (void)DMA_DCR_D_REQ_MASK;
  (void)DMA_DCR_D_REQ_SHIFT;
  DMA_DCR0 |= DMA_DCR_D_REQ_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_D_REQ_SHIFT);
  (void)DMA_DCR_DMOD_MASK;
  (void)DMA_DCR_DMOD_SHIFT;
  (void)DMA_DCR_DMOD(1);
  DMA_DCR0 |= DMA_DCR_DMOD_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_DMOD_SHIFT);
  (void)DMA_DCR_SMOD_MASK;
  (void)DMA_DCR_SMOD_SHIFT;
  (void)DMA_DCR_SMOD(1);
  DMA_DCR0 |= DMA_DCR_SMOD_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_SMOD_SHIFT);
  (void)DMA_DCR_START_MASK;
  (void)DMA_DCR_START_SHIFT;
  DMA_DCR0 |= DMA_DCR_START_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_START_SHIFT);
  (void)DMA_DCR_DSIZE_MASK;
  (void)DMA_DCR_DSIZE_SHIFT;
  (void)DMA_DCR_DSIZE(1);
  DMA_DCR0 |= DMA_DCR_DSIZE_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_DSIZE_SHIFT);
  (void)DMA_DCR_DINC_MASK;
  (void)DMA_DCR_DINC_SHIFT;
  DMA_DCR0 |= DMA_DCR_DINC_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_DINC_SHIFT);
  (void)DMA_DCR_SSIZE_MASK;
  (void)DMA_DCR_SSIZE_SHIFT;
  (void)DMA_DCR_SSIZE(1);
  DMA_DCR0 |= DMA_DCR_SSIZE_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_SSIZE_SHIFT);
  (void)DMA_DCR_SINC_MASK;
  (void)DMA_DCR_SINC_SHIFT;
  DMA_DCR0 |= DMA_DCR_SINC_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_SINC_SHIFT);
  (void)DMA_DCR_EADREQ_MASK;
  (void)DMA_DCR_EADREQ_SHIFT;
  DMA_DCR0 |= DMA_DCR_EADREQ_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_EADREQ_SHIFT);
  (void)DMA_DCR_UMNSM_MASK;
  (void)DMA_DCR_UMNSM_SHIFT;
  (void)DMA_DCR_UMNSM(1);
  DMA_DCR0 |= DMA_DCR_UMNSM_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_UMNSM_SHIFT);
  (void)DMA_DCR_CHACR_MASK;
  (void)DMA_DCR_CHACR_SHIFT;
  (void)DMA_DCR_CHACR(1);
  DMA_DCR0 |= DMA_DCR_CHACR_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_CHACR_SHIFT);
  (void)DMA_DCR_AA_MASK;
  (void)DMA_DCR_AA_SHIFT;
  DMA_DCR0 |= DMA_DCR_AA_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_AA_SHIFT);
  (void)DMA_DCR_CS_MASK;
  (void)DMA_DCR_CS_SHIFT;
  DMA_DCR0 |= DMA_DCR_CS_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_CS_SHIFT);
  (void)DMA_DCR_ERQ_MASK;
  (void)DMA_DCR_ERQ_SHIFT;
  DMA_DCR0 |= DMA_DCR_ERQ_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_ERQ_SHIFT);
  (void)DMA_DCR_EINT_MASK;
  (void)DMA_DCR_EINT_SHIFT;
  DMA_DCR0 |= DMA_DCR_EINT_MASK;
  DMA_DCR0 &= ~(1U << DMA_DCR_EINT_SHIFT);
}

void test_DMAMUX(void) {
  (void)DMAMUX0_BASE;
  (void)DMAMUX0;
  (void)DMAMUX1_BASE;
  (void)DMAMUX1;
  (void)DMAMUX2_BASE;
  (void)DMAMUX2;
  (void)DMAMUX3_BASE;
  (void)DMAMUX3;
  DMAMUX0_CHCFG = DMAMUX0_CHCFG + 1;
  DMAMUX1_CHCFG = DMAMUX1_CHCFG + 1;
  DMAMUX2_CHCFG = DMAMUX2_CHCFG + 1;
  DMAMUX3_CHCFG = DMAMUX3_CHCFG + 1;
  DMAMUX_CHCFG_REG(DMAMUX0) = DMAMUX_CHCFG_REG(DMAMUX0) + 1;
  DMAMUX_CHCFG_REG(DMAMUX1) = DMAMUX_CHCFG_REG(DMAMUX1) + 1;
  DMAMUX_CHCFG_REG(DMAMUX2) = DMAMUX_CHCFG_REG(DMAMUX2) + 1;
  DMAMUX_CHCFG_REG(DMAMUX3) = DMAMUX_CHCFG_REG(DMAMUX3) + 1;
  (void)DMAMUX_CHCFG_SOURCE_MASK;
  (void)DMAMUX_CHCFG_SOURCE_SHIFT;
  (void)DMAMUX_CHCFG_SOURCE(1);
  DMAMUX0_CHCFG |= DMAMUX_CHCFG_SOURCE_MASK;
  DMAMUX0_CHCFG &= ~(1U << DMAMUX_CHCFG_SOURCE_SHIFT);
  (void)DMAMUX_CHCFG_TRIG_MASK;
  (void)DMAMUX_CHCFG_TRIG_SHIFT;
  DMAMUX0_CHCFG |= DMAMUX_CHCFG_TRIG_MASK;
  DMAMUX0_CHCFG &= ~(1U << DMAMUX_CHCFG_TRIG_SHIFT);
  (void)DMAMUX_CHCFG_ENBL_MASK;
  (void)DMAMUX_CHCFG_ENBL_SHIFT;
  DMAMUX0_CHCFG |= DMAMUX_CHCFG_ENBL_MASK;
  DMAMUX0_CHCFG &= ~(1U << DMAMUX_CHCFG_ENBL_SHIFT);
}

void test_EWM(void) {
  (void)EWM_BASE;
  (void)EWM;
  EWM_CTRL = EWM_CTRL + 1;
  EWM_SERV = EWM_SERV + 1;
  EWM_CMPL = EWM_CMPL + 1;
  EWM_CMPH = EWM_CMPH + 1;
  EWM_CTRL_REG(EWM) = EWM_CTRL_REG(EWM) + 1;
  (void)EWM_CTRL_EWMEN_MASK;
  (void)EWM_CTRL_EWMEN_SHIFT;
  EWM_CTRL |= EWM_CTRL_EWMEN_MASK;
  EWM_CTRL &= ~(1U << EWM_CTRL_EWMEN_SHIFT);
  (void)EWM_CTRL_ASSIN_MASK;
  (void)EWM_CTRL_ASSIN_SHIFT;
  EWM_CTRL |= EWM_CTRL_ASSIN_MASK;
  EWM_CTRL &= ~(1U << EWM_CTRL_ASSIN_SHIFT);
  (void)EWM_CTRL_INEN_MASK;
  (void)EWM_CTRL_INEN_SHIFT;
  EWM_CTRL |= EWM_CTRL_INEN_MASK;
  EWM_CTRL &= ~(1U << EWM_CTRL_INEN_SHIFT);
  (void)EWM_CTRL_INTEN_MASK;
  (void)EWM_CTRL_INTEN_SHIFT;
  EWM_CTRL |= EWM_CTRL_INTEN_MASK;
  EWM_CTRL &= ~(1U << EWM_CTRL_INTEN_SHIFT);
  EWM_SERV_REG(EWM) = EWM_SERV_REG(EWM) + 1;
  (void)EWM_SERV_SERVICE_MASK;
  (void)EWM_SERV_SERVICE_SHIFT;
  (void)EWM_SERV_SERVICE(1);
  EWM_SERV |= EWM_SERV_SERVICE_MASK;
  EWM_SERV &= ~(1U << EWM_SERV_SERVICE_SHIFT);
  EWM_CMPL_REG(EWM) = EWM_CMPL_REG(EWM) + 1;
  (void)EWM_CMPL_COMPAREL_MASK;
  (void)EWM_CMPL_COMPAREL_SHIFT;
  (void)EWM_CMPL_COMPAREL(1);
  EWM_CMPL |= EWM_CMPL_COMPAREL_MASK;
  EWM_CMPL &= ~(1U << EWM_CMPL_COMPAREL_SHIFT);
  EWM_CMPH_REG(EWM) = EWM_CMPH_REG(EWM) + 1;
  (void)EWM_CMPH_COMPAREH_MASK;
  (void)EWM_CMPH_COMPAREH_SHIFT;
  (void)EWM_CMPH_COMPAREH(1);
  EWM_CMPH |= EWM_CMPH_COMPAREH_MASK;
  EWM_CMPH &= ~(1U << EWM_CMPH_COMPAREH_SHIFT);
}

void test_FTFA(void) {
  (void)FTFA_BASE;
  (void)FTFA;
  FTFA_FSTAT = FTFA_FSTAT + 1;
  FTFA_FCNFG = FTFA_FCNFG + 1;
  FTFA_FCCOB3 = FTFA_FCCOB3 + 1;
  FTFA_FCCOB2 = FTFA_FCCOB2 + 1;
  FTFA_FCCOB1 = FTFA_FCCOB1 + 1;
  FTFA_FCCOB0 = FTFA_FCCOB0 + 1;
  FTFA_FCCOB7 = FTFA_FCCOB7 + 1;
  FTFA_FCCOB6 = FTFA_FCCOB6 + 1;
  FTFA_FCCOB5 = FTFA_FCCOB5 + 1;
  FTFA_FCCOB4 = FTFA_FCCOB4 + 1;
  FTFA_FCCOBB = FTFA_FCCOBB + 1;
  FTFA_FCCOBA = FTFA_FCCOBA + 1;
  FTFA_FCCOB9 = FTFA_FCCOB9 + 1;
  FTFA_FCCOB8 = FTFA_FCCOB8 + 1;
  FTFA_FPROT3 = FTFA_FPROT3 + 1;
  FTFA_FPROT2 = FTFA_FPROT2 + 1;
  FTFA_FPROT1 = FTFA_FPROT1 + 1;
  FTFA_FPROT0 = FTFA_FPROT0 + 1;
  FTFA_FSTAT_REG(FTFA) = FTFA_FSTAT_REG(FTFA) + 1;
  (void)FTFA_FSTAT_MGSTAT0_MASK;
  (void)FTFA_FSTAT_MGSTAT0_SHIFT;
  FTFA_FSTAT |= FTFA_FSTAT_MGSTAT0_MASK;
  FTFA_FSTAT &= ~(1U << FTFA_FSTAT_MGSTAT0_SHIFT);
  (void)FTFA_FSTAT_FPVIOL_MASK;
  (void)FTFA_FSTAT_FPVIOL_SHIFT;
  FTFA_FSTAT |= FTFA_FSTAT_FPVIOL_MASK;
  FTFA_FSTAT &= ~(1U << FTFA_FSTAT_FPVIOL_SHIFT);
  (void)FTFA_FSTAT_ACCERR_MASK;
  (void)FTFA_FSTAT_ACCERR_SHIFT;
  FTFA_FSTAT |= FTFA_FSTAT_ACCERR_MASK;
  FTFA_FSTAT &= ~(1U << FTFA_FSTAT_ACCERR_SHIFT);
  (void)FTFA_FSTAT_RDCOLERR_MASK;
  (void)FTFA_FSTAT_RDCOLERR_SHIFT;
  FTFA_FSTAT |= FTFA_FSTAT_RDCOLERR_MASK;
  FTFA_FSTAT &= ~(1U << FTFA_FSTAT_RDCOLERR_SHIFT);
  (void)FTFA_FSTAT_CCIF_MASK;
  (void)FTFA_FSTAT_CCIF_SHIFT;
  FTFA_FSTAT |= FTFA_FSTAT_CCIF_MASK;
  FTFA_FSTAT &= ~(1U << FTFA_FSTAT_CCIF_SHIFT);
  FTFA_FCNFG_REG(FTFA) = FTFA_FCNFG_REG(FTFA) + 1;
  (void)FTFA_FCNFG_ERSSUSP_MASK;
  (void)FTFA_FCNFG_ERSSUSP_SHIFT;
  FTFA_FCNFG |= FTFA_FCNFG_ERSSUSP_MASK;
  FTFA_FCNFG &= ~(1U << FTFA_FCNFG_ERSSUSP_SHIFT);
  (void)FTFA_FCNFG_ERSAREQ_MASK;
  (void)FTFA_FCNFG_ERSAREQ_SHIFT;
  FTFA_FCNFG |= FTFA_FCNFG_ERSAREQ_MASK;
  FTFA_FCNFG &= ~(1U << FTFA_FCNFG_ERSAREQ_SHIFT);
  (void)FTFA_FCNFG_RDCOLLIE_MASK;
  (void)FTFA_FCNFG_RDCOLLIE_SHIFT;
  FTFA_FCNFG |= FTFA_FCNFG_RDCOLLIE_MASK;
  FTFA_FCNFG &= ~(1U << FTFA_FCNFG_RDCOLLIE_SHIFT);
  (void)FTFA_FCNFG_CCIE_MASK;
  (void)FTFA_FCNFG_CCIE_SHIFT;
  FTFA_FCNFG |= FTFA_FCNFG_CCIE_MASK;
  FTFA_FCNFG &= ~(1U << FTFA_FCNFG_CCIE_SHIFT);
  (void)FTFA_FSEC_SEC_MASK;
  (void)FTFA_FSEC_SEC_SHIFT;
  (void)FTFA_FSEC_SEC(1);
  (void)FTFA_FSEC_FSLACC_MASK;
  (void)FTFA_FSEC_FSLACC_SHIFT;
  (void)FTFA_FSEC_FSLACC(1);
  (void)FTFA_FSEC_MEEN_MASK;
  (void)FTFA_FSEC_MEEN_SHIFT;
  (void)FTFA_FSEC_MEEN(1);
  (void)FTFA_FSEC_KEYEN_MASK;
  (void)FTFA_FSEC_KEYEN_SHIFT;
  (void)FTFA_FSEC_KEYEN(1);
  (void)FTFA_FOPT_OPT_MASK;
  (void)FTFA_FOPT_OPT_SHIFT;
  (void)FTFA_FOPT_OPT(1);
  FTFA_FCCOB3_REG(FTFA) = FTFA_FCCOB3_REG(FTFA) + 1;
  (void)FTFA_FCCOB3_CCOBn_MASK;
  (void)FTFA_FCCOB3_CCOBn_SHIFT;
  (void)FTFA_FCCOB3_CCOBn(1);
  FTFA_FCCOB3 |= FTFA_FCCOB3_CCOBn_MASK;
  FTFA_FCCOB3 &= ~(1U << FTFA_FCCOB3_CCOBn_SHIFT);
  FTFA_FCCOB2_REG(FTFA) = FTFA_FCCOB2_REG(FTFA) + 1;
  (void)FTFA_FCCOB2_CCOBn_MASK;
  (void)FTFA_FCCOB2_CCOBn_SHIFT;
  (void)FTFA_FCCOB2_CCOBn(1);
  FTFA_FCCOB2 |= FTFA_FCCOB2_CCOBn_MASK;
  FTFA_FCCOB2 &= ~(1U << FTFA_FCCOB2_CCOBn_SHIFT);
  FTFA_FCCOB1_REG(FTFA) = FTFA_FCCOB1_REG(FTFA) + 1;
  (void)FTFA_FCCOB1_CCOBn_MASK;
  (void)FTFA_FCCOB1_CCOBn_SHIFT;
  (void)FTFA_FCCOB1_CCOBn(1);
  FTFA_FCCOB1 |= FTFA_FCCOB1_CCOBn_MASK;
  FTFA_FCCOB1 &= ~(1U << FTFA_FCCOB1_CCOBn_SHIFT);
  FTFA_FCCOB0_REG(FTFA) = FTFA_FCCOB0_REG(FTFA) + 1;
  (void)FTFA_FCCOB0_CCOBn_MASK;
  (void)FTFA_FCCOB0_CCOBn_SHIFT;
  (void)FTFA_FCCOB0_CCOBn(1);
  FTFA_FCCOB0 |= FTFA_FCCOB0_CCOBn_MASK;
  FTFA_FCCOB0 &= ~(1U << FTFA_FCCOB0_CCOBn_SHIFT);
  FTFA_FCCOB7_REG(FTFA) = FTFA_FCCOB7_REG(FTFA) + 1;
  (void)FTFA_FCCOB7_CCOBn_MASK;
  (void)FTFA_FCCOB7_CCOBn_SHIFT;
  (void)FTFA_FCCOB7_CCOBn(1);
  FTFA_FCCOB7 |= FTFA_FCCOB7_CCOBn_MASK;
  FTFA_FCCOB7 &= ~(1U << FTFA_FCCOB7_CCOBn_SHIFT);
  FTFA_FCCOB6_REG(FTFA) = FTFA_FCCOB6_REG(FTFA) + 1;
  (void)FTFA_FCCOB6_CCOBn_MASK;
  (void)FTFA_FCCOB6_CCOBn_SHIFT;
  (void)FTFA_FCCOB6_CCOBn(1);
  FTFA_FCCOB6 |= FTFA_FCCOB6_CCOBn_MASK;
  FTFA_FCCOB6 &= ~(1U << FTFA_FCCOB6_CCOBn_SHIFT);
  FTFA_FCCOB5_REG(FTFA) = FTFA_FCCOB5_REG(FTFA) + 1;
  (void)FTFA_FCCOB5_CCOBn_MASK;
  (void)FTFA_FCCOB5_CCOBn_SHIFT;
  (void)FTFA_FCCOB5_CCOBn(1);
  FTFA_FCCOB5 |= FTFA_FCCOB5_CCOBn_MASK;
  FTFA_FCCOB5 &= ~(1U << FTFA_FCCOB5_CCOBn_SHIFT);
  FTFA_FCCOB4_REG(FTFA) = FTFA_FCCOB4_REG(FTFA) + 1;
  (void)FTFA_FCCOB4_CCOBn_MASK;
  (void)FTFA_FCCOB4_CCOBn_SHIFT;
  (void)FTFA_FCCOB4_CCOBn(1);
  FTFA_FCCOB4 |= FTFA_FCCOB4_CCOBn_MASK;
  FTFA_FCCOB4 &= ~(1U << FTFA_FCCOB4_CCOBn_SHIFT);
  FTFA_FCCOBB_REG(FTFA) = FTFA_FCCOBB_REG(FTFA) + 1;
  (void)FTFA_FCCOBB_CCOBn_MASK;
  (void)FTFA_FCCOBB_CCOBn_SHIFT;
  (void)FTFA_FCCOBB_CCOBn(1);
  FTFA_FCCOBB |= FTFA_FCCOBB_CCOBn_MASK;
  FTFA_FCCOBB &= ~(1U << FTFA_FCCOBB_CCOBn_SHIFT);
  FTFA_FCCOBA_REG(FTFA) = FTFA_FCCOBA_REG(FTFA) + 1;
  (void)FTFA_FCCOBA_CCOBn_MASK;
  (void)FTFA_FCCOBA_CCOBn_SHIFT;
  (void)FTFA_FCCOBA_CCOBn(1);
  FTFA_FCCOBA |= FTFA_FCCOBA_CCOBn_MASK;
  FTFA_FCCOBA &= ~(1U << FTFA_FCCOBA_CCOBn_SHIFT);
  FTFA_FCCOB9_REG(FTFA) = FTFA_FCCOB9_REG(FTFA) + 1;
  (void)FTFA_FCCOB9_CCOBn_MASK;
  (void)FTFA_FCCOB9_CCOBn_SHIFT;
  (void)FTFA_FCCOB9_CCOBn(1);
  FTFA_FCCOB9 |= FTFA_FCCOB9_CCOBn_MASK;
  FTFA_FCCOB9 &= ~(1U << FTFA_FCCOB9_CCOBn_SHIFT);
  FTFA_FCCOB8_REG(FTFA) = FTFA_FCCOB8_REG(FTFA) + 1;
  (void)FTFA_FCCOB8_CCOBn_MASK;
  (void)FTFA_FCCOB8_CCOBn_SHIFT;
  (void)FTFA_FCCOB8_CCOBn(1);
  FTFA_FCCOB8 |= FTFA_FCCOB8_CCOBn_MASK;
  FTFA_FCCOB8 &= ~(1U << FTFA_FCCOB8_CCOBn_SHIFT);
  FTFA_FPROT3_REG(FTFA) = FTFA_FPROT3_REG(FTFA) + 1;
  (void)FTFA_FPROT3_PROT_MASK;
  (void)FTFA_FPROT3_PROT_SHIFT;
  (void)FTFA_FPROT3_PROT(1);
  FTFA_FPROT3 |= FTFA_FPROT3_PROT_MASK;
  FTFA_FPROT3 &= ~(1U << FTFA_FPROT3_PROT_SHIFT);
  FTFA_FPROT2_REG(FTFA) = FTFA_FPROT2_REG(FTFA) + 1;
  (void)FTFA_FPROT2_PROT_MASK;
  (void)FTFA_FPROT2_PROT_SHIFT;
  (void)FTFA_FPROT2_PROT(1);
  FTFA_FPROT2 |= FTFA_FPROT2_PROT_MASK;
  FTFA_FPROT2 &= ~(1U << FTFA_FPROT2_PROT_SHIFT);
  FTFA_FPROT1_REG(FTFA) = FTFA_FPROT1_REG(FTFA) + 1;
  (void)FTFA_FPROT1_PROT_MASK;
  (void)FTFA_FPROT1_PROT_SHIFT;
  (void)FTFA_FPROT1_PROT(1);
  FTFA_FPROT1 |= FTFA_FPROT1_PROT_MASK;
  FTFA_FPROT1 &= ~(1U << FTFA_FPROT1_PROT_SHIFT);
  FTFA_FPROT0_REG(FTFA) = FTFA_FPROT0_REG(FTFA) + 1;
  (void)FTFA_FPROT0_PROT_MASK;
  (void)FTFA_FPROT0_PROT_SHIFT;
  (void)FTFA_FPROT0_PROT(1);
  FTFA_FPROT0 |= FTFA_FPROT0_PROT_MASK;
  FTFA_FPROT0 &= ~(1U << FTFA_FPROT0_PROT_SHIFT);
}

