kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/CMSIS_Test_MKM33Z5_v1_3.c
void test_GPIO(void) {
  (void)GPIOA_BASE;
  (void)GPIOA;
  (void)GPIOB_BASE;
  (void)GPIOB;
  (void)GPIOC_BASE;
  (void)GPIOC;
  (void)GPIOD_BASE;
  (void)GPIOD;
  (void)GPIOE_BASE;
  (void)GPIOE;
  (void)GPIOF_BASE;
  (void)GPIOF;
  (void)GPIOG_BASE;
  (void)GPIOG;
  (void)GPIOH_BASE;
  (void)GPIOH;
  (void)GPIOI_BASE;
  (void)GPIOI;
  GPIOA_PDOR = GPIOA_PDOR + 1;
  GPIOA_PDDR = GPIOA_PDDR + 1;
  GPIOA_GACR = GPIOA_GACR + 1;
  GPIOB_PDOR = GPIOB_PDOR + 1;
  GPIOB_PDDR = GPIOB_PDDR + 1;
  GPIOB_GACR = GPIOB_GACR + 1;
  GPIOC_PDOR = GPIOC_PDOR + 1;
  GPIOC_PDDR = GPIOC_PDDR + 1;
  GPIOC_GACR = GPIOC_GACR + 1;
  GPIOD_PDOR = GPIOD_PDOR + 1;
  GPIOD_PDDR = GPIOD_PDDR + 1;
  GPIOD_GACR = GPIOD_GACR + 1;
  GPIOE_PDOR = GPIOE_PDOR + 1;
  GPIOE_PDDR = GPIOE_PDDR + 1;
  GPIOE_GACR = GPIOE_GACR + 1;
  GPIOF_PDOR = GPIOF_PDOR + 1;
  GPIOF_PDDR = GPIOF_PDDR + 1;
  GPIOF_GACR = GPIOF_GACR + 1;
  GPIOG_PDOR = GPIOG_PDOR + 1;
  GPIOG_PDDR = GPIOG_PDDR + 1;
  GPIOG_GACR = GPIOG_GACR + 1;
  GPIOH_PDOR = GPIOH_PDOR + 1;
  GPIOH_PDDR = GPIOH_PDDR + 1;
  GPIOH_GACR = GPIOH_GACR + 1;
  GPIOI_PDOR = GPIOI_PDOR + 1;
  GPIOI_PDDR = GPIOI_PDDR + 1;
  GPIOI_GACR = GPIOI_GACR + 1;
  GPIO_PDOR_REG(GPIOA) = GPIO_PDOR_REG(GPIOA) + 1;
  GPIO_PDOR_REG(GPIOB) = GPIO_PDOR_REG(GPIOB) + 1;
  GPIO_PDOR_REG(GPIOC) = GPIO_PDOR_REG(GPIOC) + 1;
  GPIO_PDOR_REG(GPIOD) = GPIO_PDOR_REG(GPIOD) + 1;
  GPIO_PDOR_REG(GPIOE) = GPIO_PDOR_REG(GPIOE) + 1;
  GPIO_PDOR_REG(GPIOF) = GPIO_PDOR_REG(GPIOF) + 1;
  GPIO_PDOR_REG(GPIOG) = GPIO_PDOR_REG(GPIOG) + 1;
  GPIO_PDOR_REG(GPIOH) = GPIO_PDOR_REG(GPIOH) + 1;
  GPIO_PDOR_REG(GPIOI) = GPIO_PDOR_REG(GPIOI) + 1;
  (void)GPIO_PDOR_PDO_MASK;
  (void)GPIO_PDOR_PDO_SHIFT;
  (void)GPIO_PDOR_PDO(1);
  GPIOA_PDOR |= GPIO_PDOR_PDO_MASK;
  GPIOA_PDOR &= ~(1U << GPIO_PDOR_PDO_SHIFT);
  (void)GPIO_PDIR_PDI_MASK;
  (void)GPIO_PDIR_PDI_SHIFT;
  (void)GPIO_PDIR_PDI(1);
  GPIO_PDDR_REG(GPIOA) = GPIO_PDDR_REG(GPIOA) + 1;
  GPIO_PDDR_REG(GPIOB) = GPIO_PDDR_REG(GPIOB) + 1;
  GPIO_PDDR_REG(GPIOC) = GPIO_PDDR_REG(GPIOC) + 1;
  GPIO_PDDR_REG(GPIOD) = GPIO_PDDR_REG(GPIOD) + 1;
  GPIO_PDDR_REG(GPIOE) = GPIO_PDDR_REG(GPIOE) + 1;
  GPIO_PDDR_REG(GPIOF) = GPIO_PDDR_REG(GPIOF) + 1;
  GPIO_PDDR_REG(GPIOG) = GPIO_PDDR_REG(GPIOG) + 1;
  GPIO_PDDR_REG(GPIOH) = GPIO_PDDR_REG(GPIOH) + 1;
  GPIO_PDDR_REG(GPIOI) = GPIO_PDDR_REG(GPIOI) + 1;
  (void)GPIO_PDDR_PDD_MASK;
  (void)GPIO_PDDR_PDD_SHIFT;
  (void)GPIO_PDDR_PDD(1);
  GPIOA_PDDR |= GPIO_PDDR_PDD_MASK;
  GPIOA_PDDR &= ~(1U << GPIO_PDDR_PDD_SHIFT);
  GPIO_GACR_REG(GPIOA) = GPIO_GACR_REG(GPIOA) + 1;
  GPIO_GACR_REG(GPIOB) = GPIO_GACR_REG(GPIOB) + 1;
  GPIO_GACR_REG(GPIOC) = GPIO_GACR_REG(GPIOC) + 1;
  GPIO_GACR_REG(GPIOD) = GPIO_GACR_REG(GPIOD) + 1;
  GPIO_GACR_REG(GPIOE) = GPIO_GACR_REG(GPIOE) + 1;
  GPIO_GACR_REG(GPIOF) = GPIO_GACR_REG(GPIOF) + 1;
  GPIO_GACR_REG(GPIOG) = GPIO_GACR_REG(GPIOG) + 1;
  GPIO_GACR_REG(GPIOH) = GPIO_GACR_REG(GPIOH) + 1;
  GPIO_GACR_REG(GPIOI) = GPIO_GACR_REG(GPIOI) + 1;
  (void)GPIO_GACR_ACB_MASK;
  (void)GPIO_GACR_ACB_SHIFT;
  (void)GPIO_GACR_ACB(1);
  GPIOA_GACR |= GPIO_GACR_ACB_MASK;
  GPIOA_GACR &= ~(1U << GPIO_GACR_ACB_SHIFT);
  (void)GPIO_GACR_ROB_MASK;
  (void)GPIO_GACR_ROB_SHIFT;
  GPIOA_GACR |= GPIO_GACR_ROB_MASK;
  GPIOA_GACR &= ~(1U << GPIO_GACR_ROB_SHIFT);
}

void test_I2C(void) {
  (void)I2C0_BASE;
  (void)I2C0;
  (void)I2C1_BASE;
  (void)I2C1;
  I2C0_A1 = I2C0_A1 + 1;
  I2C0_F = I2C0_F + 1;
  I2C0_C1 = I2C0_C1 + 1;
  I2C0_S = I2C0_S + 1;
  I2C0_D = I2C0_D + 1;
  I2C0_C2 = I2C0_C2 + 1;
  I2C0_FLT = I2C0_FLT + 1;
  I2C0_RA = I2C0_RA + 1;
  I2C0_SMB = I2C0_SMB + 1;
  I2C0_A2 = I2C0_A2 + 1;
  I2C0_SLTH = I2C0_SLTH + 1;
  I2C0_SLTL = I2C0_SLTL + 1;
  I2C1_A1 = I2C1_A1 + 1;
  I2C1_F = I2C1_F + 1;
  I2C1_C1 = I2C1_C1 + 1;
  I2C1_S = I2C1_S + 1;
  I2C1_D = I2C1_D + 1;
  I2C1_C2 = I2C1_C2 + 1;
  I2C1_FLT = I2C1_FLT + 1;
  I2C1_RA = I2C1_RA + 1;
  I2C1_SMB = I2C1_SMB + 1;
  I2C1_A2 = I2C1_A2 + 1;
  I2C1_SLTH = I2C1_SLTH + 1;
  I2C1_SLTL = I2C1_SLTL + 1;
  I2C_A1_REG(I2C0) = I2C_A1_REG(I2C0) + 1;
  I2C_A1_REG(I2C1) = I2C_A1_REG(I2C1) + 1;
  (void)I2C_A1_AD_MASK;
  (void)I2C_A1_AD_SHIFT;
  (void)I2C_A1_AD(1);
  I2C0_A1 |= I2C_A1_AD_MASK;
  I2C0_A1 &= ~(1U << I2C_A1_AD_SHIFT);
  I2C_F_REG(I2C0) = I2C_F_REG(I2C0) + 1;
  I2C_F_REG(I2C1) = I2C_F_REG(I2C1) + 1;
  (void)I2C_F_ICR_MASK;
  (void)I2C_F_ICR_SHIFT;
  (void)I2C_F_ICR(1);
  I2C0_F |= I2C_F_ICR_MASK;
  I2C0_F &= ~(1U << I2C_F_ICR_SHIFT);
  (void)I2C_F_MULT_MASK;
  (void)I2C_F_MULT_SHIFT;
  (void)I2C_F_MULT(1);
  I2C0_F |= I2C_F_MULT_MASK;
  I2C0_F &= ~(1U << I2C_F_MULT_SHIFT);
  I2C_C1_REG(I2C0) = I2C_C1_REG(I2C0) + 1;
  I2C_C1_REG(I2C1) = I2C_C1_REG(I2C1) + 1;
  (void)I2C_C1_DMAEN_MASK;
  (void)I2C_C1_DMAEN_SHIFT;
  I2C0_C1 |= I2C_C1_DMAEN_MASK;
  I2C0_C1 &= ~(1U << I2C_C1_DMAEN_SHIFT);
  (void)I2C_C1_WUEN_MASK;
  (void)I2C_C1_WUEN_SHIFT;
  I2C0_C1 |= I2C_C1_WUEN_MASK;
  I2C0_C1 &= ~(1U << I2C_C1_WUEN_SHIFT);
  (void)I2C_C1_RSTA_MASK;
  (void)I2C_C1_RSTA_SHIFT;
  I2C0_C1 |= I2C_C1_RSTA_MASK;
  I2C0_C1 &= ~(1U << I2C_C1_RSTA_SHIFT);
  (void)I2C_C1_TXAK_MASK;
  (void)I2C_C1_TXAK_SHIFT;
  I2C0_C1 |= I2C_C1_TXAK_MASK;
  I2C0_C1 &= ~(1U << I2C_C1_TXAK_SHIFT);
  (void)I2C_C1_TX_MASK;
  (void)I2C_C1_TX_SHIFT;
  I2C0_C1 |= I2C_C1_TX_MASK;
  I2C0_C1 &= ~(1U << I2C_C1_TX_SHIFT);
  (void)I2C_C1_MST_MASK;
  (void)I2C_C1_MST_SHIFT;
  I2C0_C1 |= I2C_C1_MST_MASK;
  I2C0_C1 &= ~(1U << I2C_C1_MST_SHIFT);
  (void)I2C_C1_IICIE_MASK;
  (void)I2C_C1_IICIE_SHIFT;
  I2C0_C1 |= I2C_C1_IICIE_MASK;
  I2C0_C1 &= ~(1U << I2C_C1_IICIE_SHIFT);
  (void)I2C_C1_IICEN_MASK;
  (void)I2C_C1_IICEN_SHIFT;
  I2C0_C1 |= I2C_C1_IICEN_MASK;
  I2C0_C1 &= ~(1U << I2C_C1_IICEN_SHIFT);
  I2C_S_REG(I2C0) = I2C_S_REG(I2C0) + 1;
  I2C_S_REG(I2C1) = I2C_S_REG(I2C1) + 1;
  (void)I2C_S_RXAK_MASK;
  (void)I2C_S_RXAK_SHIFT;
  I2C0_S |= I2C_S_RXAK_MASK;
  I2C0_S &= ~(1U << I2C_S_RXAK_SHIFT);
  (void)I2C_S_IICIF_MASK;
  (void)I2C_S_IICIF_SHIFT;
  I2C0_S |= I2C_S_IICIF_MASK;
  I2C0_S &= ~(1U << I2C_S_IICIF_SHIFT);
  (void)I2C_S_SRW_MASK;
  (void)I2C_S_SRW_SHIFT;
  I2C0_S |= I2C_S_SRW_MASK;
  I2C0_S &= ~(1U << I2C_S_SRW_SHIFT);
  (void)I2C_S_RAM_MASK;
  (void)I2C_S_RAM_SHIFT;
  I2C0_S |= I2C_S_RAM_MASK;
  I2C0_S &= ~(1U << I2C_S_RAM_SHIFT);
  (void)I2C_S_ARBL_MASK;
  (void)I2C_S_ARBL_SHIFT;
  I2C0_S |= I2C_S_ARBL_MASK;
  I2C0_S &= ~(1U << I2C_S_ARBL_SHIFT);
  (void)I2C_S_BUSY_MASK;
  (void)I2C_S_BUSY_SHIFT;
  I2C0_S |= I2C_S_BUSY_MASK;
  I2C0_S &= ~(1U << I2C_S_BUSY_SHIFT);
  (void)I2C_S_IAAS_MASK;
  (void)I2C_S_IAAS_SHIFT;
  I2C0_S |= I2C_S_IAAS_MASK;
  I2C0_S &= ~(1U << I2C_S_IAAS_SHIFT);
  (void)I2C_S_TCF_MASK;
  (void)I2C_S_TCF_SHIFT;
  I2C0_S |= I2C_S_TCF_MASK;
  I2C0_S &= ~(1U << I2C_S_TCF_SHIFT);
  I2C_D_REG(I2C0) = I2C_D_REG(I2C0) + 1;
  I2C_D_REG(I2C1) = I2C_D_REG(I2C1) + 1;
  (void)I2C_D_DATA_MASK;
  (void)I2C_D_DATA_SHIFT;
  (void)I2C_D_DATA(1);
  I2C0_D |= I2C_D_DATA_MASK;
  I2C0_D &= ~(1U << I2C_D_DATA_SHIFT);
  I2C_C2_REG(I2C0) = I2C_C2_REG(I2C0) + 1;
  I2C_C2_REG(I2C1) = I2C_C2_REG(I2C1) + 1;
  (void)I2C_C2_AD_MASK;
  (void)I2C_C2_AD_SHIFT;
  (void)I2C_C2_AD(1);
  I2C0_C2 |= I2C_C2_AD_MASK;
  I2C0_C2 &= ~(1U << I2C_C2_AD_SHIFT);
  (void)I2C_C2_RMEN_MASK;
  (void)I2C_C2_RMEN_SHIFT;
  I2C0_C2 |= I2C_C2_RMEN_MASK;
  I2C0_C2 &= ~(1U << I2C_C2_RMEN_SHIFT);
  (void)I2C_C2_SBRC_MASK;
  (void)I2C_C2_SBRC_SHIFT;
  I2C0_C2 |= I2C_C2_SBRC_MASK;
  I2C0_C2 &= ~(1U << I2C_C2_SBRC_SHIFT);
  (void)I2C_C2_HDRS_MASK;
  (void)I2C_C2_HDRS_SHIFT;
  I2C0_C2 |= I2C_C2_HDRS_MASK;
  I2C0_C2 &= ~(1U << I2C_C2_HDRS_SHIFT);
  (void)I2C_C2_ADEXT_MASK;
  (void)I2C_C2_ADEXT_SHIFT;
  I2C0_C2 |= I2C_C2_ADEXT_MASK;
  I2C0_C2 &= ~(1U << I2C_C2_ADEXT_SHIFT);
  (void)I2C_C2_GCAEN_MASK;
  (void)I2C_C2_GCAEN_SHIFT;
  I2C0_C2 |= I2C_C2_GCAEN_MASK;
  I2C0_C2 &= ~(1U << I2C_C2_GCAEN_SHIFT);
  I2C_FLT_REG(I2C0) = I2C_FLT_REG(I2C0) + 1;
  I2C_FLT_REG(I2C1) = I2C_FLT_REG(I2C1) + 1;
  (void)I2C_FLT_FLT_MASK;
  (void)I2C_FLT_FLT_SHIFT;
  (void)I2C_FLT_FLT(1);
  I2C0_FLT |= I2C_FLT_FLT_MASK;
  I2C0_FLT &= ~(1U << I2C_FLT_FLT_SHIFT);
  (void)I2C_FLT_STARTF_MASK;
  (void)I2C_FLT_STARTF_SHIFT;
  I2C0_FLT |= I2C_FLT_STARTF_MASK;
  I2C0_FLT &= ~(1U << I2C_FLT_STARTF_SHIFT);
  (void)I2C_FLT_SSIE_MASK;
  (void)I2C_FLT_SSIE_SHIFT;
  I2C0_FLT |= I2C_FLT_SSIE_MASK;
  I2C0_FLT &= ~(1U << I2C_FLT_SSIE_SHIFT);
  (void)I2C_FLT_STOPF_MASK;
  (void)I2C_FLT_STOPF_SHIFT;
  I2C0_FLT |= I2C_FLT_STOPF_MASK;
  I2C0_FLT &= ~(1U << I2C_FLT_STOPF_SHIFT);
  (void)I2C_FLT_SHEN_MASK;
  (void)I2C_FLT_SHEN_SHIFT;
  I2C0_FLT |= I2C_FLT_SHEN_MASK;
  I2C0_FLT &= ~(1U << I2C_FLT_SHEN_SHIFT);
  I2C_RA_REG(I2C0) = I2C_RA_REG(I2C0) + 1;
  I2C_RA_REG(I2C1) = I2C_RA_REG(I2C1) + 1;
  (void)I2C_RA_RAD_MASK;
  (void)I2C_RA_RAD_SHIFT;
  (void)I2C_RA_RAD(1);
  I2C0_RA |= I2C_RA_RAD_MASK;
  I2C0_RA &= ~(1U << I2C_RA_RAD_SHIFT);
  I2C_SMB_REG(I2C0) = I2C_SMB_REG(I2C0) + 1;
  I2C_SMB_REG(I2C1) = I2C_SMB_REG(I2C1) + 1;
  (void)I2C_SMB_SHTF2IE_MASK;
  (void)I2C_SMB_SHTF2IE_SHIFT;
  I2C0_SMB |= I2C_SMB_SHTF2IE_MASK;
  I2C0_SMB &= ~(1U << I2C_SMB_SHTF2IE_SHIFT);
  (void)I2C_SMB_SHTF2_MASK;
  (void)I2C_SMB_SHTF2_SHIFT;
  I2C0_SMB |= I2C_SMB_SHTF2_MASK;
  I2C0_SMB &= ~(1U << I2C_SMB_SHTF2_SHIFT);
  (void)I2C_SMB_SHTF1_MASK;
  (void)I2C_SMB_SHTF1_SHIFT;
  I2C0_SMB |= I2C_SMB_SHTF1_MASK;
  I2C0_SMB &= ~(1U << I2C_SMB_SHTF1_SHIFT);
  (void)I2C_SMB_SLTF_MASK;
  (void)I2C_SMB_SLTF_SHIFT;
  I2C0_SMB |= I2C_SMB_SLTF_MASK;
  I2C0_SMB &= ~(1U << I2C_SMB_SLTF_SHIFT);
  (void)I2C_SMB_TCKSEL_MASK;
  (void)I2C_SMB_TCKSEL_SHIFT;
  I2C0_SMB |= I2C_SMB_TCKSEL_MASK;
  I2C0_SMB &= ~(1U << I2C_SMB_TCKSEL_SHIFT);
  (void)I2C_SMB_SIICAEN_MASK;
  (void)I2C_SMB_SIICAEN_SHIFT;
  I2C0_SMB |= I2C_SMB_SIICAEN_MASK;
  I2C0_SMB &= ~(1U << I2C_SMB_SIICAEN_SHIFT);
  (void)I2C_SMB_ALERTEN_MASK;
  (void)I2C_SMB_ALERTEN_SHIFT;
  I2C0_SMB |= I2C_SMB_ALERTEN_MASK;
  I2C0_SMB &= ~(1U << I2C_SMB_ALERTEN_SHIFT);
  (void)I2C_SMB_FACK_MASK;
  (void)I2C_SMB_FACK_SHIFT;
  I2C0_SMB |= I2C_SMB_FACK_MASK;
  I2C0_SMB &= ~(1U << I2C_SMB_FACK_SHIFT);
  I2C_A2_REG(I2C0) = I2C_A2_REG(I2C0) + 1;
  I2C_A2_REG(I2C1) = I2C_A2_REG(I2C1) + 1;
  (void)I2C_A2_SAD_MASK;
  (void)I2C_A2_SAD_SHIFT;
  (void)I2C_A2_SAD(1);
  I2C0_A2 |= I2C_A2_SAD_MASK;
  I2C0_A2 &= ~(1U << I2C_A2_SAD_SHIFT);
  I2C_SLTH_REG(I2C0) = I2C_SLTH_REG(I2C0) + 1;
  I2C_SLTH_REG(I2C1) = I2C_SLTH_REG(I2C1) + 1;
  (void)I2C_SLTH_SSLT_MASK;
  (void)I2C_SLTH_SSLT_SHIFT;
  (void)I2C_SLTH_SSLT(1);
  I2C0_SLTH |= I2C_SLTH_SSLT_MASK;
  I2C0_SLTH &= ~(1U << I2C_SLTH_SSLT_SHIFT);
  I2C_SLTL_REG(I2C0) = I2C_SLTL_REG(I2C0) + 1;
  I2C_SLTL_REG(I2C1) = I2C_SLTL_REG(I2C1) + 1;
  (void)I2C_SLTL_SSLT_MASK;
  (void)I2C_SLTL_SSLT_SHIFT;
  (void)I2C_SLTL_SSLT(1);
  I2C0_SLTL |= I2C_SLTL_SSLT_MASK;
  I2C0_SLTL &= ~(1U << I2C_SLTL_SSLT_SHIFT);
}

