kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/CMSIS_Test_MKM33Z5_v1_3.c
void test_LCD(void) {
  (void)LCD_BASE;
  (void)LCD;
  LCD_GCR = LCD_GCR + 1;
  LCD_AR = LCD_AR + 1;
  LCD_FDCR = LCD_FDCR + 1;
  LCD_FDSR = LCD_FDSR + 1;
  LCD_PENL = LCD_PENL + 1;
  LCD_PENH = LCD_PENH + 1;
  LCD_BPENL = LCD_BPENL + 1;
  LCD_BPENH = LCD_BPENH + 1;
  LCD_WF0 = LCD_WF0 + 1;
  LCD_WF3TO0 = LCD_WF3TO0 + 1;
  LCD_WF1 = LCD_WF1 + 1;
  LCD_WF2 = LCD_WF2 + 1;
  LCD_WF3 = LCD_WF3 + 1;
  LCD_WF4 = LCD_WF4 + 1;
  LCD_WF7TO4 = LCD_WF7TO4 + 1;
  LCD_WF5 = LCD_WF5 + 1;
  LCD_WF6 = LCD_WF6 + 1;
  LCD_WF7 = LCD_WF7 + 1;
  LCD_WF11TO8 = LCD_WF11TO8 + 1;
  LCD_WF8 = LCD_WF8 + 1;
  LCD_WF9 = LCD_WF9 + 1;
  LCD_WF10 = LCD_WF10 + 1;
  LCD_WF11 = LCD_WF11 + 1;
  LCD_WF12 = LCD_WF12 + 1;
  LCD_WF15TO12 = LCD_WF15TO12 + 1;
  LCD_WF13 = LCD_WF13 + 1;
  LCD_WF14 = LCD_WF14 + 1;
  LCD_WF15 = LCD_WF15 + 1;
  LCD_WF16 = LCD_WF16 + 1;
  LCD_WF19TO16 = LCD_WF19TO16 + 1;
  LCD_WF17 = LCD_WF17 + 1;
  LCD_WF18 = LCD_WF18 + 1;
  LCD_WF19 = LCD_WF19 + 1;
  LCD_WF20 = LCD_WF20 + 1;
  LCD_WF23TO20 = LCD_WF23TO20 + 1;
  LCD_WF21 = LCD_WF21 + 1;
  LCD_WF22 = LCD_WF22 + 1;
  LCD_WF23 = LCD_WF23 + 1;
  LCD_WF24 = LCD_WF24 + 1;
  LCD_WF27TO24 = LCD_WF27TO24 + 1;
  LCD_WF25 = LCD_WF25 + 1;
  LCD_WF26 = LCD_WF26 + 1;
  LCD_WF27 = LCD_WF27 + 1;
  LCD_WF28 = LCD_WF28 + 1;
  LCD_WF31TO28 = LCD_WF31TO28 + 1;
  LCD_WF29 = LCD_WF29 + 1;
  LCD_WF30 = LCD_WF30 + 1;
  LCD_WF31 = LCD_WF31 + 1;
  LCD_WF32 = LCD_WF32 + 1;
  LCD_WF35TO32 = LCD_WF35TO32 + 1;
  LCD_WF33 = LCD_WF33 + 1;
  LCD_WF34 = LCD_WF34 + 1;
  LCD_WF35 = LCD_WF35 + 1;
  LCD_WF36 = LCD_WF36 + 1;
  LCD_WF39TO36 = LCD_WF39TO36 + 1;
  LCD_WF37 = LCD_WF37 + 1;
  LCD_WF38 = LCD_WF38 + 1;
  LCD_WF39 = LCD_WF39 + 1;
  LCD_WF40 = LCD_WF40 + 1;
  LCD_WF43TO40 = LCD_WF43TO40 + 1;
  LCD_WF41 = LCD_WF41 + 1;
  LCD_WF42 = LCD_WF42 + 1;
  LCD_WF43 = LCD_WF43 + 1;
  LCD_WF44 = LCD_WF44 + 1;
  LCD_WF47TO44 = LCD_WF47TO44 + 1;
  LCD_WF45 = LCD_WF45 + 1;
  LCD_WF46 = LCD_WF46 + 1;
  LCD_WF47 = LCD_WF47 + 1;
  LCD_WF48 = LCD_WF48 + 1;
  LCD_WF51TO48 = LCD_WF51TO48 + 1;
  LCD_WF49 = LCD_WF49 + 1;
  LCD_WF50 = LCD_WF50 + 1;
  LCD_WF51 = LCD_WF51 + 1;
  LCD_WF52 = LCD_WF52 + 1;
  LCD_WF55TO52 = LCD_WF55TO52 + 1;
  LCD_WF53 = LCD_WF53 + 1;
  LCD_WF54 = LCD_WF54 + 1;
  LCD_WF55 = LCD_WF55 + 1;
  LCD_WF56 = LCD_WF56 + 1;
  LCD_WF59TO56 = LCD_WF59TO56 + 1;
  LCD_WF57 = LCD_WF57 + 1;
  LCD_WF58 = LCD_WF58 + 1;
  LCD_WF59 = LCD_WF59 + 1;
  LCD_WF60 = LCD_WF60 + 1;
  LCD_WF63TO60 = LCD_WF63TO60 + 1;
  LCD_WF61 = LCD_WF61 + 1;
  LCD_WF62 = LCD_WF62 + 1;
  LCD_WF63 = LCD_WF63 + 1;
  LCD_GCR_REG(LCD) = LCD_GCR_REG(LCD) + 1;
  (void)LCD_GCR_DUTY_MASK;
  (void)LCD_GCR_DUTY_SHIFT;
  (void)LCD_GCR_DUTY(1);
  LCD_GCR |= LCD_GCR_DUTY_MASK;
  LCD_GCR &= ~(1U << LCD_GCR_DUTY_SHIFT);
  (void)LCD_GCR_LCLK_MASK;
  (void)LCD_GCR_LCLK_SHIFT;
  (void)LCD_GCR_LCLK(1);
  LCD_GCR |= LCD_GCR_LCLK_MASK;
  LCD_GCR &= ~(1U << LCD_GCR_LCLK_SHIFT);
  (void)LCD_GCR_SOURCE_MASK;
  (void)LCD_GCR_SOURCE_SHIFT;
  LCD_GCR |= LCD_GCR_SOURCE_MASK;
  LCD_GCR &= ~(1U << LCD_GCR_SOURCE_SHIFT);
  (void)LCD_GCR_LCDEN_MASK;
  (void)LCD_GCR_LCDEN_SHIFT;
  LCD_GCR |= LCD_GCR_LCDEN_MASK;
  LCD_GCR &= ~(1U << LCD_GCR_LCDEN_SHIFT);
  (void)LCD_GCR_LCDSTP_MASK;
  (void)LCD_GCR_LCDSTP_SHIFT;
  LCD_GCR |= LCD_GCR_LCDSTP_MASK;
  LCD_GCR &= ~(1U << LCD_GCR_LCDSTP_SHIFT);
  (void)LCD_GCR_LCDDOZE_MASK;
  (void)LCD_GCR_LCDDOZE_SHIFT;
  LCD_GCR |= LCD_GCR_LCDDOZE_MASK;
  LCD_GCR &= ~(1U << LCD_GCR_LCDDOZE_SHIFT);
  (void)LCD_GCR_ALTDIV_MASK;
  (void)LCD_GCR_ALTDIV_SHIFT;
  (void)LCD_GCR_ALTDIV(1);
  LCD_GCR |= LCD_GCR_ALTDIV_MASK;
  LCD_GCR &= ~(1U << LCD_GCR_ALTDIV_SHIFT);
  (void)LCD_GCR_FDCIEN_MASK;
  (void)LCD_GCR_FDCIEN_SHIFT;
  LCD_GCR |= LCD_GCR_FDCIEN_MASK;
  LCD_GCR &= ~(1U << LCD_GCR_FDCIEN_SHIFT);
  (void)LCD_GCR_LCDIEN_MASK;
  (void)LCD_GCR_LCDIEN_SHIFT;
  LCD_GCR |= LCD_GCR_LCDIEN_MASK;
  LCD_GCR &= ~(1U << LCD_GCR_LCDIEN_SHIFT);
  (void)LCD_GCR_VSUPPLY_MASK;
  (void)LCD_GCR_VSUPPLY_SHIFT;
  LCD_GCR |= LCD_GCR_VSUPPLY_MASK;
  LCD_GCR &= ~(1U << LCD_GCR_VSUPPLY_SHIFT);
  (void)LCD_GCR_LADJ_MASK;
  (void)LCD_GCR_LADJ_SHIFT;
  (void)LCD_GCR_LADJ(1);
  LCD_GCR |= LCD_GCR_LADJ_MASK;
  LCD_GCR &= ~(1U << LCD_GCR_LADJ_SHIFT);
  (void)LCD_GCR_CPSEL_MASK;
  (void)LCD_GCR_CPSEL_SHIFT;
  LCD_GCR |= LCD_GCR_CPSEL_MASK;
  LCD_GCR &= ~(1U << LCD_GCR_CPSEL_SHIFT);
  (void)LCD_GCR_RVTRIM_MASK;
  (void)LCD_GCR_RVTRIM_SHIFT;
  (void)LCD_GCR_RVTRIM(1);
  LCD_GCR |= LCD_GCR_RVTRIM_MASK;
  LCD_GCR &= ~(1U << LCD_GCR_RVTRIM_SHIFT);
  (void)LCD_GCR_RVEN_MASK;
  (void)LCD_GCR_RVEN_SHIFT;
  LCD_GCR |= LCD_GCR_RVEN_MASK;
  LCD_GCR &= ~(1U << LCD_GCR_RVEN_SHIFT);
  LCD_AR_REG(LCD) = LCD_AR_REG(LCD) + 1;
  (void)LCD_AR_BRATE_MASK;
  (void)LCD_AR_BRATE_SHIFT;
  (void)LCD_AR_BRATE(1);
  LCD_AR |= LCD_AR_BRATE_MASK;
  LCD_AR &= ~(1U << LCD_AR_BRATE_SHIFT);
  (void)LCD_AR_BMODE_MASK;
  (void)LCD_AR_BMODE_SHIFT;
  LCD_AR |= LCD_AR_BMODE_MASK;
  LCD_AR &= ~(1U << LCD_AR_BMODE_SHIFT);
  (void)LCD_AR_BLANK_MASK;
  (void)LCD_AR_BLANK_SHIFT;
  LCD_AR |= LCD_AR_BLANK_MASK;
  LCD_AR &= ~(1U << LCD_AR_BLANK_SHIFT);
  (void)LCD_AR_ALT_MASK;
  (void)LCD_AR_ALT_SHIFT;
  LCD_AR |= LCD_AR_ALT_MASK;
  LCD_AR &= ~(1U << LCD_AR_ALT_SHIFT);
  (void)LCD_AR_BLINK_MASK;
  (void)LCD_AR_BLINK_SHIFT;
  LCD_AR |= LCD_AR_BLINK_MASK;
  LCD_AR &= ~(1U << LCD_AR_BLINK_SHIFT);
  (void)LCD_AR_LCDIF_MASK;
  (void)LCD_AR_LCDIF_SHIFT;
  LCD_AR |= LCD_AR_LCDIF_MASK;
  LCD_AR &= ~(1U << LCD_AR_LCDIF_SHIFT);
  LCD_FDCR_REG(LCD) = LCD_FDCR_REG(LCD) + 1;
  (void)LCD_FDCR_FDPINID_MASK;
  (void)LCD_FDCR_FDPINID_SHIFT;
  (void)LCD_FDCR_FDPINID(1);
  LCD_FDCR |= LCD_FDCR_FDPINID_MASK;
  LCD_FDCR &= ~(1U << LCD_FDCR_FDPINID_SHIFT);
  (void)LCD_FDCR_FDBPEN_MASK;
  (void)LCD_FDCR_FDBPEN_SHIFT;
  LCD_FDCR |= LCD_FDCR_FDBPEN_MASK;
  LCD_FDCR &= ~(1U << LCD_FDCR_FDBPEN_SHIFT);
  (void)LCD_FDCR_FDEN_MASK;
  (void)LCD_FDCR_FDEN_SHIFT;
  LCD_FDCR |= LCD_FDCR_FDEN_MASK;
  LCD_FDCR &= ~(1U << LCD_FDCR_FDEN_SHIFT);
  (void)LCD_FDCR_FDSWW_MASK;
  (void)LCD_FDCR_FDSWW_SHIFT;
  (void)LCD_FDCR_FDSWW(1);
  LCD_FDCR |= LCD_FDCR_FDSWW_MASK;
  LCD_FDCR &= ~(1U << LCD_FDCR_FDSWW_SHIFT);
  (void)LCD_FDCR_FDPRS_MASK;
  (void)LCD_FDCR_FDPRS_SHIFT;
  (void)LCD_FDCR_FDPRS(1);
  LCD_FDCR |= LCD_FDCR_FDPRS_MASK;
  LCD_FDCR &= ~(1U << LCD_FDCR_FDPRS_SHIFT);
  LCD_FDSR_REG(LCD) = LCD_FDSR_REG(LCD) + 1;
  (void)LCD_FDSR_FDCNT_MASK;
  (void)LCD_FDSR_FDCNT_SHIFT;
  (void)LCD_FDSR_FDCNT(1);
  LCD_FDSR |= LCD_FDSR_FDCNT_MASK;
  LCD_FDSR &= ~(1U << LCD_FDSR_FDCNT_SHIFT);
  (void)LCD_FDSR_FDCF_MASK;
  (void)LCD_FDSR_FDCF_SHIFT;
  LCD_FDSR |= LCD_FDSR_FDCF_MASK;
  LCD_FDSR &= ~(1U << LCD_FDSR_FDCF_SHIFT);
  LCD_PEN_REG(LCD,0) = LCD_PEN_REG(LCD,0) + 1;
  LCD_PEN(0) = LCD_PEN(0) + 1;
  (void)LCD_PEN_PEN_MASK;
  (void)LCD_PEN_PEN_SHIFT;
  (void)LCD_PEN_PEN(1);
  LCD_PENL |= LCD_PEN_PEN_MASK;
  LCD_PENL &= ~(1U << LCD_PEN_PEN_SHIFT);
  LCD_BPEN_REG(LCD,0) = LCD_BPEN_REG(LCD,0) + 1;
  LCD_BPEN(0) = LCD_BPEN(0) + 1;
  (void)LCD_BPEN_BPEN_MASK;
  (void)LCD_BPEN_BPEN_SHIFT;
  (void)LCD_BPEN_BPEN(1);
  LCD_BPENL |= LCD_BPEN_BPEN_MASK;
  LCD_BPENL &= ~(1U << LCD_BPEN_BPEN_SHIFT);
  LCD_WF_REG(LCD,0) = LCD_WF_REG(LCD,0) + 1;
  LCD_WF(0) = LCD_WF(0) + 1;
  (void)LCD_WF_WF0_MASK;
  (void)LCD_WF_WF0_SHIFT;
  (void)LCD_WF_WF0(1);
  LCD_WF3TO0 |= LCD_WF_WF0_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF0_SHIFT);
  (void)LCD_WF_WF60_MASK;
  (void)LCD_WF_WF60_SHIFT;
  (void)LCD_WF_WF60(1);
  LCD_WF3TO0 |= LCD_WF_WF60_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF60_SHIFT);
  (void)LCD_WF_WF56_MASK;
  (void)LCD_WF_WF56_SHIFT;
  (void)LCD_WF_WF56(1);
  LCD_WF3TO0 |= LCD_WF_WF56_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF56_SHIFT);
  (void)LCD_WF_WF52_MASK;
  (void)LCD_WF_WF52_SHIFT;
  (void)LCD_WF_WF52(1);
  LCD_WF3TO0 |= LCD_WF_WF52_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF52_SHIFT);
  (void)LCD_WF_WF4_MASK;
  (void)LCD_WF_WF4_SHIFT;
  (void)LCD_WF_WF4(1);
  LCD_WF3TO0 |= LCD_WF_WF4_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF4_SHIFT);
  (void)LCD_WF_WF48_MASK;
  (void)LCD_WF_WF48_SHIFT;
  (void)LCD_WF_WF48(1);
  LCD_WF3TO0 |= LCD_WF_WF48_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF48_SHIFT);
  (void)LCD_WF_WF44_MASK;
  (void)LCD_WF_WF44_SHIFT;
  (void)LCD_WF_WF44(1);
  LCD_WF3TO0 |= LCD_WF_WF44_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF44_SHIFT);
  (void)LCD_WF_WF40_MASK;
  (void)LCD_WF_WF40_SHIFT;
  (void)LCD_WF_WF40(1);
  LCD_WF3TO0 |= LCD_WF_WF40_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF40_SHIFT);
  (void)LCD_WF_WF8_MASK;
  (void)LCD_WF_WF8_SHIFT;
  (void)LCD_WF_WF8(1);
  LCD_WF3TO0 |= LCD_WF_WF8_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF8_SHIFT);
  (void)LCD_WF_WF36_MASK;
  (void)LCD_WF_WF36_SHIFT;
  (void)LCD_WF_WF36(1);
  LCD_WF3TO0 |= LCD_WF_WF36_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF36_SHIFT);
  (void)LCD_WF_WF32_MASK;
  (void)LCD_WF_WF32_SHIFT;
  (void)LCD_WF_WF32(1);
  LCD_WF3TO0 |= LCD_WF_WF32_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF32_SHIFT);
  (void)LCD_WF_WF28_MASK;
  (void)LCD_WF_WF28_SHIFT;
  (void)LCD_WF_WF28(1);
  LCD_WF3TO0 |= LCD_WF_WF28_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF28_SHIFT);
  (void)LCD_WF_WF12_MASK;
  (void)LCD_WF_WF12_SHIFT;
  (void)LCD_WF_WF12(1);
  LCD_WF3TO0 |= LCD_WF_WF12_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF12_SHIFT);
  (void)LCD_WF_WF24_MASK;
  (void)LCD_WF_WF24_SHIFT;
  (void)LCD_WF_WF24(1);
  LCD_WF3TO0 |= LCD_WF_WF24_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF24_SHIFT);
  (void)LCD_WF_WF20_MASK;
  (void)LCD_WF_WF20_SHIFT;
  (void)LCD_WF_WF20(1);
  LCD_WF3TO0 |= LCD_WF_WF20_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF20_SHIFT);
  (void)LCD_WF_WF16_MASK;
  (void)LCD_WF_WF16_SHIFT;
  (void)LCD_WF_WF16(1);
  LCD_WF3TO0 |= LCD_WF_WF16_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF16_SHIFT);
  (void)LCD_WF_WF5_MASK;
  (void)LCD_WF_WF5_SHIFT;
  (void)LCD_WF_WF5(1);
  LCD_WF3TO0 |= LCD_WF_WF5_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF5_SHIFT);
  (void)LCD_WF_WF49_MASK;
  (void)LCD_WF_WF49_SHIFT;
  (void)LCD_WF_WF49(1);
  LCD_WF3TO0 |= LCD_WF_WF49_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF49_SHIFT);
  (void)LCD_WF_WF45_MASK;
  (void)LCD_WF_WF45_SHIFT;
  (void)LCD_WF_WF45(1);
  LCD_WF3TO0 |= LCD_WF_WF45_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF45_SHIFT);
  (void)LCD_WF_WF61_MASK;
  (void)LCD_WF_WF61_SHIFT;
  (void)LCD_WF_WF61(1);
  LCD_WF3TO0 |= LCD_WF_WF61_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF61_SHIFT);
  (void)LCD_WF_WF25_MASK;
  (void)LCD_WF_WF25_SHIFT;
  (void)LCD_WF_WF25(1);
  LCD_WF3TO0 |= LCD_WF_WF25_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF25_SHIFT);
  (void)LCD_WF_WF17_MASK;
  (void)LCD_WF_WF17_SHIFT;
  (void)LCD_WF_WF17(1);
  LCD_WF3TO0 |= LCD_WF_WF17_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF17_SHIFT);
  (void)LCD_WF_WF41_MASK;
  (void)LCD_WF_WF41_SHIFT;
  (void)LCD_WF_WF41(1);
  LCD_WF3TO0 |= LCD_WF_WF41_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF41_SHIFT);
  (void)LCD_WF_WF13_MASK;
  (void)LCD_WF_WF13_SHIFT;
  (void)LCD_WF_WF13(1);
  LCD_WF3TO0 |= LCD_WF_WF13_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF13_SHIFT);
  (void)LCD_WF_WF57_MASK;
  (void)LCD_WF_WF57_SHIFT;
  (void)LCD_WF_WF57(1);
  LCD_WF3TO0 |= LCD_WF_WF57_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF57_SHIFT);
  (void)LCD_WF_WF53_MASK;
  (void)LCD_WF_WF53_SHIFT;
  (void)LCD_WF_WF53(1);
  LCD_WF3TO0 |= LCD_WF_WF53_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF53_SHIFT);
  (void)LCD_WF_WF37_MASK;
  (void)LCD_WF_WF37_SHIFT;
  (void)LCD_WF_WF37(1);
  LCD_WF3TO0 |= LCD_WF_WF37_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF37_SHIFT);
  (void)LCD_WF_WF9_MASK;
  (void)LCD_WF_WF9_SHIFT;
  (void)LCD_WF_WF9(1);
  LCD_WF3TO0 |= LCD_WF_WF9_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF9_SHIFT);
  (void)LCD_WF_WF1_MASK;
  (void)LCD_WF_WF1_SHIFT;
  (void)LCD_WF_WF1(1);
  LCD_WF3TO0 |= LCD_WF_WF1_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF1_SHIFT);
  (void)LCD_WF_WF29_MASK;
  (void)LCD_WF_WF29_SHIFT;
  (void)LCD_WF_WF29(1);
  LCD_WF3TO0 |= LCD_WF_WF29_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF29_SHIFT);
  (void)LCD_WF_WF33_MASK;
  (void)LCD_WF_WF33_SHIFT;
  (void)LCD_WF_WF33(1);
  LCD_WF3TO0 |= LCD_WF_WF33_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF33_SHIFT);
  (void)LCD_WF_WF21_MASK;
  (void)LCD_WF_WF21_SHIFT;
  (void)LCD_WF_WF21(1);
  LCD_WF3TO0 |= LCD_WF_WF21_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF21_SHIFT);
  (void)LCD_WF_WF26_MASK;
  (void)LCD_WF_WF26_SHIFT;
  (void)LCD_WF_WF26(1);
  LCD_WF3TO0 |= LCD_WF_WF26_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF26_SHIFT);
  (void)LCD_WF_WF46_MASK;
  (void)LCD_WF_WF46_SHIFT;
  (void)LCD_WF_WF46(1);
  LCD_WF3TO0 |= LCD_WF_WF46_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF46_SHIFT);
  (void)LCD_WF_WF6_MASK;
  (void)LCD_WF_WF6_SHIFT;
  (void)LCD_WF_WF6(1);
  LCD_WF3TO0 |= LCD_WF_WF6_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF6_SHIFT);
  (void)LCD_WF_WF42_MASK;
  (void)LCD_WF_WF42_SHIFT;
  (void)LCD_WF_WF42(1);
  LCD_WF3TO0 |= LCD_WF_WF42_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF42_SHIFT);
  (void)LCD_WF_WF18_MASK;
  (void)LCD_WF_WF18_SHIFT;
  (void)LCD_WF_WF18(1);
  LCD_WF3TO0 |= LCD_WF_WF18_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF18_SHIFT);
  (void)LCD_WF_WF38_MASK;
  (void)LCD_WF_WF38_SHIFT;
  (void)LCD_WF_WF38(1);
  LCD_WF3TO0 |= LCD_WF_WF38_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF38_SHIFT);
  (void)LCD_WF_WF22_MASK;
  (void)LCD_WF_WF22_SHIFT;
  (void)LCD_WF_WF22(1);
  LCD_WF3TO0 |= LCD_WF_WF22_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF22_SHIFT);
  (void)LCD_WF_WF34_MASK;
  (void)LCD_WF_WF34_SHIFT;
  (void)LCD_WF_WF34(1);
  LCD_WF3TO0 |= LCD_WF_WF34_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF34_SHIFT);
  (void)LCD_WF_WF50_MASK;
  (void)LCD_WF_WF50_SHIFT;
  (void)LCD_WF_WF50(1);
  LCD_WF3TO0 |= LCD_WF_WF50_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF50_SHIFT);
  (void)LCD_WF_WF14_MASK;
  (void)LCD_WF_WF14_SHIFT;
  (void)LCD_WF_WF14(1);
  LCD_WF3TO0 |= LCD_WF_WF14_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF14_SHIFT);
  (void)LCD_WF_WF54_MASK;
  (void)LCD_WF_WF54_SHIFT;
  (void)LCD_WF_WF54(1);
  LCD_WF3TO0 |= LCD_WF_WF54_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF54_SHIFT);
  (void)LCD_WF_WF2_MASK;
  (void)LCD_WF_WF2_SHIFT;
  (void)LCD_WF_WF2(1);
  LCD_WF3TO0 |= LCD_WF_WF2_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF2_SHIFT);
  (void)LCD_WF_WF58_MASK;
  (void)LCD_WF_WF58_SHIFT;
  (void)LCD_WF_WF58(1);
  LCD_WF3TO0 |= LCD_WF_WF58_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF58_SHIFT);
  (void)LCD_WF_WF30_MASK;
  (void)LCD_WF_WF30_SHIFT;
  (void)LCD_WF_WF30(1);
  LCD_WF3TO0 |= LCD_WF_WF30_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF30_SHIFT);
  (void)LCD_WF_WF62_MASK;
  (void)LCD_WF_WF62_SHIFT;
  (void)LCD_WF_WF62(1);
  LCD_WF3TO0 |= LCD_WF_WF62_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF62_SHIFT);
  (void)LCD_WF_WF10_MASK;
  (void)LCD_WF_WF10_SHIFT;
  (void)LCD_WF_WF10(1);
  LCD_WF3TO0 |= LCD_WF_WF10_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF10_SHIFT);
  (void)LCD_WF_WF63_MASK;
  (void)LCD_WF_WF63_SHIFT;
  (void)LCD_WF_WF63(1);
  LCD_WF3TO0 |= LCD_WF_WF63_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF63_SHIFT);
  (void)LCD_WF_WF59_MASK;
  (void)LCD_WF_WF59_SHIFT;
  (void)LCD_WF_WF59(1);
  LCD_WF3TO0 |= LCD_WF_WF59_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF59_SHIFT);
  (void)LCD_WF_WF55_MASK;
  (void)LCD_WF_WF55_SHIFT;
  (void)LCD_WF_WF55(1);
  LCD_WF3TO0 |= LCD_WF_WF55_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF55_SHIFT);
  (void)LCD_WF_WF3_MASK;
  (void)LCD_WF_WF3_SHIFT;
  (void)LCD_WF_WF3(1);
  LCD_WF3TO0 |= LCD_WF_WF3_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF3_SHIFT);
  (void)LCD_WF_WF51_MASK;
  (void)LCD_WF_WF51_SHIFT;
  (void)LCD_WF_WF51(1);
  LCD_WF3TO0 |= LCD_WF_WF51_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF51_SHIFT);
  (void)LCD_WF_WF47_MASK;
  (void)LCD_WF_WF47_SHIFT;
  (void)LCD_WF_WF47(1);
  LCD_WF3TO0 |= LCD_WF_WF47_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF47_SHIFT);
  (void)LCD_WF_WF43_MASK;
  (void)LCD_WF_WF43_SHIFT;
  (void)LCD_WF_WF43(1);
  LCD_WF3TO0 |= LCD_WF_WF43_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF43_SHIFT);
  (void)LCD_WF_WF7_MASK;
  (void)LCD_WF_WF7_SHIFT;
  (void)LCD_WF_WF7(1);
  LCD_WF3TO0 |= LCD_WF_WF7_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF7_SHIFT);
  (void)LCD_WF_WF39_MASK;
  (void)LCD_WF_WF39_SHIFT;
  (void)LCD_WF_WF39(1);
  LCD_WF3TO0 |= LCD_WF_WF39_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF39_SHIFT);
  (void)LCD_WF_WF35_MASK;
  (void)LCD_WF_WF35_SHIFT;
  (void)LCD_WF_WF35(1);
  LCD_WF3TO0 |= LCD_WF_WF35_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF35_SHIFT);
  (void)LCD_WF_WF31_MASK;
  (void)LCD_WF_WF31_SHIFT;
  (void)LCD_WF_WF31(1);
  LCD_WF3TO0 |= LCD_WF_WF31_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF31_SHIFT);
  (void)LCD_WF_WF11_MASK;
  (void)LCD_WF_WF11_SHIFT;
  (void)LCD_WF_WF11(1);
  LCD_WF3TO0 |= LCD_WF_WF11_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF11_SHIFT);
  (void)LCD_WF_WF27_MASK;
  (void)LCD_WF_WF27_SHIFT;
  (void)LCD_WF_WF27(1);
  LCD_WF3TO0 |= LCD_WF_WF27_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF27_SHIFT);
  (void)LCD_WF_WF23_MASK;
  (void)LCD_WF_WF23_SHIFT;
  (void)LCD_WF_WF23(1);
  LCD_WF3TO0 |= LCD_WF_WF23_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF23_SHIFT);
  (void)LCD_WF_WF19_MASK;
  (void)LCD_WF_WF19_SHIFT;
  (void)LCD_WF_WF19(1);
  LCD_WF3TO0 |= LCD_WF_WF19_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF19_SHIFT);
  (void)LCD_WF_WF15_MASK;
  (void)LCD_WF_WF15_SHIFT;
  (void)LCD_WF_WF15(1);
  LCD_WF3TO0 |= LCD_WF_WF15_MASK;
  LCD_WF3TO0 &= ~(1U << LCD_WF_WF15_SHIFT);
  LCD_WF8B_REG(LCD,0) = LCD_WF8B_REG(LCD,0) + 1;
  LCD_WF8B(0) = LCD_WF8B(0) + 1;
  (void)LCD_WF8B_BPALCD0_MASK;
  (void)LCD_WF8B_BPALCD0_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD0_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD0_SHIFT);
  (void)LCD_WF8B_BPALCD63_MASK;
  (void)LCD_WF8B_BPALCD63_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD63_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD63_SHIFT);
  (void)LCD_WF8B_BPALCD62_MASK;
  (void)LCD_WF8B_BPALCD62_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD62_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD62_SHIFT);
  (void)LCD_WF8B_BPALCD61_MASK;
  (void)LCD_WF8B_BPALCD61_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD61_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD61_SHIFT);
  (void)LCD_WF8B_BPALCD60_MASK;
  (void)LCD_WF8B_BPALCD60_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD60_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD60_SHIFT);
  (void)LCD_WF8B_BPALCD59_MASK;
  (void)LCD_WF8B_BPALCD59_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD59_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD59_SHIFT);
  (void)LCD_WF8B_BPALCD58_MASK;
  (void)LCD_WF8B_BPALCD58_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD58_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD58_SHIFT);
  (void)LCD_WF8B_BPALCD57_MASK;
  (void)LCD_WF8B_BPALCD57_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD57_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD57_SHIFT);
  (void)LCD_WF8B_BPALCD1_MASK;
  (void)LCD_WF8B_BPALCD1_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD1_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD1_SHIFT);
  (void)LCD_WF8B_BPALCD56_MASK;
  (void)LCD_WF8B_BPALCD56_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD56_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD56_SHIFT);
  (void)LCD_WF8B_BPALCD55_MASK;
  (void)LCD_WF8B_BPALCD55_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD55_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD55_SHIFT);
  (void)LCD_WF8B_BPALCD54_MASK;
  (void)LCD_WF8B_BPALCD54_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD54_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD54_SHIFT);
  (void)LCD_WF8B_BPALCD53_MASK;
  (void)LCD_WF8B_BPALCD53_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD53_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD53_SHIFT);
  (void)LCD_WF8B_BPALCD52_MASK;
  (void)LCD_WF8B_BPALCD52_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD52_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD52_SHIFT);
  (void)LCD_WF8B_BPALCD51_MASK;
  (void)LCD_WF8B_BPALCD51_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD51_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD51_SHIFT);
  (void)LCD_WF8B_BPALCD50_MASK;
  (void)LCD_WF8B_BPALCD50_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD50_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD50_SHIFT);
  (void)LCD_WF8B_BPALCD2_MASK;
  (void)LCD_WF8B_BPALCD2_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD2_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD2_SHIFT);
  (void)LCD_WF8B_BPALCD49_MASK;
  (void)LCD_WF8B_BPALCD49_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD49_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD49_SHIFT);
  (void)LCD_WF8B_BPALCD48_MASK;
  (void)LCD_WF8B_BPALCD48_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD48_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD48_SHIFT);
  (void)LCD_WF8B_BPALCD47_MASK;
  (void)LCD_WF8B_BPALCD47_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD47_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD47_SHIFT);
  (void)LCD_WF8B_BPALCD46_MASK;
  (void)LCD_WF8B_BPALCD46_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD46_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD46_SHIFT);
  (void)LCD_WF8B_BPALCD45_MASK;
  (void)LCD_WF8B_BPALCD45_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD45_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD45_SHIFT);
  (void)LCD_WF8B_BPALCD44_MASK;
  (void)LCD_WF8B_BPALCD44_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD44_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD44_SHIFT);
  (void)LCD_WF8B_BPALCD43_MASK;
  (void)LCD_WF8B_BPALCD43_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD43_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD43_SHIFT);
  (void)LCD_WF8B_BPALCD3_MASK;
  (void)LCD_WF8B_BPALCD3_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD3_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD3_SHIFT);
  (void)LCD_WF8B_BPALCD42_MASK;
  (void)LCD_WF8B_BPALCD42_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD42_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD42_SHIFT);
  (void)LCD_WF8B_BPALCD41_MASK;
  (void)LCD_WF8B_BPALCD41_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD41_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD41_SHIFT);
  (void)LCD_WF8B_BPALCD40_MASK;
  (void)LCD_WF8B_BPALCD40_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD40_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD40_SHIFT);
  (void)LCD_WF8B_BPALCD39_MASK;
  (void)LCD_WF8B_BPALCD39_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD39_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD39_SHIFT);
  (void)LCD_WF8B_BPALCD38_MASK;
  (void)LCD_WF8B_BPALCD38_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD38_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD38_SHIFT);
  (void)LCD_WF8B_BPALCD37_MASK;
  (void)LCD_WF8B_BPALCD37_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD37_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD37_SHIFT);
  (void)LCD_WF8B_BPALCD36_MASK;
  (void)LCD_WF8B_BPALCD36_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD36_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD36_SHIFT);
  (void)LCD_WF8B_BPALCD4_MASK;
  (void)LCD_WF8B_BPALCD4_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD4_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD4_SHIFT);
  (void)LCD_WF8B_BPALCD35_MASK;
  (void)LCD_WF8B_BPALCD35_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD35_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD35_SHIFT);
  (void)LCD_WF8B_BPALCD34_MASK;
  (void)LCD_WF8B_BPALCD34_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD34_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD34_SHIFT);
  (void)LCD_WF8B_BPALCD33_MASK;
  (void)LCD_WF8B_BPALCD33_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD33_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD33_SHIFT);
  (void)LCD_WF8B_BPALCD32_MASK;
  (void)LCD_WF8B_BPALCD32_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD32_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD32_SHIFT);
  (void)LCD_WF8B_BPALCD31_MASK;
  (void)LCD_WF8B_BPALCD31_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD31_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD31_SHIFT);
  (void)LCD_WF8B_BPALCD30_MASK;
  (void)LCD_WF8B_BPALCD30_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD30_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD30_SHIFT);
  (void)LCD_WF8B_BPALCD29_MASK;
  (void)LCD_WF8B_BPALCD29_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD29_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD29_SHIFT);
  (void)LCD_WF8B_BPALCD5_MASK;
  (void)LCD_WF8B_BPALCD5_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD5_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD5_SHIFT);
  (void)LCD_WF8B_BPALCD28_MASK;
  (void)LCD_WF8B_BPALCD28_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD28_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD28_SHIFT);
  (void)LCD_WF8B_BPALCD27_MASK;
  (void)LCD_WF8B_BPALCD27_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD27_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD27_SHIFT);
  (void)LCD_WF8B_BPALCD26_MASK;
  (void)LCD_WF8B_BPALCD26_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD26_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD26_SHIFT);
  (void)LCD_WF8B_BPALCD25_MASK;
  (void)LCD_WF8B_BPALCD25_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD25_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD25_SHIFT);
  (void)LCD_WF8B_BPALCD24_MASK;
  (void)LCD_WF8B_BPALCD24_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD24_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD24_SHIFT);
  (void)LCD_WF8B_BPALCD23_MASK;
  (void)LCD_WF8B_BPALCD23_SHIFT;
