kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/CMSIS_Test_MKM33Z5_v1_3.c
void test_NV(void) {
  (void)FTFA_FlashConfig_BASE;
  (void)FTFA_FlashConfig;
  (void)NV_BACKKEY3_KEY_MASK;
  (void)NV_BACKKEY3_KEY_SHIFT;
  (void)NV_BACKKEY3_KEY(1);
  (void)NV_BACKKEY2_KEY_MASK;
  (void)NV_BACKKEY2_KEY_SHIFT;
  (void)NV_BACKKEY2_KEY(1);
  (void)NV_BACKKEY1_KEY_MASK;
  (void)NV_BACKKEY1_KEY_SHIFT;
  (void)NV_BACKKEY1_KEY(1);
  (void)NV_BACKKEY0_KEY_MASK;
  (void)NV_BACKKEY0_KEY_SHIFT;
  (void)NV_BACKKEY0_KEY(1);
  (void)NV_BACKKEY7_KEY_MASK;
  (void)NV_BACKKEY7_KEY_SHIFT;
  (void)NV_BACKKEY7_KEY(1);
  (void)NV_BACKKEY6_KEY_MASK;
  (void)NV_BACKKEY6_KEY_SHIFT;
  (void)NV_BACKKEY6_KEY(1);
  (void)NV_BACKKEY5_KEY_MASK;
  (void)NV_BACKKEY5_KEY_SHIFT;
  (void)NV_BACKKEY5_KEY(1);
  (void)NV_BACKKEY4_KEY_MASK;
  (void)NV_BACKKEY4_KEY_SHIFT;
  (void)NV_BACKKEY4_KEY(1);
  (void)NV_FPROT3_PROT_MASK;
  (void)NV_FPROT3_PROT_SHIFT;
  (void)NV_FPROT3_PROT(1);
  (void)NV_FPROT2_PROT_MASK;
  (void)NV_FPROT2_PROT_SHIFT;
  (void)NV_FPROT2_PROT(1);
  (void)NV_FPROT1_PROT_MASK;
  (void)NV_FPROT1_PROT_SHIFT;
  (void)NV_FPROT1_PROT(1);
  (void)NV_FPROT0_PROT_MASK;
  (void)NV_FPROT0_PROT_SHIFT;
  (void)NV_FPROT0_PROT(1);
  (void)NV_FSEC_SEC_MASK;
  (void)NV_FSEC_SEC_SHIFT;
  (void)NV_FSEC_SEC(1);
  (void)NV_FSEC_FSLACC_MASK;
  (void)NV_FSEC_FSLACC_SHIFT;
  (void)NV_FSEC_FSLACC(1);
  (void)NV_FSEC_MEEN_MASK;
  (void)NV_FSEC_MEEN_SHIFT;
  (void)NV_FSEC_MEEN(1);
  (void)NV_FSEC_KEYEN_MASK;
  (void)NV_FSEC_KEYEN_SHIFT;
  (void)NV_FSEC_KEYEN(1);
  (void)NV_FOPT_LPBOOT_MASK;
  (void)NV_FOPT_LPBOOT_SHIFT;
  (void)NV_FOPT_NMI_EN_MASK;
  (void)NV_FOPT_NMI_EN_SHIFT;
  (void)NV_FOPT_EXE_MODE_MASK;
  (void)NV_FOPT_EXE_MODE_SHIFT;
  (void)NV_FOPT_CLK_SRC_MASK;
  (void)NV_FOPT_CLK_SRC_SHIFT;
}

void test_OSC(void) {
  (void)OSC_BASE;
  (void)OSC;
  OSC_CR = OSC_CR + 1;
  OSC_CR_REG(OSC) = OSC_CR_REG(OSC) + 1;
  (void)OSC_CR_SC16P_MASK;
  (void)OSC_CR_SC16P_SHIFT;
  OSC_CR |= OSC_CR_SC16P_MASK;
  OSC_CR &= ~(1U << OSC_CR_SC16P_SHIFT);
  (void)OSC_CR_SC8P_MASK;
  (void)OSC_CR_SC8P_SHIFT;
  OSC_CR |= OSC_CR_SC8P_MASK;
  OSC_CR &= ~(1U << OSC_CR_SC8P_SHIFT);
  (void)OSC_CR_SC4P_MASK;
  (void)OSC_CR_SC4P_SHIFT;
  OSC_CR |= OSC_CR_SC4P_MASK;
  OSC_CR &= ~(1U << OSC_CR_SC4P_SHIFT);
  (void)OSC_CR_SC2P_MASK;
  (void)OSC_CR_SC2P_SHIFT;
  OSC_CR |= OSC_CR_SC2P_MASK;
  OSC_CR &= ~(1U << OSC_CR_SC2P_SHIFT);
  (void)OSC_CR_EREFSTEN_MASK;
  (void)OSC_CR_EREFSTEN_SHIFT;
  OSC_CR |= OSC_CR_EREFSTEN_MASK;
  OSC_CR &= ~(1U << OSC_CR_EREFSTEN_SHIFT);
  (void)OSC_CR_ERCLKEN_MASK;
  (void)OSC_CR_ERCLKEN_SHIFT;
  OSC_CR |= OSC_CR_ERCLKEN_MASK;
  OSC_CR &= ~(1U << OSC_CR_ERCLKEN_SHIFT);
}

void test_PIT(void) {
  (void)PIT0_BASE;
  (void)PIT0;
  (void)PIT1_BASE;
  (void)PIT1;
  PIT0_MCR = PIT0_MCR + 1;
  PIT0_LDVAL0 = PIT0_LDVAL0 + 1;
  PIT0_TCTRL0 = PIT0_TCTRL0 + 1;
  PIT0_TFLG0 = PIT0_TFLG0 + 1;
  PIT0_LDVAL1 = PIT0_LDVAL1 + 1;
  PIT0_TCTRL1 = PIT0_TCTRL1 + 1;
  PIT0_TFLG1 = PIT0_TFLG1 + 1;
  PIT1_MCR = PIT1_MCR + 1;
  PIT1_LDVAL0 = PIT1_LDVAL0 + 1;
  PIT1_TCTRL0 = PIT1_TCTRL0 + 1;
  PIT1_TFLG0 = PIT1_TFLG0 + 1;
  PIT1_LDVAL1 = PIT1_LDVAL1 + 1;
  PIT1_TCTRL1 = PIT1_TCTRL1 + 1;
  PIT1_TFLG1 = PIT1_TFLG1 + 1;
  PIT_MCR_REG(PIT0) = PIT_MCR_REG(PIT0) + 1;
  PIT_MCR_REG(PIT1) = PIT_MCR_REG(PIT1) + 1;
  (void)PIT_MCR_FRZ_MASK;
  (void)PIT_MCR_FRZ_SHIFT;
  PIT0_MCR |= PIT_MCR_FRZ_MASK;
  PIT0_MCR &= ~(1U << PIT_MCR_FRZ_SHIFT);
  (void)PIT_MCR_MDIS_MASK;
  (void)PIT_MCR_MDIS_SHIFT;
  PIT0_MCR |= PIT_MCR_MDIS_MASK;
  PIT0_MCR &= ~(1U << PIT_MCR_MDIS_SHIFT);
  PIT_LDVAL_REG(PIT0,0) = PIT_LDVAL_REG(PIT0,0) + 1;
  PIT0_LDVAL(0) = PIT0_LDVAL(0) + 1;
  PIT1_LDVAL(0) = PIT1_LDVAL(0) + 1;
  PIT_LDVAL_REG(PIT1,0) = PIT_LDVAL_REG(PIT1,0) + 1;
  PIT0_LDVAL(0) = PIT0_LDVAL(0) + 1;
  PIT1_LDVAL(0) = PIT1_LDVAL(0) + 1;
  (void)PIT_LDVAL_TSV_MASK;
  (void)PIT_LDVAL_TSV_SHIFT;
  (void)PIT_LDVAL_TSV(1);
  PIT0_LDVAL0 |= PIT_LDVAL_TSV_MASK;
  PIT0_LDVAL0 &= ~(1U << PIT_LDVAL_TSV_SHIFT);
  (void)PIT_CVAL_TVL_MASK;
  (void)PIT_CVAL_TVL_SHIFT;
  (void)PIT_CVAL_TVL(1);
  PIT_TCTRL_REG(PIT0,0) = PIT_TCTRL_REG(PIT0,0) + 1;
  PIT0_TCTRL(0) = PIT0_TCTRL(0) + 1;
  PIT1_TCTRL(0) = PIT1_TCTRL(0) + 1;
  PIT_TCTRL_REG(PIT1,0) = PIT_TCTRL_REG(PIT1,0) + 1;
  PIT0_TCTRL(0) = PIT0_TCTRL(0) + 1;
  PIT1_TCTRL(0) = PIT1_TCTRL(0) + 1;
  (void)PIT_TCTRL_TEN_MASK;
  (void)PIT_TCTRL_TEN_SHIFT;
  PIT1_TCTRL0 |= PIT_TCTRL_TEN_MASK;
  PIT1_TCTRL0 &= ~(1U << PIT_TCTRL_TEN_SHIFT);
  (void)PIT_TCTRL_TIE_MASK;
  (void)PIT_TCTRL_TIE_SHIFT;
  PIT1_TCTRL0 |= PIT_TCTRL_TIE_MASK;
  PIT1_TCTRL0 &= ~(1U << PIT_TCTRL_TIE_SHIFT);
  (void)PIT_TCTRL_CHN_MASK;
  (void)PIT_TCTRL_CHN_SHIFT;
  PIT1_TCTRL0 |= PIT_TCTRL_CHN_MASK;
  PIT1_TCTRL0 &= ~(1U << PIT_TCTRL_CHN_SHIFT);
  PIT_TFLG_REG(PIT0,0) = PIT_TFLG_REG(PIT0,0) + 1;
  PIT0_TFLG(0) = PIT0_TFLG(0) + 1;
  PIT1_TFLG(0) = PIT1_TFLG(0) + 1;
  PIT_TFLG_REG(PIT1,0) = PIT_TFLG_REG(PIT1,0) + 1;
  PIT0_TFLG(0) = PIT0_TFLG(0) + 1;
  PIT1_TFLG(0) = PIT1_TFLG(0) + 1;
  (void)PIT_TFLG_TIF_MASK;
  (void)PIT_TFLG_TIF_SHIFT;
  PIT1_TFLG0 |= PIT_TFLG_TIF_MASK;
  PIT1_TFLG0 &= ~(1U << PIT_TFLG_TIF_SHIFT);
}

void test_PMC(void) {
  (void)PMC_BASE;
  (void)PMC;
  PMC_LVDSC1 = PMC_LVDSC1 + 1;
  PMC_LVDSC2 = PMC_LVDSC2 + 1;
  PMC_REGSC = PMC_REGSC + 1;
  PMC_LVDSC1_REG(PMC) = PMC_LVDSC1_REG(PMC) + 1;
  (void)PMC_LVDSC1_LVDV_MASK;
  (void)PMC_LVDSC1_LVDV_SHIFT;
  (void)PMC_LVDSC1_LVDV(1);
  PMC_LVDSC1 |= PMC_LVDSC1_LVDV_MASK;
  PMC_LVDSC1 &= ~(1U << PMC_LVDSC1_LVDV_SHIFT);
  (void)PMC_LVDSC1_LVDRE_MASK;
  (void)PMC_LVDSC1_LVDRE_SHIFT;
  PMC_LVDSC1 |= PMC_LVDSC1_LVDRE_MASK;
  PMC_LVDSC1 &= ~(1U << PMC_LVDSC1_LVDRE_SHIFT);
  (void)PMC_LVDSC1_LVDIE_MASK;
  (void)PMC_LVDSC1_LVDIE_SHIFT;
  PMC_LVDSC1 |= PMC_LVDSC1_LVDIE_MASK;
  PMC_LVDSC1 &= ~(1U << PMC_LVDSC1_LVDIE_SHIFT);
  (void)PMC_LVDSC1_LVDACK_MASK;
  (void)PMC_LVDSC1_LVDACK_SHIFT;
  PMC_LVDSC1 |= PMC_LVDSC1_LVDACK_MASK;
  PMC_LVDSC1 &= ~(1U << PMC_LVDSC1_LVDACK_SHIFT);
  (void)PMC_LVDSC1_LVDF_MASK;
  (void)PMC_LVDSC1_LVDF_SHIFT;
  PMC_LVDSC1 |= PMC_LVDSC1_LVDF_MASK;
  PMC_LVDSC1 &= ~(1U << PMC_LVDSC1_LVDF_SHIFT);
  PMC_LVDSC2_REG(PMC) = PMC_LVDSC2_REG(PMC) + 1;
  (void)PMC_LVDSC2_LVWV_MASK;
  (void)PMC_LVDSC2_LVWV_SHIFT;
  (void)PMC_LVDSC2_LVWV(1);
  PMC_LVDSC2 |= PMC_LVDSC2_LVWV_MASK;
  PMC_LVDSC2 &= ~(1U << PMC_LVDSC2_LVWV_SHIFT);
  (void)PMC_LVDSC2_LVWIE_MASK;
  (void)PMC_LVDSC2_LVWIE_SHIFT;
  PMC_LVDSC2 |= PMC_LVDSC2_LVWIE_MASK;
  PMC_LVDSC2 &= ~(1U << PMC_LVDSC2_LVWIE_SHIFT);
  (void)PMC_LVDSC2_LVWACK_MASK;
  (void)PMC_LVDSC2_LVWACK_SHIFT;
  PMC_LVDSC2 |= PMC_LVDSC2_LVWACK_MASK;
  PMC_LVDSC2 &= ~(1U << PMC_LVDSC2_LVWACK_SHIFT);
  (void)PMC_LVDSC2_LVWF_MASK;
  (void)PMC_LVDSC2_LVWF_SHIFT;
  PMC_LVDSC2 |= PMC_LVDSC2_LVWF_MASK;
  PMC_LVDSC2 &= ~(1U << PMC_LVDSC2_LVWF_SHIFT);
  PMC_REGSC_REG(PMC) = PMC_REGSC_REG(PMC) + 1;
  (void)PMC_REGSC_BGBE_MASK;
  (void)PMC_REGSC_BGBE_SHIFT;
  PMC_REGSC |= PMC_REGSC_BGBE_MASK;
  PMC_REGSC &= ~(1U << PMC_REGSC_BGBE_SHIFT);
  (void)PMC_REGSC_BGBDS_MASK;
  (void)PMC_REGSC_BGBDS_SHIFT;
  PMC_REGSC |= PMC_REGSC_BGBDS_MASK;
  PMC_REGSC &= ~(1U << PMC_REGSC_BGBDS_SHIFT);
  (void)PMC_REGSC_REGONS_MASK;
  (void)PMC_REGSC_REGONS_SHIFT;
  PMC_REGSC |= PMC_REGSC_REGONS_MASK;
  PMC_REGSC &= ~(1U << PMC_REGSC_REGONS_SHIFT);
  (void)PMC_REGSC_ACKISO_MASK;
  (void)PMC_REGSC_ACKISO_SHIFT;
  PMC_REGSC |= PMC_REGSC_ACKISO_MASK;
  PMC_REGSC &= ~(1U << PMC_REGSC_ACKISO_SHIFT);
  (void)PMC_REGSC_BGEN_MASK;
  (void)PMC_REGSC_BGEN_SHIFT;
  PMC_REGSC |= PMC_REGSC_BGEN_MASK;
  PMC_REGSC &= ~(1U << PMC_REGSC_BGEN_SHIFT);
}

void test_PORT(void) {
  (void)PORTA_BASE;
  (void)PORTA;
  (void)PORTB_BASE;
  (void)PORTB;
  (void)PORTC_BASE;
  (void)PORTC;
  (void)PORTD_BASE;
  (void)PORTD;
  (void)PORTE_BASE;
  (void)PORTE;
  (void)PORTF_BASE;
  (void)PORTF;
  (void)PORTG_BASE;
  (void)PORTG;
  (void)PORTH_BASE;
  (void)PORTH;
  (void)PORTI_BASE;
  (void)PORTI;
  PORTA_PCR0 = PORTA_PCR0 + 1;
  PORTA_PCR1 = PORTA_PCR1 + 1;
  PORTA_PCR2 = PORTA_PCR2 + 1;
  PORTA_PCR3 = PORTA_PCR3 + 1;
  PORTA_PCR4 = PORTA_PCR4 + 1;
  PORTA_PCR5 = PORTA_PCR5 + 1;
  PORTA_PCR6 = PORTA_PCR6 + 1;
  PORTA_PCR7 = PORTA_PCR7 + 1;
  PORTA_GPCLR = PORTA_GPCLR + 1;
  PORTA_GPCHR = PORTA_GPCHR + 1;
  PORTA_ISFR = PORTA_ISFR + 1;
  PORTB_PCR0 = PORTB_PCR0 + 1;
  PORTB_PCR1 = PORTB_PCR1 + 1;
  PORTB_PCR2 = PORTB_PCR2 + 1;
  PORTB_PCR3 = PORTB_PCR3 + 1;
  PORTB_PCR4 = PORTB_PCR4 + 1;
  PORTB_PCR5 = PORTB_PCR5 + 1;
  PORTB_PCR6 = PORTB_PCR6 + 1;
  PORTB_PCR7 = PORTB_PCR7 + 1;
  PORTB_GPCLR = PORTB_GPCLR + 1;
  PORTB_GPCHR = PORTB_GPCHR + 1;
  PORTB_ISFR = PORTB_ISFR + 1;
  PORTC_PCR0 = PORTC_PCR0 + 1;
  PORTC_PCR1 = PORTC_PCR1 + 1;
  PORTC_PCR2 = PORTC_PCR2 + 1;
  PORTC_PCR3 = PORTC_PCR3 + 1;
  PORTC_PCR4 = PORTC_PCR4 + 1;
  PORTC_PCR5 = PORTC_PCR5 + 1;
  PORTC_PCR6 = PORTC_PCR6 + 1;
  PORTC_PCR7 = PORTC_PCR7 + 1;
  PORTC_GPCLR = PORTC_GPCLR + 1;
  PORTC_GPCHR = PORTC_GPCHR + 1;
  PORTC_ISFR = PORTC_ISFR + 1;
  PORTD_PCR0 = PORTD_PCR0 + 1;
  PORTD_PCR1 = PORTD_PCR1 + 1;
  PORTD_PCR2 = PORTD_PCR2 + 1;
  PORTD_PCR3 = PORTD_PCR3 + 1;
  PORTD_PCR4 = PORTD_PCR4 + 1;
  PORTD_PCR5 = PORTD_PCR5 + 1;
  PORTD_PCR6 = PORTD_PCR6 + 1;
  PORTD_PCR7 = PORTD_PCR7 + 1;
  PORTD_GPCLR = PORTD_GPCLR + 1;
  PORTD_GPCHR = PORTD_GPCHR + 1;
  PORTD_ISFR = PORTD_ISFR + 1;
  PORTE_PCR0 = PORTE_PCR0 + 1;
  PORTE_PCR1 = PORTE_PCR1 + 1;
  PORTE_PCR2 = PORTE_PCR2 + 1;
  PORTE_PCR3 = PORTE_PCR3 + 1;
  PORTE_PCR4 = PORTE_PCR4 + 1;
  PORTE_PCR5 = PORTE_PCR5 + 1;
  PORTE_PCR6 = PORTE_PCR6 + 1;
  PORTE_PCR7 = PORTE_PCR7 + 1;
  PORTE_GPCLR = PORTE_GPCLR + 1;
  PORTE_GPCHR = PORTE_GPCHR + 1;
  PORTE_ISFR = PORTE_ISFR + 1;
  PORTE_DFER = PORTE_DFER + 1;
  PORTE_DFCR = PORTE_DFCR + 1;
  PORTE_DFWR = PORTE_DFWR + 1;
  PORTF_PCR0 = PORTF_PCR0 + 1;
  PORTF_PCR1 = PORTF_PCR1 + 1;
  PORTF_PCR2 = PORTF_PCR2 + 1;
  PORTF_PCR3 = PORTF_PCR3 + 1;
  PORTF_PCR4 = PORTF_PCR4 + 1;
  PORTF_PCR5 = PORTF_PCR5 + 1;
  PORTF_PCR6 = PORTF_PCR6 + 1;
  PORTF_PCR7 = PORTF_PCR7 + 1;
  PORTF_GPCLR = PORTF_GPCLR + 1;
  PORTF_GPCHR = PORTF_GPCHR + 1;
  PORTF_ISFR = PORTF_ISFR + 1;
  PORTG_PCR0 = PORTG_PCR0 + 1;
  PORTG_PCR1 = PORTG_PCR1 + 1;
  PORTG_PCR2 = PORTG_PCR2 + 1;
  PORTG_PCR3 = PORTG_PCR3 + 1;
  PORTG_PCR4 = PORTG_PCR4 + 1;
  PORTG_PCR5 = PORTG_PCR5 + 1;
  PORTG_PCR6 = PORTG_PCR6 + 1;
  PORTG_PCR7 = PORTG_PCR7 + 1;
  PORTG_GPCLR = PORTG_GPCLR + 1;
  PORTG_GPCHR = PORTG_GPCHR + 1;
  PORTG_ISFR = PORTG_ISFR + 1;
  PORTH_PCR0 = PORTH_PCR0 + 1;
  PORTH_PCR1 = PORTH_PCR1 + 1;
  PORTH_PCR2 = PORTH_PCR2 + 1;
  PORTH_PCR3 = PORTH_PCR3 + 1;
  PORTH_PCR4 = PORTH_PCR4 + 1;
  PORTH_PCR5 = PORTH_PCR5 + 1;
  PORTH_PCR6 = PORTH_PCR6 + 1;
  PORTH_PCR7 = PORTH_PCR7 + 1;
  PORTH_GPCLR = PORTH_GPCLR + 1;
  PORTH_GPCHR = PORTH_GPCHR + 1;
  PORTH_ISFR = PORTH_ISFR + 1;
  PORTI_PCR0 = PORTI_PCR0 + 1;
  PORTI_PCR1 = PORTI_PCR1 + 1;
  PORTI_PCR2 = PORTI_PCR2 + 1;
  PORTI_PCR3 = PORTI_PCR3 + 1;
  PORTI_PCR4 = PORTI_PCR4 + 1;
  PORTI_PCR5 = PORTI_PCR5 + 1;
  PORTI_PCR6 = PORTI_PCR6 + 1;
  PORTI_PCR7 = PORTI_PCR7 + 1;
  PORTI_GPCLR = PORTI_GPCLR + 1;
  PORTI_GPCHR = PORTI_GPCHR + 1;
  PORTI_ISFR = PORTI_ISFR + 1;
  PORT_PCR_REG(PORTA,0) = PORT_PCR_REG(PORTA,0) + 1;
  PORTA_PCR(0) = PORTA_PCR(0) + 1;
  PORTB_PCR(0) = PORTB_PCR(0) + 1;
  PORTC_PCR(0) = PORTC_PCR(0) + 1;
  PORTD_PCR(0) = PORTD_PCR(0) + 1;
  PORTE_PCR(0) = PORTE_PCR(0) + 1;
  PORTF_PCR(0) = PORTF_PCR(0) + 1;
  PORTG_PCR(0) = PORTG_PCR(0) + 1;
  PORTH_PCR(0) = PORTH_PCR(0) + 1;
  PORTI_PCR(0) = PORTI_PCR(0) + 1;
  PORT_PCR_REG(PORTB,0) = PORT_PCR_REG(PORTB,0) + 1;
  PORTA_PCR(0) = PORTA_PCR(0) + 1;
  PORTB_PCR(0) = PORTB_PCR(0) + 1;
  PORTC_PCR(0) = PORTC_PCR(0) + 1;
  PORTD_PCR(0) = PORTD_PCR(0) + 1;
  PORTE_PCR(0) = PORTE_PCR(0) + 1;
  PORTF_PCR(0) = PORTF_PCR(0) + 1;
  PORTG_PCR(0) = PORTG_PCR(0) + 1;
  PORTH_PCR(0) = PORTH_PCR(0) + 1;
  PORTI_PCR(0) = PORTI_PCR(0) + 1;
  PORT_PCR_REG(PORTC,0) = PORT_PCR_REG(PORTC,0) + 1;
  PORTA_PCR(0) = PORTA_PCR(0) + 1;
  PORTB_PCR(0) = PORTB_PCR(0) + 1;
  PORTC_PCR(0) = PORTC_PCR(0) + 1;
  PORTD_PCR(0) = PORTD_PCR(0) + 1;
  PORTE_PCR(0) = PORTE_PCR(0) + 1;
  PORTF_PCR(0) = PORTF_PCR(0) + 1;
  PORTG_PCR(0) = PORTG_PCR(0) + 1;
  PORTH_PCR(0) = PORTH_PCR(0) + 1;
  PORTI_PCR(0) = PORTI_PCR(0) + 1;
  PORT_PCR_REG(PORTD,0) = PORT_PCR_REG(PORTD,0) + 1;
  PORTA_PCR(0) = PORTA_PCR(0) + 1;
  PORTB_PCR(0) = PORTB_PCR(0) + 1;
  PORTC_PCR(0) = PORTC_PCR(0) + 1;
  PORTD_PCR(0) = PORTD_PCR(0) + 1;
  PORTE_PCR(0) = PORTE_PCR(0) + 1;
  PORTF_PCR(0) = PORTF_PCR(0) + 1;
  PORTG_PCR(0) = PORTG_PCR(0) + 1;
  PORTH_PCR(0) = PORTH_PCR(0) + 1;
  PORTI_PCR(0) = PORTI_PCR(0) + 1;
  PORT_PCR_REG(PORTE,0) = PORT_PCR_REG(PORTE,0) + 1;
  PORTA_PCR(0) = PORTA_PCR(0) + 1;
  PORTB_PCR(0) = PORTB_PCR(0) + 1;
  PORTC_PCR(0) = PORTC_PCR(0) + 1;
  PORTD_PCR(0) = PORTD_PCR(0) + 1;
  PORTE_PCR(0) = PORTE_PCR(0) + 1;
  PORTF_PCR(0) = PORTF_PCR(0) + 1;
  PORTG_PCR(0) = PORTG_PCR(0) + 1;
  PORTH_PCR(0) = PORTH_PCR(0) + 1;
  PORTI_PCR(0) = PORTI_PCR(0) + 1;
  PORT_PCR_REG(PORTF,0) = PORT_PCR_REG(PORTF,0) + 1;
  PORTA_PCR(0) = PORTA_PCR(0) + 1;
  PORTB_PCR(0) = PORTB_PCR(0) + 1;
  PORTC_PCR(0) = PORTC_PCR(0) + 1;
  PORTD_PCR(0) = PORTD_PCR(0) + 1;
  PORTE_PCR(0) = PORTE_PCR(0) + 1;
  PORTF_PCR(0) = PORTF_PCR(0) + 1;
  PORTG_PCR(0) = PORTG_PCR(0) + 1;
  PORTH_PCR(0) = PORTH_PCR(0) + 1;
  PORTI_PCR(0) = PORTI_PCR(0) + 1;
  PORT_PCR_REG(PORTG,0) = PORT_PCR_REG(PORTG,0) + 1;
  PORTA_PCR(0) = PORTA_PCR(0) + 1;
  PORTB_PCR(0) = PORTB_PCR(0) + 1;
  PORTC_PCR(0) = PORTC_PCR(0) + 1;
  PORTD_PCR(0) = PORTD_PCR(0) + 1;
  PORTE_PCR(0) = PORTE_PCR(0) + 1;
  PORTF_PCR(0) = PORTF_PCR(0) + 1;
  PORTG_PCR(0) = PORTG_PCR(0) + 1;
  PORTH_PCR(0) = PORTH_PCR(0) + 1;
  PORTI_PCR(0) = PORTI_PCR(0) + 1;
  PORT_PCR_REG(PORTH,0) = PORT_PCR_REG(PORTH,0) + 1;
  PORTA_PCR(0) = PORTA_PCR(0) + 1;
  PORTB_PCR(0) = PORTB_PCR(0) + 1;
  PORTC_PCR(0) = PORTC_PCR(0) + 1;
  PORTD_PCR(0) = PORTD_PCR(0) + 1;
  PORTE_PCR(0) = PORTE_PCR(0) + 1;
  PORTF_PCR(0) = PORTF_PCR(0) + 1;
  PORTG_PCR(0) = PORTG_PCR(0) + 1;
  PORTH_PCR(0) = PORTH_PCR(0) + 1;
  PORTI_PCR(0) = PORTI_PCR(0) + 1;
  PORT_PCR_REG(PORTI,0) = PORT_PCR_REG(PORTI,0) + 1;
  PORTA_PCR(0) = PORTA_PCR(0) + 1;
  PORTB_PCR(0) = PORTB_PCR(0) + 1;
  PORTC_PCR(0) = PORTC_PCR(0) + 1;
  PORTD_PCR(0) = PORTD_PCR(0) + 1;
  PORTE_PCR(0) = PORTE_PCR(0) + 1;
  PORTF_PCR(0) = PORTF_PCR(0) + 1;
  PORTG_PCR(0) = PORTG_PCR(0) + 1;
  PORTH_PCR(0) = PORTH_PCR(0) + 1;
  PORTI_PCR(0) = PORTI_PCR(0) + 1;
  (void)PORT_PCR_PS_MASK;
  (void)PORT_PCR_PS_SHIFT;
  PORTA_PCR0 |= PORT_PCR_PS_MASK;
  PORTA_PCR0 &= ~(1U << PORT_PCR_PS_SHIFT);
  (void)PORT_PCR_PE_MASK;
  (void)PORT_PCR_PE_SHIFT;
  PORTA_PCR0 |= PORT_PCR_PE_MASK;
  PORTA_PCR0 &= ~(1U << PORT_PCR_PE_SHIFT);
  (void)PORT_PCR_SRE_MASK;
  (void)PORT_PCR_SRE_SHIFT;
  PORTA_PCR0 |= PORT_PCR_SRE_MASK;
  PORTA_PCR0 &= ~(1U << PORT_PCR_SRE_SHIFT);
  (void)PORT_PCR_MUX_MASK;
  (void)PORT_PCR_MUX_SHIFT;
  (void)PORT_PCR_MUX(1);
  PORTA_PCR0 |= PORT_PCR_MUX_MASK;
  PORTA_PCR0 &= ~(1U << PORT_PCR_MUX_SHIFT);
  (void)PORT_PCR_LK_MASK;
  (void)PORT_PCR_LK_SHIFT;
  PORTA_PCR0 |= PORT_PCR_LK_MASK;
  PORTA_PCR0 &= ~(1U << PORT_PCR_LK_SHIFT);
  (void)PORT_PCR_IRQC_MASK;
  (void)PORT_PCR_IRQC_SHIFT;
  (void)PORT_PCR_IRQC(1);
  PORTA_PCR0 |= PORT_PCR_IRQC_MASK;
  PORTA_PCR0 &= ~(1U << PORT_PCR_IRQC_SHIFT);
  (void)PORT_PCR_ISF_MASK;
  (void)PORT_PCR_ISF_SHIFT;
  PORTA_PCR0 |= PORT_PCR_ISF_MASK;
  PORTA_PCR0 &= ~(1U << PORT_PCR_ISF_SHIFT);
  PORT_GPCLR_REG(PORTA) = PORT_GPCLR_REG(PORTA) + 1;
  PORT_GPCLR_REG(PORTB) = PORT_GPCLR_REG(PORTB) + 1;
  PORT_GPCLR_REG(PORTC) = PORT_GPCLR_REG(PORTC) + 1;
  PORT_GPCLR_REG(PORTD) = PORT_GPCLR_REG(PORTD) + 1;
  PORT_GPCLR_REG(PORTE) = PORT_GPCLR_REG(PORTE) + 1;
  PORT_GPCLR_REG(PORTF) = PORT_GPCLR_REG(PORTF) + 1;
  PORT_GPCLR_REG(PORTG) = PORT_GPCLR_REG(PORTG) + 1;
  PORT_GPCLR_REG(PORTH) = PORT_GPCLR_REG(PORTH) + 1;
  PORT_GPCLR_REG(PORTI) = PORT_GPCLR_REG(PORTI) + 1;
  (void)PORT_GPCLR_GPWD_MASK;
  (void)PORT_GPCLR_GPWD_SHIFT;
  (void)PORT_GPCLR_GPWD(1);
  PORTA_GPCLR |= PORT_GPCLR_GPWD_MASK;
  PORTA_GPCLR &= ~(1U << PORT_GPCLR_GPWD_SHIFT);
  (void)PORT_GPCLR_GPWE_MASK;
  (void)PORT_GPCLR_GPWE_SHIFT;
  (void)PORT_GPCLR_GPWE(1);
  PORTA_GPCLR |= PORT_GPCLR_GPWE_MASK;
  PORTA_GPCLR &= ~(1U << PORT_GPCLR_GPWE_SHIFT);
  PORT_GPCHR_REG(PORTA) = PORT_GPCHR_REG(PORTA) + 1;
  PORT_GPCHR_REG(PORTB) = PORT_GPCHR_REG(PORTB) + 1;
  PORT_GPCHR_REG(PORTC) = PORT_GPCHR_REG(PORTC) + 1;
  PORT_GPCHR_REG(PORTD) = PORT_GPCHR_REG(PORTD) + 1;
  PORT_GPCHR_REG(PORTE) = PORT_GPCHR_REG(PORTE) + 1;
  PORT_GPCHR_REG(PORTF) = PORT_GPCHR_REG(PORTF) + 1;
  PORT_GPCHR_REG(PORTG) = PORT_GPCHR_REG(PORTG) + 1;
  PORT_GPCHR_REG(PORTH) = PORT_GPCHR_REG(PORTH) + 1;
  PORT_GPCHR_REG(PORTI) = PORT_GPCHR_REG(PORTI) + 1;
  (void)PORT_GPCHR_GPWD_MASK;
  (void)PORT_GPCHR_GPWD_SHIFT;
  (void)PORT_GPCHR_GPWD(1);
  PORTA_GPCHR |= PORT_GPCHR_GPWD_MASK;
  PORTA_GPCHR &= ~(1U << PORT_GPCHR_GPWD_SHIFT);
  (void)PORT_GPCHR_GPWE_MASK;
  (void)PORT_GPCHR_GPWE_SHIFT;
  (void)PORT_GPCHR_GPWE(1);
  PORTA_GPCHR |= PORT_GPCHR_GPWE_MASK;
  PORTA_GPCHR &= ~(1U << PORT_GPCHR_GPWE_SHIFT);
  PORT_ISFR_REG(PORTA) = PORT_ISFR_REG(PORTA) + 1;
  PORT_ISFR_REG(PORTB) = PORT_ISFR_REG(PORTB) + 1;
  PORT_ISFR_REG(PORTC) = PORT_ISFR_REG(PORTC) + 1;
  PORT_ISFR_REG(PORTD) = PORT_ISFR_REG(PORTD) + 1;
  PORT_ISFR_REG(PORTE) = PORT_ISFR_REG(PORTE) + 1;
  PORT_ISFR_REG(PORTF) = PORT_ISFR_REG(PORTF) + 1;
  PORT_ISFR_REG(PORTG) = PORT_ISFR_REG(PORTG) + 1;
  PORT_ISFR_REG(PORTH) = PORT_ISFR_REG(PORTH) + 1;
  PORT_ISFR_REG(PORTI) = PORT_ISFR_REG(PORTI) + 1;
  (void)PORT_ISFR_ISF_MASK;
  (void)PORT_ISFR_ISF_SHIFT;
  (void)PORT_ISFR_ISF(1);
  PORTA_ISFR |= PORT_ISFR_ISF_MASK;
  PORTA_ISFR &= ~(1U << PORT_ISFR_ISF_SHIFT);
  PORT_DFER_REG(PORTE) = PORT_DFER_REG(PORTE) + 1;
  (void)PORT_DFER_DFE_MASK;
  (void)PORT_DFER_DFE_SHIFT;
  (void)PORT_DFER_DFE(1);
  PORTE_DFER |= PORT_DFER_DFE_MASK;
  PORTE_DFER &= ~(1U << PORT_DFER_DFE_SHIFT);
  PORT_DFCR_REG(PORTE) = PORT_DFCR_REG(PORTE) + 1;
  (void)PORT_DFCR_CS_MASK;
  (void)PORT_DFCR_CS_SHIFT;
  PORTE_DFCR |= PORT_DFCR_CS_MASK;
  PORTE_DFCR &= ~(1U << PORT_DFCR_CS_SHIFT);
  PORT_DFWR_REG(PORTE) = PORT_DFWR_REG(PORTE) + 1;
  (void)PORT_DFWR_FILT_MASK;
  (void)PORT_DFWR_FILT_SHIFT;
  (void)PORT_DFWR_FILT(1);
  PORTE_DFWR |= PORT_DFWR_FILT_MASK;
  PORTE_DFWR &= ~(1U << PORT_DFWR_FILT_SHIFT);
}

