kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/CMSIS_Test_MKM33Z5_v1_3.c
void test_RCM(void) {
  (void)RCM_BASE;
  (void)RCM;
  RCM_RPFC = RCM_RPFC + 1;
  RCM_RPFW = RCM_RPFW + 1;
  (void)RCM_SRS0_WAKEUP_MASK;
  (void)RCM_SRS0_WAKEUP_SHIFT;
  (void)RCM_SRS0_LVD_MASK;
  (void)RCM_SRS0_LVD_SHIFT;
  (void)RCM_SRS0_LOC_MASK;
  (void)RCM_SRS0_LOC_SHIFT;
  (void)RCM_SRS0_LOL_MASK;
  (void)RCM_SRS0_LOL_SHIFT;
  (void)RCM_SRS0_WDOG_MASK;
  (void)RCM_SRS0_WDOG_SHIFT;
  (void)RCM_SRS0_PIN_MASK;
  (void)RCM_SRS0_PIN_SHIFT;
  (void)RCM_SRS0_POR_MASK;
  (void)RCM_SRS0_POR_SHIFT;
  (void)RCM_SRS1_LOCKUP_MASK;
  (void)RCM_SRS1_LOCKUP_SHIFT;
  (void)RCM_SRS1_SW_MASK;
  (void)RCM_SRS1_SW_SHIFT;
  (void)RCM_SRS1_MDM_AP_MASK;
  (void)RCM_SRS1_MDM_AP_SHIFT;
  (void)RCM_SRS1_SACKERR_MASK;
  (void)RCM_SRS1_SACKERR_SHIFT;
  RCM_RPFC_REG(RCM) = RCM_RPFC_REG(RCM) + 1;
  (void)RCM_RPFC_RSTFLTSRW_MASK;
  (void)RCM_RPFC_RSTFLTSRW_SHIFT;
  (void)RCM_RPFC_RSTFLTSRW(1);
  RCM_RPFC |= RCM_RPFC_RSTFLTSRW_MASK;
  RCM_RPFC &= ~(1U << RCM_RPFC_RSTFLTSRW_SHIFT);
  (void)RCM_RPFC_RSTFLTSS_MASK;
  (void)RCM_RPFC_RSTFLTSS_SHIFT;
  RCM_RPFC |= RCM_RPFC_RSTFLTSS_MASK;
  RCM_RPFC &= ~(1U << RCM_RPFC_RSTFLTSS_SHIFT);
  RCM_RPFW_REG(RCM) = RCM_RPFW_REG(RCM) + 1;
  (void)RCM_RPFW_RSTFLTSEL_MASK;
  (void)RCM_RPFW_RSTFLTSEL_SHIFT;
  (void)RCM_RPFW_RSTFLTSEL(1);
  RCM_RPFW |= RCM_RPFW_RSTFLTSEL_MASK;
  RCM_RPFW &= ~(1U << RCM_RPFW_RSTFLTSEL_SHIFT);
}

void test_RNG(void) {
  (void)RNG_BASE;
  (void)RNG;
  RNG_CR = RNG_CR + 1;
  RNG_ER = RNG_ER + 1;
  RNG_CR_REG(RNG) = RNG_CR_REG(RNG) + 1;
  (void)RNG_CR_GO_MASK;
  (void)RNG_CR_GO_SHIFT;
  RNG_CR |= RNG_CR_GO_MASK;
  RNG_CR &= ~(1U << RNG_CR_GO_SHIFT);
  (void)RNG_CR_HA_MASK;
  (void)RNG_CR_HA_SHIFT;
  RNG_CR |= RNG_CR_HA_MASK;
  RNG_CR &= ~(1U << RNG_CR_HA_SHIFT);
  (void)RNG_CR_INTM_MASK;
  (void)RNG_CR_INTM_SHIFT;
  RNG_CR |= RNG_CR_INTM_MASK;
  RNG_CR &= ~(1U << RNG_CR_INTM_SHIFT);
  (void)RNG_CR_CLRI_MASK;
  (void)RNG_CR_CLRI_SHIFT;
  RNG_CR |= RNG_CR_CLRI_MASK;
  RNG_CR &= ~(1U << RNG_CR_CLRI_SHIFT);
  (void)RNG_CR_SLP_MASK;
  (void)RNG_CR_SLP_SHIFT;
  RNG_CR |= RNG_CR_SLP_MASK;
  RNG_CR &= ~(1U << RNG_CR_SLP_SHIFT);
  (void)RNG_SR_SECV_MASK;
  (void)RNG_SR_SECV_SHIFT;
  (void)RNG_SR_LRS_MASK;
  (void)RNG_SR_LRS_SHIFT;
  (void)RNG_SR_ORU_MASK;
  (void)RNG_SR_ORU_SHIFT;
  (void)RNG_SR_ERRI_MASK;
  (void)RNG_SR_ERRI_SHIFT;
  (void)RNG_SR_SLP_MASK;
  (void)RNG_SR_SLP_SHIFT;
  (void)RNG_SR_OREG_LVL_MASK;
  (void)RNG_SR_OREG_LVL_SHIFT;
  (void)RNG_SR_OREG_LVL(1);
  (void)RNG_SR_OREG_SIZE_MASK;
  (void)RNG_SR_OREG_SIZE_SHIFT;
  (void)RNG_SR_OREG_SIZE(1);
  RNG_ER_REG(RNG) = RNG_ER_REG(RNG) + 1;
  (void)RNG_ER_EXT_ENT_MASK;
  (void)RNG_ER_EXT_ENT_SHIFT;
  (void)RNG_ER_EXT_ENT(1);
  RNG_ER |= RNG_ER_EXT_ENT_MASK;
  RNG_ER &= ~(1U << RNG_ER_EXT_ENT_SHIFT);
  (void)RNG_OR_RANDOUT_MASK;
  (void)RNG_OR_RANDOUT_SHIFT;
  (void)RNG_OR_RANDOUT(1);
}

void test_ROM(void) {
  (void)ROM_BASE;
  (void)ROM;
  (void)ROM_ENTRY_ENTRY_MASK;
  (void)ROM_ENTRY_ENTRY_SHIFT;
  (void)ROM_ENTRY_ENTRY(1);
  (void)ROM_TABLEMARK_MARK_MASK;
  (void)ROM_TABLEMARK_MARK_SHIFT;
  (void)ROM_TABLEMARK_MARK(1);
  (void)ROM_SYSACCESS_SYSACCESS_MASK;
  (void)ROM_SYSACCESS_SYSACCESS_SHIFT;
  (void)ROM_SYSACCESS_SYSACCESS(1);
  (void)ROM_PERIPHID4_PERIPHID_MASK;
  (void)ROM_PERIPHID4_PERIPHID_SHIFT;
  (void)ROM_PERIPHID4_PERIPHID(1);
  (void)ROM_PERIPHID5_PERIPHID_MASK;
  (void)ROM_PERIPHID5_PERIPHID_SHIFT;
  (void)ROM_PERIPHID5_PERIPHID(1);
  (void)ROM_PERIPHID6_PERIPHID_MASK;
  (void)ROM_PERIPHID6_PERIPHID_SHIFT;
  (void)ROM_PERIPHID6_PERIPHID(1);
  (void)ROM_PERIPHID7_PERIPHID_MASK;
  (void)ROM_PERIPHID7_PERIPHID_SHIFT;
  (void)ROM_PERIPHID7_PERIPHID(1);
  (void)ROM_PERIPHID0_PERIPHID_MASK;
  (void)ROM_PERIPHID0_PERIPHID_SHIFT;
  (void)ROM_PERIPHID0_PERIPHID(1);
  (void)ROM_PERIPHID1_PERIPHID_MASK;
  (void)ROM_PERIPHID1_PERIPHID_SHIFT;
  (void)ROM_PERIPHID1_PERIPHID(1);
  (void)ROM_PERIPHID2_PERIPHID_MASK;
  (void)ROM_PERIPHID2_PERIPHID_SHIFT;
  (void)ROM_PERIPHID2_PERIPHID(1);
  (void)ROM_PERIPHID3_PERIPHID_MASK;
  (void)ROM_PERIPHID3_PERIPHID_SHIFT;
  (void)ROM_PERIPHID3_PERIPHID(1);
  (void)ROM_COMPID_COMPID_MASK;
  (void)ROM_COMPID_COMPID_SHIFT;
  (void)ROM_COMPID_COMPID(1);
}

void test_RTC(void) {
  (void)RTC_BASE;
  (void)RTC;
  RTC_YEARMON = RTC_YEARMON + 1;
  RTC_DAYS = RTC_DAYS + 1;
  RTC_HOURMIN = RTC_HOURMIN + 1;
  RTC_SECONDS = RTC_SECONDS + 1;
  RTC_ALM_YEARMON = RTC_ALM_YEARMON + 1;
  RTC_ALM_DAYS = RTC_ALM_DAYS + 1;
  RTC_ALM_HOURMIN = RTC_ALM_HOURMIN + 1;
  RTC_ALM_SECONDS = RTC_ALM_SECONDS + 1;
  RTC_CTRL = RTC_CTRL + 1;
  RTC_STATUS = RTC_STATUS + 1;
  RTC_ISR = RTC_ISR + 1;
  RTC_IER = RTC_IER + 1;
  RTC_GP_DATA_REG = RTC_GP_DATA_REG + 1;
  RTC_DST_HOUR = RTC_DST_HOUR + 1;
  RTC_DST_MONTH = RTC_DST_MONTH + 1;
  RTC_DST_DAY = RTC_DST_DAY + 1;
  RTC_COMPEN = RTC_COMPEN + 1;
  RTC_TAMPER_DIRECTION = RTC_TAMPER_DIRECTION + 1;
  RTC_TAMPER_QSCR = RTC_TAMPER_QSCR + 1;
  RTC_TAMPER_SCR = RTC_TAMPER_SCR + 1;
  RTC_FILTER01_CFG = RTC_FILTER01_CFG + 1;
  RTC_FILTER2_CFG = RTC_FILTER2_CFG + 1;
  RTC_CTRL2 = RTC_CTRL2 + 1;
  RTC_YEARMON_REG(RTC) = RTC_YEARMON_REG(RTC) + 1;
  (void)RTC_YEARMON_MON_CNT_MASK;
  (void)RTC_YEARMON_MON_CNT_SHIFT;
  (void)RTC_YEARMON_MON_CNT(1);
  RTC_YEARMON |= RTC_YEARMON_MON_CNT_MASK;
  RTC_YEARMON &= ~(1U << RTC_YEARMON_MON_CNT_SHIFT);
  (void)RTC_YEARMON_YROFST_MASK;
  (void)RTC_YEARMON_YROFST_SHIFT;
  (void)RTC_YEARMON_YROFST(1);
  RTC_YEARMON |= RTC_YEARMON_YROFST_MASK;
  RTC_YEARMON &= ~(1U << RTC_YEARMON_YROFST_SHIFT);
  RTC_DAYS_REG(RTC) = RTC_DAYS_REG(RTC) + 1;
  (void)RTC_DAYS_DAY_CNT_MASK;
  (void)RTC_DAYS_DAY_CNT_SHIFT;
  (void)RTC_DAYS_DAY_CNT(1);
  RTC_DAYS |= RTC_DAYS_DAY_CNT_MASK;
  RTC_DAYS &= ~(1U << RTC_DAYS_DAY_CNT_SHIFT);
  (void)RTC_DAYS_DOW_MASK;
  (void)RTC_DAYS_DOW_SHIFT;
  (void)RTC_DAYS_DOW(1);
  RTC_DAYS |= RTC_DAYS_DOW_MASK;
  RTC_DAYS &= ~(1U << RTC_DAYS_DOW_SHIFT);
  RTC_HOURMIN_REG(RTC) = RTC_HOURMIN_REG(RTC) + 1;
  (void)RTC_HOURMIN_MIN_CNT_MASK;
  (void)RTC_HOURMIN_MIN_CNT_SHIFT;
  (void)RTC_HOURMIN_MIN_CNT(1);
  RTC_HOURMIN |= RTC_HOURMIN_MIN_CNT_MASK;
  RTC_HOURMIN &= ~(1U << RTC_HOURMIN_MIN_CNT_SHIFT);
  (void)RTC_HOURMIN_HOUR_CNT_MASK;
  (void)RTC_HOURMIN_HOUR_CNT_SHIFT;
  (void)RTC_HOURMIN_HOUR_CNT(1);
  RTC_HOURMIN |= RTC_HOURMIN_HOUR_CNT_MASK;
  RTC_HOURMIN &= ~(1U << RTC_HOURMIN_HOUR_CNT_SHIFT);
  RTC_SECONDS_REG(RTC) = RTC_SECONDS_REG(RTC) + 1;
  (void)RTC_SECONDS_SEC_CNT_MASK;
  (void)RTC_SECONDS_SEC_CNT_SHIFT;
  (void)RTC_SECONDS_SEC_CNT(1);
  RTC_SECONDS |= RTC_SECONDS_SEC_CNT_MASK;
  RTC_SECONDS &= ~(1U << RTC_SECONDS_SEC_CNT_SHIFT);
  RTC_ALM_YEARMON_REG(RTC) = RTC_ALM_YEARMON_REG(RTC) + 1;
  (void)RTC_ALM_YEARMON_ALM_MON_MASK;
  (void)RTC_ALM_YEARMON_ALM_MON_SHIFT;
  (void)RTC_ALM_YEARMON_ALM_MON(1);
  RTC_ALM_YEARMON |= RTC_ALM_YEARMON_ALM_MON_MASK;
  RTC_ALM_YEARMON &= ~(1U << RTC_ALM_YEARMON_ALM_MON_SHIFT);
  (void)RTC_ALM_YEARMON_ALM_YEAR_MASK;
  (void)RTC_ALM_YEARMON_ALM_YEAR_SHIFT;
  (void)RTC_ALM_YEARMON_ALM_YEAR(1);
  RTC_ALM_YEARMON |= RTC_ALM_YEARMON_ALM_YEAR_MASK;
  RTC_ALM_YEARMON &= ~(1U << RTC_ALM_YEARMON_ALM_YEAR_SHIFT);
  RTC_ALM_DAYS_REG(RTC) = RTC_ALM_DAYS_REG(RTC) + 1;
  (void)RTC_ALM_DAYS_ALM_DAY_MASK;
  (void)RTC_ALM_DAYS_ALM_DAY_SHIFT;
  (void)RTC_ALM_DAYS_ALM_DAY(1);
  RTC_ALM_DAYS |= RTC_ALM_DAYS_ALM_DAY_MASK;
  RTC_ALM_DAYS &= ~(1U << RTC_ALM_DAYS_ALM_DAY_SHIFT);
  RTC_ALM_HOURMIN_REG(RTC) = RTC_ALM_HOURMIN_REG(RTC) + 1;
  (void)RTC_ALM_HOURMIN_ALM_MIN_MASK;
  (void)RTC_ALM_HOURMIN_ALM_MIN_SHIFT;
  (void)RTC_ALM_HOURMIN_ALM_MIN(1);
  RTC_ALM_HOURMIN |= RTC_ALM_HOURMIN_ALM_MIN_MASK;
  RTC_ALM_HOURMIN &= ~(1U << RTC_ALM_HOURMIN_ALM_MIN_SHIFT);
  (void)RTC_ALM_HOURMIN_ALM_HOUR_MASK;
  (void)RTC_ALM_HOURMIN_ALM_HOUR_SHIFT;
  (void)RTC_ALM_HOURMIN_ALM_HOUR(1);
  RTC_ALM_HOURMIN |= RTC_ALM_HOURMIN_ALM_HOUR_MASK;
  RTC_ALM_HOURMIN &= ~(1U << RTC_ALM_HOURMIN_ALM_HOUR_SHIFT);
  RTC_ALM_SECONDS_REG(RTC) = RTC_ALM_SECONDS_REG(RTC) + 1;
  (void)RTC_ALM_SECONDS_ALM_SEC_MASK;
  (void)RTC_ALM_SECONDS_ALM_SEC_SHIFT;
  (void)RTC_ALM_SECONDS_ALM_SEC(1);
  RTC_ALM_SECONDS |= RTC_ALM_SECONDS_ALM_SEC_MASK;
  RTC_ALM_SECONDS &= ~(1U << RTC_ALM_SECONDS_ALM_SEC_SHIFT);
  (void)RTC_ALM_SECONDS_DEC_SEC_MASK;
  (void)RTC_ALM_SECONDS_DEC_SEC_SHIFT;
  RTC_ALM_SECONDS |= RTC_ALM_SECONDS_DEC_SEC_MASK;
  RTC_ALM_SECONDS &= ~(1U << RTC_ALM_SECONDS_DEC_SEC_SHIFT);
  (void)RTC_ALM_SECONDS_INC_SEC_MASK;
  (void)RTC_ALM_SECONDS_INC_SEC_SHIFT;
  RTC_ALM_SECONDS |= RTC_ALM_SECONDS_INC_SEC_MASK;
  RTC_ALM_SECONDS &= ~(1U << RTC_ALM_SECONDS_INC_SEC_SHIFT);
  RTC_CTRL_REG(RTC) = RTC_CTRL_REG(RTC) + 1;
  (void)RTC_CTRL_FINEEN_MASK;
  (void)RTC_CTRL_FINEEN_SHIFT;
  RTC_CTRL |= RTC_CTRL_FINEEN_MASK;
  RTC_CTRL &= ~(1U << RTC_CTRL_FINEEN_SHIFT);
  (void)RTC_CTRL_COMP_EN_MASK;
  (void)RTC_CTRL_COMP_EN_SHIFT;
  RTC_CTRL |= RTC_CTRL_COMP_EN_MASK;
  RTC_CTRL &= ~(1U << RTC_CTRL_COMP_EN_SHIFT);
  (void)RTC_CTRL_ALM_MATCH_MASK;
  (void)RTC_CTRL_ALM_MATCH_SHIFT;
  (void)RTC_CTRL_ALM_MATCH(1);
  RTC_CTRL |= RTC_CTRL_ALM_MATCH_MASK;
  RTC_CTRL &= ~(1U << RTC_CTRL_ALM_MATCH_SHIFT);
  (void)RTC_CTRL_TIMER_STB_MASK_MASK;
  (void)RTC_CTRL_TIMER_STB_MASK_SHIFT;
  RTC_CTRL |= RTC_CTRL_TIMER_STB_MASK_MASK;
  RTC_CTRL &= ~(1U << RTC_CTRL_TIMER_STB_MASK_SHIFT);
  (void)RTC_CTRL_DST_EN_MASK;
  (void)RTC_CTRL_DST_EN_SHIFT;
  RTC_CTRL |= RTC_CTRL_DST_EN_MASK;
  RTC_CTRL &= ~(1U << RTC_CTRL_DST_EN_SHIFT);
  (void)RTC_CTRL_SWR_MASK;
  (void)RTC_CTRL_SWR_SHIFT;
  RTC_CTRL |= RTC_CTRL_SWR_MASK;
  RTC_CTRL &= ~(1U << RTC_CTRL_SWR_SHIFT);
  (void)RTC_CTRL_CLKOUT_MASK;
  (void)RTC_CTRL_CLKOUT_SHIFT;
  (void)RTC_CTRL_CLKOUT(1);
  RTC_CTRL |= RTC_CTRL_CLKOUT_MASK;
  RTC_CTRL &= ~(1U << RTC_CTRL_CLKOUT_SHIFT);
  RTC_STATUS_REG(RTC) = RTC_STATUS_REG(RTC) + 1;
  (void)RTC_STATUS_INVAL_BIT_MASK;
  (void)RTC_STATUS_INVAL_BIT_SHIFT;
  RTC_STATUS |= RTC_STATUS_INVAL_BIT_MASK;
  RTC_STATUS &= ~(1U << RTC_STATUS_INVAL_BIT_SHIFT);
  (void)RTC_STATUS_WRITE_PROT_EN_MASK;
  (void)RTC_STATUS_WRITE_PROT_EN_SHIFT;
  RTC_STATUS |= RTC_STATUS_WRITE_PROT_EN_MASK;
  RTC_STATUS &= ~(1U << RTC_STATUS_WRITE_PROT_EN_SHIFT);
  (void)RTC_STATUS_CPU_LOW_VOLT_MASK;
  (void)RTC_STATUS_CPU_LOW_VOLT_SHIFT;
  RTC_STATUS |= RTC_STATUS_CPU_LOW_VOLT_MASK;
  RTC_STATUS &= ~(1U << RTC_STATUS_CPU_LOW_VOLT_SHIFT);
  (void)RTC_STATUS_RST_SRC_MASK;
  (void)RTC_STATUS_RST_SRC_SHIFT;
  RTC_STATUS |= RTC_STATUS_RST_SRC_MASK;
  RTC_STATUS &= ~(1U << RTC_STATUS_RST_SRC_SHIFT);
  (void)RTC_STATUS_CMP_INT_MASK;
  (void)RTC_STATUS_CMP_INT_SHIFT;
  RTC_STATUS |= RTC_STATUS_CMP_INT_MASK;
  RTC_STATUS &= ~(1U << RTC_STATUS_CMP_INT_SHIFT);
  (void)RTC_STATUS_WE_MASK;
  (void)RTC_STATUS_WE_SHIFT;
  (void)RTC_STATUS_WE(1);
  RTC_STATUS |= RTC_STATUS_WE_MASK;
  RTC_STATUS &= ~(1U << RTC_STATUS_WE_SHIFT);
  (void)RTC_STATUS_BUS_ERR_MASK;
  (void)RTC_STATUS_BUS_ERR_SHIFT;
  RTC_STATUS |= RTC_STATUS_BUS_ERR_MASK;
  RTC_STATUS &= ~(1U << RTC_STATUS_BUS_ERR_SHIFT);
  (void)RTC_STATUS_CMP_DONE_MASK;
  (void)RTC_STATUS_CMP_DONE_SHIFT;
  RTC_STATUS |= RTC_STATUS_CMP_DONE_MASK;
  RTC_STATUS &= ~(1U << RTC_STATUS_CMP_DONE_SHIFT);
  RTC_ISR_REG(RTC) = RTC_ISR_REG(RTC) + 1;
  (void)RTC_ISR_TAMPER_IS_MASK;
  (void)RTC_ISR_TAMPER_IS_SHIFT;
  RTC_ISR |= RTC_ISR_TAMPER_IS_MASK;
  RTC_ISR &= ~(1U << RTC_ISR_TAMPER_IS_SHIFT);
  (void)RTC_ISR_ALM_IS_MASK;
  (void)RTC_ISR_ALM_IS_SHIFT;
  RTC_ISR |= RTC_ISR_ALM_IS_MASK;
  RTC_ISR &= ~(1U << RTC_ISR_ALM_IS_SHIFT);
  (void)RTC_ISR_DAY_IS_MASK;
  (void)RTC_ISR_DAY_IS_SHIFT;
  RTC_ISR |= RTC_ISR_DAY_IS_MASK;
  RTC_ISR &= ~(1U << RTC_ISR_DAY_IS_SHIFT);
  (void)RTC_ISR_HOUR_IS_MASK;
  (void)RTC_ISR_HOUR_IS_SHIFT;
  RTC_ISR |= RTC_ISR_HOUR_IS_MASK;
  RTC_ISR &= ~(1U << RTC_ISR_HOUR_IS_SHIFT);
  (void)RTC_ISR_MIN_IS_MASK;
  (void)RTC_ISR_MIN_IS_SHIFT;
  RTC_ISR |= RTC_ISR_MIN_IS_MASK;
  RTC_ISR &= ~(1U << RTC_ISR_MIN_IS_SHIFT);
  (void)RTC_ISR_IS_1HZ_MASK;
  (void)RTC_ISR_IS_1HZ_SHIFT;
  RTC_ISR |= RTC_ISR_IS_1HZ_MASK;
  RTC_ISR &= ~(1U << RTC_ISR_IS_1HZ_SHIFT);
  (void)RTC_ISR_IS_2HZ_MASK;
  (void)RTC_ISR_IS_2HZ_SHIFT;
  RTC_ISR |= RTC_ISR_IS_2HZ_MASK;
  RTC_ISR &= ~(1U << RTC_ISR_IS_2HZ_SHIFT);
  (void)RTC_ISR_IS_4HZ_MASK;
  (void)RTC_ISR_IS_4HZ_SHIFT;
  RTC_ISR |= RTC_ISR_IS_4HZ_MASK;
  RTC_ISR &= ~(1U << RTC_ISR_IS_4HZ_SHIFT);
  (void)RTC_ISR_IS_8HZ_MASK;
  (void)RTC_ISR_IS_8HZ_SHIFT;
  RTC_ISR |= RTC_ISR_IS_8HZ_MASK;
  RTC_ISR &= ~(1U << RTC_ISR_IS_8HZ_SHIFT);
  (void)RTC_ISR_IS_16HZ_MASK;
  (void)RTC_ISR_IS_16HZ_SHIFT;
  RTC_ISR |= RTC_ISR_IS_16HZ_MASK;
  RTC_ISR &= ~(1U << RTC_ISR_IS_16HZ_SHIFT);
  (void)RTC_ISR_IS_32HZ_MASK;
  (void)RTC_ISR_IS_32HZ_SHIFT;
  RTC_ISR |= RTC_ISR_IS_32HZ_MASK;
  RTC_ISR &= ~(1U << RTC_ISR_IS_32HZ_SHIFT);
  (void)RTC_ISR_IS_64HZ_MASK;
  (void)RTC_ISR_IS_64HZ_SHIFT;
  RTC_ISR |= RTC_ISR_IS_64HZ_MASK;
  RTC_ISR &= ~(1U << RTC_ISR_IS_64HZ_SHIFT);
  (void)RTC_ISR_IS_128HZ_MASK;
  (void)RTC_ISR_IS_128HZ_SHIFT;
  RTC_ISR |= RTC_ISR_IS_128HZ_MASK;
  RTC_ISR &= ~(1U << RTC_ISR_IS_128HZ_SHIFT);
  (void)RTC_ISR_IS_256HZ_MASK;
  (void)RTC_ISR_IS_256HZ_SHIFT;
  RTC_ISR |= RTC_ISR_IS_256HZ_MASK;
  RTC_ISR &= ~(1U << RTC_ISR_IS_256HZ_SHIFT);
  (void)RTC_ISR_IS_512HZ_MASK;
  (void)RTC_ISR_IS_512HZ_SHIFT;
  RTC_ISR |= RTC_ISR_IS_512HZ_MASK;
  RTC_ISR &= ~(1U << RTC_ISR_IS_512HZ_SHIFT);
  RTC_IER_REG(RTC) = RTC_IER_REG(RTC) + 1;
  (void)RTC_IER_TAMPER_IE_MASK;
  (void)RTC_IER_TAMPER_IE_SHIFT;
  RTC_IER |= RTC_IER_TAMPER_IE_MASK;
  RTC_IER &= ~(1U << RTC_IER_TAMPER_IE_SHIFT);
  (void)RTC_IER_ALM_IE_MASK;
  (void)RTC_IER_ALM_IE_SHIFT;
  RTC_IER |= RTC_IER_ALM_IE_MASK;
  RTC_IER &= ~(1U << RTC_IER_ALM_IE_SHIFT);
  (void)RTC_IER_DAY_IE_MASK;
  (void)RTC_IER_DAY_IE_SHIFT;
  RTC_IER |= RTC_IER_DAY_IE_MASK;
  RTC_IER &= ~(1U << RTC_IER_DAY_IE_SHIFT);
  (void)RTC_IER_HOUR_IE_MASK;
  (void)RTC_IER_HOUR_IE_SHIFT;
  RTC_IER |= RTC_IER_HOUR_IE_MASK;
  RTC_IER &= ~(1U << RTC_IER_HOUR_IE_SHIFT);
  (void)RTC_IER_MIN_IE_MASK;
  (void)RTC_IER_MIN_IE_SHIFT;
  RTC_IER |= RTC_IER_MIN_IE_MASK;
  RTC_IER &= ~(1U << RTC_IER_MIN_IE_SHIFT);
  (void)RTC_IER_IE_1HZ_MASK;
  (void)RTC_IER_IE_1HZ_SHIFT;
  RTC_IER |= RTC_IER_IE_1HZ_MASK;
  RTC_IER &= ~(1U << RTC_IER_IE_1HZ_SHIFT);
  (void)RTC_IER_IE_2HZ_MASK;
  (void)RTC_IER_IE_2HZ_SHIFT;
  RTC_IER |= RTC_IER_IE_2HZ_MASK;
  RTC_IER &= ~(1U << RTC_IER_IE_2HZ_SHIFT);
  (void)RTC_IER_IE_4HZ_MASK;
  (void)RTC_IER_IE_4HZ_SHIFT;
  RTC_IER |= RTC_IER_IE_4HZ_MASK;
  RTC_IER &= ~(1U << RTC_IER_IE_4HZ_SHIFT);
  (void)RTC_IER_IE_8HZ_MASK;
  (void)RTC_IER_IE_8HZ_SHIFT;
  RTC_IER |= RTC_IER_IE_8HZ_MASK;
  RTC_IER &= ~(1U << RTC_IER_IE_8HZ_SHIFT);
  (void)RTC_IER_IE_16HZ_MASK;
  (void)RTC_IER_IE_16HZ_SHIFT;
  RTC_IER |= RTC_IER_IE_16HZ_MASK;
  RTC_IER &= ~(1U << RTC_IER_IE_16HZ_SHIFT);
  (void)RTC_IER_IE_32HZ_MASK;
  (void)RTC_IER_IE_32HZ_SHIFT;
  RTC_IER |= RTC_IER_IE_32HZ_MASK;
  RTC_IER &= ~(1U << RTC_IER_IE_32HZ_SHIFT);
  (void)RTC_IER_IE_64HZ_MASK;
  (void)RTC_IER_IE_64HZ_SHIFT;
  RTC_IER |= RTC_IER_IE_64HZ_MASK;
  RTC_IER &= ~(1U << RTC_IER_IE_64HZ_SHIFT);
  (void)RTC_IER_IE_128HZ_MASK;
  (void)RTC_IER_IE_128HZ_SHIFT;
  RTC_IER |= RTC_IER_IE_128HZ_MASK;
  RTC_IER &= ~(1U << RTC_IER_IE_128HZ_SHIFT);
  (void)RTC_IER_IE_256HZ_MASK;
  (void)RTC_IER_IE_256HZ_SHIFT;
  RTC_IER |= RTC_IER_IE_256HZ_MASK;
  RTC_IER &= ~(1U << RTC_IER_IE_256HZ_SHIFT);
  (void)RTC_IER_IE_512HZ_MASK;
  (void)RTC_IER_IE_512HZ_SHIFT;
  RTC_IER |= RTC_IER_IE_512HZ_MASK;
  RTC_IER &= ~(1U << RTC_IER_IE_512HZ_SHIFT);
  RTC_GP_DATA_REG_REG(RTC) = RTC_GP_DATA_REG_REG(RTC) + 1;
  (void)RTC_GP_DATA_REG_GP_DATA_REG_MASK;
  (void)RTC_GP_DATA_REG_GP_DATA_REG_SHIFT;
  (void)RTC_GP_DATA_REG_GP_DATA_REG(1);
  RTC_GP_DATA_REG |= RTC_GP_DATA_REG_GP_DATA_REG_MASK;
  RTC_GP_DATA_REG &= ~(1U << RTC_GP_DATA_REG_GP_DATA_REG_SHIFT);
  RTC_DST_HOUR_REG(RTC) = RTC_DST_HOUR_REG(RTC) + 1;
  (void)RTC_DST_HOUR_DST_END_HOUR_MASK;
  (void)RTC_DST_HOUR_DST_END_HOUR_SHIFT;
  (void)RTC_DST_HOUR_DST_END_HOUR(1);
  RTC_DST_HOUR |= RTC_DST_HOUR_DST_END_HOUR_MASK;
  RTC_DST_HOUR &= ~(1U << RTC_DST_HOUR_DST_END_HOUR_SHIFT);
  (void)RTC_DST_HOUR_DST_START_HOUR_MASK;
  (void)RTC_DST_HOUR_DST_START_HOUR_SHIFT;
  (void)RTC_DST_HOUR_DST_START_HOUR(1);
  RTC_DST_HOUR |= RTC_DST_HOUR_DST_START_HOUR_MASK;
  RTC_DST_HOUR &= ~(1U << RTC_DST_HOUR_DST_START_HOUR_SHIFT);
  RTC_DST_MONTH_REG(RTC) = RTC_DST_MONTH_REG(RTC) + 1;
  (void)RTC_DST_MONTH_DST_END_MONTH_MASK;
  (void)RTC_DST_MONTH_DST_END_MONTH_SHIFT;
  (void)RTC_DST_MONTH_DST_END_MONTH(1);
  RTC_DST_MONTH |= RTC_DST_MONTH_DST_END_MONTH_MASK;
  RTC_DST_MONTH &= ~(1U << RTC_DST_MONTH_DST_END_MONTH_SHIFT);
  (void)RTC_DST_MONTH_DST_START_MONTH_MASK;
  (void)RTC_DST_MONTH_DST_START_MONTH_SHIFT;
  (void)RTC_DST_MONTH_DST_START_MONTH(1);
  RTC_DST_MONTH |= RTC_DST_MONTH_DST_START_MONTH_MASK;
  RTC_DST_MONTH &= ~(1U << RTC_DST_MONTH_DST_START_MONTH_SHIFT);
  RTC_DST_DAY_REG(RTC) = RTC_DST_DAY_REG(RTC) + 1;
  (void)RTC_DST_DAY_DST_END_DAY_MASK;
  (void)RTC_DST_DAY_DST_END_DAY_SHIFT;
  (void)RTC_DST_DAY_DST_END_DAY(1);
  RTC_DST_DAY |= RTC_DST_DAY_DST_END_DAY_MASK;
  RTC_DST_DAY &= ~(1U << RTC_DST_DAY_DST_END_DAY_SHIFT);
  (void)RTC_DST_DAY_DST_START_DAY_MASK;
  (void)RTC_DST_DAY_DST_START_DAY_SHIFT;
  (void)RTC_DST_DAY_DST_START_DAY(1);
  RTC_DST_DAY |= RTC_DST_DAY_DST_START_DAY_MASK;
  RTC_DST_DAY &= ~(1U << RTC_DST_DAY_DST_START_DAY_SHIFT);
  RTC_COMPEN_REG(RTC) = RTC_COMPEN_REG(RTC) + 1;
  (void)RTC_COMPEN_COMPEN_VAL_MASK;
  (void)RTC_COMPEN_COMPEN_VAL_SHIFT;
  (void)RTC_COMPEN_COMPEN_VAL(1);
  RTC_COMPEN |= RTC_COMPEN_COMPEN_VAL_MASK;
  RTC_COMPEN &= ~(1U << RTC_COMPEN_COMPEN_VAL_SHIFT);
  RTC_TAMPER_DIRECTION_REG(RTC) = RTC_TAMPER_DIRECTION_REG(RTC) + 1;
  (void)RTC_TAMPER_DIRECTION_A_P_TAMP_MASK;
  (void)RTC_TAMPER_DIRECTION_A_P_TAMP_SHIFT;
  (void)RTC_TAMPER_DIRECTION_A_P_TAMP(1);
  RTC_TAMPER_DIRECTION |= RTC_TAMPER_DIRECTION_A_P_TAMP_MASK;
  RTC_TAMPER_DIRECTION &= ~(1U << RTC_TAMPER_DIRECTION_A_P_TAMP_SHIFT);
  (void)RTC_TAMPER_DIRECTION_I_O_TAMP_MASK;
  (void)RTC_TAMPER_DIRECTION_I_O_TAMP_SHIFT;
  (void)RTC_TAMPER_DIRECTION_I_O_TAMP(1);
  RTC_TAMPER_DIRECTION |= RTC_TAMPER_DIRECTION_I_O_TAMP_MASK;
  RTC_TAMPER_DIRECTION &= ~(1U << RTC_TAMPER_DIRECTION_I_O_TAMP_SHIFT);
  RTC_TAMPER_QSCR_REG(RTC) = RTC_TAMPER_QSCR_REG(RTC) + 1;
  (void)RTC_TAMPER_QSCR_Q_FULL_MASK;
  (void)RTC_TAMPER_QSCR_Q_FULL_SHIFT;
  RTC_TAMPER_QSCR |= RTC_TAMPER_QSCR_Q_FULL_MASK;
  RTC_TAMPER_QSCR &= ~(1U << RTC_TAMPER_QSCR_Q_FULL_SHIFT);
  (void)RTC_TAMPER_QSCR_Q_FULL_INT_EN_MASK;
  (void)RTC_TAMPER_QSCR_Q_FULL_INT_EN_SHIFT;
  RTC_TAMPER_QSCR |= RTC_TAMPER_QSCR_Q_FULL_INT_EN_MASK;
  RTC_TAMPER_QSCR &= ~(1U << RTC_TAMPER_QSCR_Q_FULL_INT_EN_SHIFT);
  (void)RTC_TAMPER_QSCR_Q_CLEAR_MASK;
  (void)RTC_TAMPER_QSCR_Q_CLEAR_SHIFT;
  RTC_TAMPER_QSCR |= RTC_TAMPER_QSCR_Q_CLEAR_MASK;
  RTC_TAMPER_QSCR &= ~(1U << RTC_TAMPER_QSCR_Q_CLEAR_SHIFT);
  (void)RTC_TAMPER_QSCR_LFSR_CLK_SEL_MASK;
  (void)RTC_TAMPER_QSCR_LFSR_CLK_SEL_SHIFT;
  (void)RTC_TAMPER_QSCR_LFSR_CLK_SEL(1);
  RTC_TAMPER_QSCR |= RTC_TAMPER_QSCR_LFSR_CLK_SEL_MASK;
  RTC_TAMPER_QSCR &= ~(1U << RTC_TAMPER_QSCR_LFSR_CLK_SEL_SHIFT);
  (void)RTC_TAMPER_QSCR_LFSR_DURATION_MASK;
  (void)RTC_TAMPER_QSCR_LFSR_DURATION_SHIFT;
  (void)RTC_TAMPER_QSCR_LFSR_DURATION(1);
  RTC_TAMPER_QSCR |= RTC_TAMPER_QSCR_LFSR_DURATION_MASK;
  RTC_TAMPER_QSCR &= ~(1U << RTC_TAMPER_QSCR_LFSR_DURATION_SHIFT);
  RTC_TAMPER_SCR_REG(RTC) = RTC_TAMPER_SCR_REG(RTC) + 1;
  (void)RTC_TAMPER_SCR_TMPR_EN_MASK;
  (void)RTC_TAMPER_SCR_TMPR_EN_SHIFT;
  (void)RTC_TAMPER_SCR_TMPR_EN(1);
  RTC_TAMPER_SCR |= RTC_TAMPER_SCR_TMPR_EN_MASK;
  RTC_TAMPER_SCR &= ~(1U << RTC_TAMPER_SCR_TMPR_EN_SHIFT);
  (void)RTC_TAMPER_SCR_TMPR_STS_MASK;
  (void)RTC_TAMPER_SCR_TMPR_STS_SHIFT;
  (void)RTC_TAMPER_SCR_TMPR_STS(1);
  RTC_TAMPER_SCR |= RTC_TAMPER_SCR_TMPR_STS_MASK;
  RTC_TAMPER_SCR &= ~(1U << RTC_TAMPER_SCR_TMPR_STS_SHIFT);
  RTC_FILTER01_CFG_REG(RTC) = RTC_FILTER01_CFG_REG(RTC) + 1;
  (void)RTC_FILTER01_CFG_FIL_DUR1_MASK;
  (void)RTC_FILTER01_CFG_FIL_DUR1_SHIFT;
  (void)RTC_FILTER01_CFG_FIL_DUR1(1);
  RTC_FILTER01_CFG |= RTC_FILTER01_CFG_FIL_DUR1_MASK;
  RTC_FILTER01_CFG &= ~(1U << RTC_FILTER01_CFG_FIL_DUR1_SHIFT);
  (void)RTC_FILTER01_CFG_CLK_SEL1_MASK;
  (void)RTC_FILTER01_CFG_CLK_SEL1_SHIFT;
  (void)RTC_FILTER01_CFG_CLK_SEL1(1);
  RTC_FILTER01_CFG |= RTC_FILTER01_CFG_CLK_SEL1_MASK;
  RTC_FILTER01_CFG &= ~(1U << RTC_FILTER01_CFG_CLK_SEL1_SHIFT);
  (void)RTC_FILTER01_CFG_POL1_MASK;
  (void)RTC_FILTER01_CFG_POL1_SHIFT;
  RTC_FILTER01_CFG |= RTC_FILTER01_CFG_POL1_MASK;
  RTC_FILTER01_CFG &= ~(1U << RTC_FILTER01_CFG_POL1_SHIFT);
  (void)RTC_FILTER01_CFG_FIL_DUR0_MASK;
  (void)RTC_FILTER01_CFG_FIL_DUR0_SHIFT;
  (void)RTC_FILTER01_CFG_FIL_DUR0(1);
  RTC_FILTER01_CFG |= RTC_FILTER01_CFG_FIL_DUR0_MASK;
  RTC_FILTER01_CFG &= ~(1U << RTC_FILTER01_CFG_FIL_DUR0_SHIFT);
  (void)RTC_FILTER01_CFG_CLK_SEL0_MASK;
  (void)RTC_FILTER01_CFG_CLK_SEL0_SHIFT;
  (void)RTC_FILTER01_CFG_CLK_SEL0(1);
  RTC_FILTER01_CFG |= RTC_FILTER01_CFG_CLK_SEL0_MASK;
  RTC_FILTER01_CFG &= ~(1U << RTC_FILTER01_CFG_CLK_SEL0_SHIFT);
  (void)RTC_FILTER01_CFG_POL0_MASK;
  (void)RTC_FILTER01_CFG_POL0_SHIFT;
  RTC_FILTER01_CFG |= RTC_FILTER01_CFG_POL0_MASK;
  RTC_FILTER01_CFG &= ~(1U << RTC_FILTER01_CFG_POL0_SHIFT);
  RTC_FILTER2_CFG_REG(RTC) = RTC_FILTER2_CFG_REG(RTC) + 1;
  (void)RTC_FILTER2_CFG_FIL_DUR2_MASK;
  (void)RTC_FILTER2_CFG_FIL_DUR2_SHIFT;
  (void)RTC_FILTER2_CFG_FIL_DUR2(1);
  RTC_FILTER2_CFG |= RTC_FILTER2_CFG_FIL_DUR2_MASK;
  RTC_FILTER2_CFG &= ~(1U << RTC_FILTER2_CFG_FIL_DUR2_SHIFT);
  (void)RTC_FILTER2_CFG_CLK_SEL2_MASK;
  (void)RTC_FILTER2_CFG_CLK_SEL2_SHIFT;
  (void)RTC_FILTER2_CFG_CLK_SEL2(1);
  RTC_FILTER2_CFG |= RTC_FILTER2_CFG_CLK_SEL2_MASK;
  RTC_FILTER2_CFG &= ~(1U << RTC_FILTER2_CFG_CLK_SEL2_SHIFT);
  (void)RTC_FILTER2_CFG_POL2_MASK;
  (void)RTC_FILTER2_CFG_POL2_SHIFT;
  RTC_FILTER2_CFG |= RTC_FILTER2_CFG_POL2_MASK;
  RTC_FILTER2_CFG &= ~(1U << RTC_FILTER2_CFG_POL2_SHIFT);
  (void)RTC_TAMPER_QUEUE_TAMPER_DATA_MASK;
  (void)RTC_TAMPER_QUEUE_TAMPER_DATA_SHIFT;
  (void)RTC_TAMPER_QUEUE_TAMPER_DATA(1);
  RTC_CTRL2_REG(RTC) = RTC_CTRL2_REG(RTC) + 1;
  (void)RTC_CTRL2_TAMP_CFG_OVER_MASK;
  (void)RTC_CTRL2_TAMP_CFG_OVER_SHIFT;
  RTC_CTRL2 |= RTC_CTRL2_TAMP_CFG_OVER_MASK;
  RTC_CTRL2 &= ~(1U << RTC_CTRL2_TAMP_CFG_OVER_SHIFT);
  (void)RTC_CTRL2_WAKEUP_STATUS_MASK;
  (void)RTC_CTRL2_WAKEUP_STATUS_SHIFT;
  (void)RTC_CTRL2_WAKEUP_STATUS(1);
  RTC_CTRL2 |= RTC_CTRL2_WAKEUP_STATUS_MASK;
  RTC_CTRL2 &= ~(1U << RTC_CTRL2_WAKEUP_STATUS_SHIFT);
  (void)RTC_CTRL2_WAKEUP_MODE_MASK;
  (void)RTC_CTRL2_WAKEUP_MODE_SHIFT;
  RTC_CTRL2 |= RTC_CTRL2_WAKEUP_MODE_MASK;
  RTC_CTRL2 &= ~(1U << RTC_CTRL2_WAKEUP_MODE_SHIFT);
}

