kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/CMSIS_Test_MKM33Z5_v1_3.c
void test_TMR(void) {
  (void)TMR0_BASE;
  (void)TMR0;
  (void)TMR1_BASE;
  (void)TMR1;
  (void)TMR2_BASE;
  (void)TMR2;
  (void)TMR3_BASE;
  (void)TMR3;
  TMR0_COMP1 = TMR0_COMP1 + 1;
  TMR0_COMP2 = TMR0_COMP2 + 1;
  TMR0_CAPT = TMR0_CAPT + 1;
  TMR0_LOAD = TMR0_LOAD + 1;
  TMR0_HOLD = TMR0_HOLD + 1;
  TMR0_CNTR = TMR0_CNTR + 1;
  TMR0_CTRL = TMR0_CTRL + 1;
  TMR0_SCTRL = TMR0_SCTRL + 1;
  TMR0_CMPLD1 = TMR0_CMPLD1 + 1;
  TMR0_CMPLD2 = TMR0_CMPLD2 + 1;
  TMR0_CSCTRL = TMR0_CSCTRL + 1;
  TMR0_FILT = TMR0_FILT + 1;
  TMR0_ENBL = TMR0_ENBL + 1;
  TMR1_COMP1 = TMR1_COMP1 + 1;
  TMR1_COMP2 = TMR1_COMP2 + 1;
  TMR1_CAPT = TMR1_CAPT + 1;
  TMR1_LOAD = TMR1_LOAD + 1;
  TMR1_HOLD = TMR1_HOLD + 1;
  TMR1_CNTR = TMR1_CNTR + 1;
  TMR1_CTRL = TMR1_CTRL + 1;
  TMR1_SCTRL = TMR1_SCTRL + 1;
  TMR1_CMPLD1 = TMR1_CMPLD1 + 1;
  TMR1_CMPLD2 = TMR1_CMPLD2 + 1;
  TMR1_CSCTRL = TMR1_CSCTRL + 1;
  TMR1_FILT = TMR1_FILT + 1;
  TMR2_COMP1 = TMR2_COMP1 + 1;
  TMR2_COMP2 = TMR2_COMP2 + 1;
  TMR2_CAPT = TMR2_CAPT + 1;
  TMR2_LOAD = TMR2_LOAD + 1;
  TMR2_HOLD = TMR2_HOLD + 1;
  TMR2_CNTR = TMR2_CNTR + 1;
  TMR2_CTRL = TMR2_CTRL + 1;
  TMR2_SCTRL = TMR2_SCTRL + 1;
  TMR2_CMPLD1 = TMR2_CMPLD1 + 1;
  TMR2_CMPLD2 = TMR2_CMPLD2 + 1;
  TMR2_CSCTRL = TMR2_CSCTRL + 1;
  TMR2_FILT = TMR2_FILT + 1;
  TMR3_COMP1 = TMR3_COMP1 + 1;
  TMR3_COMP2 = TMR3_COMP2 + 1;
  TMR3_CAPT = TMR3_CAPT + 1;
  TMR3_LOAD = TMR3_LOAD + 1;
  TMR3_HOLD = TMR3_HOLD + 1;
  TMR3_CNTR = TMR3_CNTR + 1;
  TMR3_CTRL = TMR3_CTRL + 1;
  TMR3_SCTRL = TMR3_SCTRL + 1;
  TMR3_CMPLD1 = TMR3_CMPLD1 + 1;
  TMR3_CMPLD2 = TMR3_CMPLD2 + 1;
  TMR3_CSCTRL = TMR3_CSCTRL + 1;
  TMR3_FILT = TMR3_FILT + 1;
  TMR_COMP1_REG(TMR0) = TMR_COMP1_REG(TMR0) + 1;
  TMR_COMP1_REG(TMR1) = TMR_COMP1_REG(TMR1) + 1;
  TMR_COMP1_REG(TMR2) = TMR_COMP1_REG(TMR2) + 1;
  TMR_COMP1_REG(TMR3) = TMR_COMP1_REG(TMR3) + 1;
  (void)TMR_COMP1_COMPARISON_1_MASK;
  (void)TMR_COMP1_COMPARISON_1_SHIFT;
  (void)TMR_COMP1_COMPARISON_1(1);
  TMR0_COMP1 |= TMR_COMP1_COMPARISON_1_MASK;
  TMR0_COMP1 &= ~(1U << TMR_COMP1_COMPARISON_1_SHIFT);
  TMR_COMP2_REG(TMR0) = TMR_COMP2_REG(TMR0) + 1;
  TMR_COMP2_REG(TMR1) = TMR_COMP2_REG(TMR1) + 1;
  TMR_COMP2_REG(TMR2) = TMR_COMP2_REG(TMR2) + 1;
  TMR_COMP2_REG(TMR3) = TMR_COMP2_REG(TMR3) + 1;
  (void)TMR_COMP2_COMPARISON_2_MASK;
  (void)TMR_COMP2_COMPARISON_2_SHIFT;
  (void)TMR_COMP2_COMPARISON_2(1);
  TMR0_COMP2 |= TMR_COMP2_COMPARISON_2_MASK;
  TMR0_COMP2 &= ~(1U << TMR_COMP2_COMPARISON_2_SHIFT);
  TMR_CAPT_REG(TMR0) = TMR_CAPT_REG(TMR0) + 1;
  TMR_CAPT_REG(TMR1) = TMR_CAPT_REG(TMR1) + 1;
  TMR_CAPT_REG(TMR2) = TMR_CAPT_REG(TMR2) + 1;
  TMR_CAPT_REG(TMR3) = TMR_CAPT_REG(TMR3) + 1;
  (void)TMR_CAPT_CAPTURE_MASK;
  (void)TMR_CAPT_CAPTURE_SHIFT;
  (void)TMR_CAPT_CAPTURE(1);
  TMR0_CAPT |= TMR_CAPT_CAPTURE_MASK;
  TMR0_CAPT &= ~(1U << TMR_CAPT_CAPTURE_SHIFT);
  TMR_LOAD_REG(TMR0) = TMR_LOAD_REG(TMR0) + 1;
  TMR_LOAD_REG(TMR1) = TMR_LOAD_REG(TMR1) + 1;
  TMR_LOAD_REG(TMR2) = TMR_LOAD_REG(TMR2) + 1;
  TMR_LOAD_REG(TMR3) = TMR_LOAD_REG(TMR3) + 1;
  (void)TMR_LOAD_LOAD_MASK;
  (void)TMR_LOAD_LOAD_SHIFT;
  (void)TMR_LOAD_LOAD(1);
  TMR0_LOAD |= TMR_LOAD_LOAD_MASK;
  TMR0_LOAD &= ~(1U << TMR_LOAD_LOAD_SHIFT);
  TMR_HOLD_REG(TMR0) = TMR_HOLD_REG(TMR0) + 1;
  TMR_HOLD_REG(TMR1) = TMR_HOLD_REG(TMR1) + 1;
  TMR_HOLD_REG(TMR2) = TMR_HOLD_REG(TMR2) + 1;
  TMR_HOLD_REG(TMR3) = TMR_HOLD_REG(TMR3) + 1;
  (void)TMR_HOLD_HOLD_MASK;
  (void)TMR_HOLD_HOLD_SHIFT;
  (void)TMR_HOLD_HOLD(1);
  TMR0_HOLD |= TMR_HOLD_HOLD_MASK;
  TMR0_HOLD &= ~(1U << TMR_HOLD_HOLD_SHIFT);
  TMR_CNTR_REG(TMR0) = TMR_CNTR_REG(TMR0) + 1;
  TMR_CNTR_REG(TMR1) = TMR_CNTR_REG(TMR1) + 1;
  TMR_CNTR_REG(TMR2) = TMR_CNTR_REG(TMR2) + 1;
  TMR_CNTR_REG(TMR3) = TMR_CNTR_REG(TMR3) + 1;
  (void)TMR_CNTR_COUNTER_MASK;
  (void)TMR_CNTR_COUNTER_SHIFT;
  (void)TMR_CNTR_COUNTER(1);
  TMR0_CNTR |= TMR_CNTR_COUNTER_MASK;
  TMR0_CNTR &= ~(1U << TMR_CNTR_COUNTER_SHIFT);
  TMR_CTRL_REG(TMR0) = TMR_CTRL_REG(TMR0) + 1;
  TMR_CTRL_REG(TMR1) = TMR_CTRL_REG(TMR1) + 1;
  TMR_CTRL_REG(TMR2) = TMR_CTRL_REG(TMR2) + 1;
  TMR_CTRL_REG(TMR3) = TMR_CTRL_REG(TMR3) + 1;
  (void)TMR_CTRL_OUTMODE_MASK;
  (void)TMR_CTRL_OUTMODE_SHIFT;
  (void)TMR_CTRL_OUTMODE(1);
  TMR0_CTRL |= TMR_CTRL_OUTMODE_MASK;
  TMR0_CTRL &= ~(1U << TMR_CTRL_OUTMODE_SHIFT);
  (void)TMR_CTRL_COINIT_MASK;
  (void)TMR_CTRL_COINIT_SHIFT;
  TMR0_CTRL |= TMR_CTRL_COINIT_MASK;
  TMR0_CTRL &= ~(1U << TMR_CTRL_COINIT_SHIFT);
  (void)TMR_CTRL_DIR_MASK;
  (void)TMR_CTRL_DIR_SHIFT;
  TMR0_CTRL |= TMR_CTRL_DIR_MASK;
  TMR0_CTRL &= ~(1U << TMR_CTRL_DIR_SHIFT);
  (void)TMR_CTRL_LENGTH_MASK;
  (void)TMR_CTRL_LENGTH_SHIFT;
  TMR0_CTRL |= TMR_CTRL_LENGTH_MASK;
  TMR0_CTRL &= ~(1U << TMR_CTRL_LENGTH_SHIFT);
  (void)TMR_CTRL_ONCE_MASK;
  (void)TMR_CTRL_ONCE_SHIFT;
  TMR0_CTRL |= TMR_CTRL_ONCE_MASK;
  TMR0_CTRL &= ~(1U << TMR_CTRL_ONCE_SHIFT);
  (void)TMR_CTRL_SCS_MASK;
  (void)TMR_CTRL_SCS_SHIFT;
  (void)TMR_CTRL_SCS(1);
  TMR0_CTRL |= TMR_CTRL_SCS_MASK;
  TMR0_CTRL &= ~(1U << TMR_CTRL_SCS_SHIFT);
  (void)TMR_CTRL_PCS_MASK;
  (void)TMR_CTRL_PCS_SHIFT;
  (void)TMR_CTRL_PCS(1);
  TMR0_CTRL |= TMR_CTRL_PCS_MASK;
  TMR0_CTRL &= ~(1U << TMR_CTRL_PCS_SHIFT);
  (void)TMR_CTRL_CM_MASK;
  (void)TMR_CTRL_CM_SHIFT;
  (void)TMR_CTRL_CM(1);
  TMR0_CTRL |= TMR_CTRL_CM_MASK;
  TMR0_CTRL &= ~(1U << TMR_CTRL_CM_SHIFT);
  TMR_SCTRL_REG(TMR0) = TMR_SCTRL_REG(TMR0) + 1;
  TMR_SCTRL_REG(TMR1) = TMR_SCTRL_REG(TMR1) + 1;
  TMR_SCTRL_REG(TMR2) = TMR_SCTRL_REG(TMR2) + 1;
  TMR_SCTRL_REG(TMR3) = TMR_SCTRL_REG(TMR3) + 1;
  (void)TMR_SCTRL_OEN_MASK;
  (void)TMR_SCTRL_OEN_SHIFT;
  TMR0_SCTRL |= TMR_SCTRL_OEN_MASK;
  TMR0_SCTRL &= ~(1U << TMR_SCTRL_OEN_SHIFT);
  (void)TMR_SCTRL_OPS_MASK;
  (void)TMR_SCTRL_OPS_SHIFT;
  TMR0_SCTRL |= TMR_SCTRL_OPS_MASK;
  TMR0_SCTRL &= ~(1U << TMR_SCTRL_OPS_SHIFT);
  (void)TMR_SCTRL_FORCE_MASK;
  (void)TMR_SCTRL_FORCE_SHIFT;
  TMR0_SCTRL |= TMR_SCTRL_FORCE_MASK;
  TMR0_SCTRL &= ~(1U << TMR_SCTRL_FORCE_SHIFT);
  (void)TMR_SCTRL_VAL_MASK;
  (void)TMR_SCTRL_VAL_SHIFT;
  TMR0_SCTRL |= TMR_SCTRL_VAL_MASK;
  TMR0_SCTRL &= ~(1U << TMR_SCTRL_VAL_SHIFT);
  (void)TMR_SCTRL_EEOF_MASK;
  (void)TMR_SCTRL_EEOF_SHIFT;
  TMR0_SCTRL |= TMR_SCTRL_EEOF_MASK;
  TMR0_SCTRL &= ~(1U << TMR_SCTRL_EEOF_SHIFT);
  (void)TMR_SCTRL_MSTR_MASK;
  (void)TMR_SCTRL_MSTR_SHIFT;
  TMR0_SCTRL |= TMR_SCTRL_MSTR_MASK;
  TMR0_SCTRL &= ~(1U << TMR_SCTRL_MSTR_SHIFT);
  (void)TMR_SCTRL_CAPTURE_MODE_MASK;
  (void)TMR_SCTRL_CAPTURE_MODE_SHIFT;
  (void)TMR_SCTRL_CAPTURE_MODE(1);
  TMR0_SCTRL |= TMR_SCTRL_CAPTURE_MODE_MASK;
  TMR0_SCTRL &= ~(1U << TMR_SCTRL_CAPTURE_MODE_SHIFT);
  (void)TMR_SCTRL_INPUT_MASK;
  (void)TMR_SCTRL_INPUT_SHIFT;
  TMR0_SCTRL |= TMR_SCTRL_INPUT_MASK;
  TMR0_SCTRL &= ~(1U << TMR_SCTRL_INPUT_SHIFT);
  (void)TMR_SCTRL_IPS_MASK;
  (void)TMR_SCTRL_IPS_SHIFT;
  TMR0_SCTRL |= TMR_SCTRL_IPS_MASK;
  TMR0_SCTRL &= ~(1U << TMR_SCTRL_IPS_SHIFT);
  (void)TMR_SCTRL_IEFIE_MASK;
  (void)TMR_SCTRL_IEFIE_SHIFT;
  TMR0_SCTRL |= TMR_SCTRL_IEFIE_MASK;
  TMR0_SCTRL &= ~(1U << TMR_SCTRL_IEFIE_SHIFT);
  (void)TMR_SCTRL_IEF_MASK;
  (void)TMR_SCTRL_IEF_SHIFT;
  TMR0_SCTRL |= TMR_SCTRL_IEF_MASK;
  TMR0_SCTRL &= ~(1U << TMR_SCTRL_IEF_SHIFT);
  (void)TMR_SCTRL_TOFIE_MASK;
  (void)TMR_SCTRL_TOFIE_SHIFT;
  TMR0_SCTRL |= TMR_SCTRL_TOFIE_MASK;
  TMR0_SCTRL &= ~(1U << TMR_SCTRL_TOFIE_SHIFT);
  (void)TMR_SCTRL_TOF_MASK;
  (void)TMR_SCTRL_TOF_SHIFT;
  TMR0_SCTRL |= TMR_SCTRL_TOF_MASK;
  TMR0_SCTRL &= ~(1U << TMR_SCTRL_TOF_SHIFT);
  (void)TMR_SCTRL_TCFIE_MASK;
  (void)TMR_SCTRL_TCFIE_SHIFT;
  TMR0_SCTRL |= TMR_SCTRL_TCFIE_MASK;
  TMR0_SCTRL &= ~(1U << TMR_SCTRL_TCFIE_SHIFT);
  (void)TMR_SCTRL_TCF_MASK;
  (void)TMR_SCTRL_TCF_SHIFT;
  TMR0_SCTRL |= TMR_SCTRL_TCF_MASK;
  TMR0_SCTRL &= ~(1U << TMR_SCTRL_TCF_SHIFT);
  TMR_CMPLD1_REG(TMR0) = TMR_CMPLD1_REG(TMR0) + 1;
  TMR_CMPLD1_REG(TMR1) = TMR_CMPLD1_REG(TMR1) + 1;
  TMR_CMPLD1_REG(TMR2) = TMR_CMPLD1_REG(TMR2) + 1;
  TMR_CMPLD1_REG(TMR3) = TMR_CMPLD1_REG(TMR3) + 1;
  (void)TMR_CMPLD1_COMPARATOR_LOAD_1_MASK;
  (void)TMR_CMPLD1_COMPARATOR_LOAD_1_SHIFT;
  (void)TMR_CMPLD1_COMPARATOR_LOAD_1(1);
  TMR0_CMPLD1 |= TMR_CMPLD1_COMPARATOR_LOAD_1_MASK;
  TMR0_CMPLD1 &= ~(1U << TMR_CMPLD1_COMPARATOR_LOAD_1_SHIFT);
  TMR_CMPLD2_REG(TMR0) = TMR_CMPLD2_REG(TMR0) + 1;
  TMR_CMPLD2_REG(TMR1) = TMR_CMPLD2_REG(TMR1) + 1;
  TMR_CMPLD2_REG(TMR2) = TMR_CMPLD2_REG(TMR2) + 1;
  TMR_CMPLD2_REG(TMR3) = TMR_CMPLD2_REG(TMR3) + 1;
  (void)TMR_CMPLD2_COMPARATOR_LOAD_2_MASK;
  (void)TMR_CMPLD2_COMPARATOR_LOAD_2_SHIFT;
  (void)TMR_CMPLD2_COMPARATOR_LOAD_2(1);
  TMR0_CMPLD2 |= TMR_CMPLD2_COMPARATOR_LOAD_2_MASK;
  TMR0_CMPLD2 &= ~(1U << TMR_CMPLD2_COMPARATOR_LOAD_2_SHIFT);
  TMR_CSCTRL_REG(TMR0) = TMR_CSCTRL_REG(TMR0) + 1;
  TMR_CSCTRL_REG(TMR1) = TMR_CSCTRL_REG(TMR1) + 1;
  TMR_CSCTRL_REG(TMR2) = TMR_CSCTRL_REG(TMR2) + 1;
  TMR_CSCTRL_REG(TMR3) = TMR_CSCTRL_REG(TMR3) + 1;
  (void)TMR_CSCTRL_CL1_MASK;
  (void)TMR_CSCTRL_CL1_SHIFT;
  (void)TMR_CSCTRL_CL1(1);
  TMR0_CSCTRL |= TMR_CSCTRL_CL1_MASK;
  TMR0_CSCTRL &= ~(1U << TMR_CSCTRL_CL1_SHIFT);
  (void)TMR_CSCTRL_CL2_MASK;
  (void)TMR_CSCTRL_CL2_SHIFT;
  (void)TMR_CSCTRL_CL2(1);
  TMR0_CSCTRL |= TMR_CSCTRL_CL2_MASK;
  TMR0_CSCTRL &= ~(1U << TMR_CSCTRL_CL2_SHIFT);
  (void)TMR_CSCTRL_TCF1_MASK;
  (void)TMR_CSCTRL_TCF1_SHIFT;
  TMR0_CSCTRL |= TMR_CSCTRL_TCF1_MASK;
  TMR0_CSCTRL &= ~(1U << TMR_CSCTRL_TCF1_SHIFT);
  (void)TMR_CSCTRL_TCF2_MASK;
  (void)TMR_CSCTRL_TCF2_SHIFT;
  TMR0_CSCTRL |= TMR_CSCTRL_TCF2_MASK;
  TMR0_CSCTRL &= ~(1U << TMR_CSCTRL_TCF2_SHIFT);
  (void)TMR_CSCTRL_TCF1EN_MASK;
  (void)TMR_CSCTRL_TCF1EN_SHIFT;
  TMR0_CSCTRL |= TMR_CSCTRL_TCF1EN_MASK;
  TMR0_CSCTRL &= ~(1U << TMR_CSCTRL_TCF1EN_SHIFT);
  (void)TMR_CSCTRL_TCF2EN_MASK;
  (void)TMR_CSCTRL_TCF2EN_SHIFT;
  TMR0_CSCTRL |= TMR_CSCTRL_TCF2EN_MASK;
  TMR0_CSCTRL &= ~(1U << TMR_CSCTRL_TCF2EN_SHIFT);
  (void)TMR_CSCTRL_UP_MASK;
  (void)TMR_CSCTRL_UP_SHIFT;
  TMR0_CSCTRL |= TMR_CSCTRL_UP_MASK;
  TMR0_CSCTRL &= ~(1U << TMR_CSCTRL_UP_SHIFT);
  (void)TMR_CSCTRL_TCI_MASK;
  (void)TMR_CSCTRL_TCI_SHIFT;
  TMR0_CSCTRL |= TMR_CSCTRL_TCI_MASK;
  TMR0_CSCTRL &= ~(1U << TMR_CSCTRL_TCI_SHIFT);
  (void)TMR_CSCTRL_ROC_MASK;
  (void)TMR_CSCTRL_ROC_SHIFT;
  TMR0_CSCTRL |= TMR_CSCTRL_ROC_MASK;
  TMR0_CSCTRL &= ~(1U << TMR_CSCTRL_ROC_SHIFT);
  (void)TMR_CSCTRL_ALT_LOAD_MASK;
  (void)TMR_CSCTRL_ALT_LOAD_SHIFT;
  TMR0_CSCTRL |= TMR_CSCTRL_ALT_LOAD_MASK;
  TMR0_CSCTRL &= ~(1U << TMR_CSCTRL_ALT_LOAD_SHIFT);
  (void)TMR_CSCTRL_FAULT_MASK;
  (void)TMR_CSCTRL_FAULT_SHIFT;
  TMR0_CSCTRL |= TMR_CSCTRL_FAULT_MASK;
  TMR0_CSCTRL &= ~(1U << TMR_CSCTRL_FAULT_SHIFT);
  (void)TMR_CSCTRL_DBG_EN_MASK;
  (void)TMR_CSCTRL_DBG_EN_SHIFT;
  (void)TMR_CSCTRL_DBG_EN(1);
  TMR0_CSCTRL |= TMR_CSCTRL_DBG_EN_MASK;
  TMR0_CSCTRL &= ~(1U << TMR_CSCTRL_DBG_EN_SHIFT);
  TMR_FILT_REG(TMR0) = TMR_FILT_REG(TMR0) + 1;
  TMR_FILT_REG(TMR1) = TMR_FILT_REG(TMR1) + 1;
  TMR_FILT_REG(TMR2) = TMR_FILT_REG(TMR2) + 1;
  TMR_FILT_REG(TMR3) = TMR_FILT_REG(TMR3) + 1;
  (void)TMR_FILT_FILT_PER_MASK;
  (void)TMR_FILT_FILT_PER_SHIFT;
  (void)TMR_FILT_FILT_PER(1);
  TMR0_FILT |= TMR_FILT_FILT_PER_MASK;
  TMR0_FILT &= ~(1U << TMR_FILT_FILT_PER_SHIFT);
  (void)TMR_FILT_FILT_CNT_MASK;
  (void)TMR_FILT_FILT_CNT_SHIFT;
  (void)TMR_FILT_FILT_CNT(1);
  TMR0_FILT |= TMR_FILT_FILT_CNT_MASK;
  TMR0_FILT &= ~(1U << TMR_FILT_FILT_CNT_SHIFT);
  TMR_ENBL_REG(TMR0) = TMR_ENBL_REG(TMR0) + 1;
  (void)TMR_ENBL_ENBL_MASK;
  (void)TMR_ENBL_ENBL_SHIFT;
  (void)TMR_ENBL_ENBL(1);
  TMR0_ENBL |= TMR_ENBL_ENBL_MASK;
  TMR0_ENBL &= ~(1U << TMR_ENBL_ENBL_SHIFT);
}

