kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/CMSIS_Test_MKM33Z5_v1_3.c
void test_UART(void) {
  (void)UART0_BASE;
  (void)UART0;
  (void)UART1_BASE;
  (void)UART1;
  (void)UART2_BASE;
  (void)UART2;
  (void)UART3_BASE;
  (void)UART3;
  UART0_BDH = UART0_BDH + 1;
  UART0_BDL = UART0_BDL + 1;
  UART0_C1 = UART0_C1 + 1;
  UART0_C2 = UART0_C2 + 1;
  UART0_S2 = UART0_S2 + 1;
  UART0_C3 = UART0_C3 + 1;
  UART0_D = UART0_D + 1;
  UART0_MA1 = UART0_MA1 + 1;
  UART0_MA2 = UART0_MA2 + 1;
  UART0_C4 = UART0_C4 + 1;
  UART0_C5 = UART0_C5 + 1;
  UART0_MODEM = UART0_MODEM + 1;
  UART0_PFIFO = UART0_PFIFO + 1;
  UART0_CFIFO = UART0_CFIFO + 1;
  UART0_SFIFO = UART0_SFIFO + 1;
  UART0_TWFIFO = UART0_TWFIFO + 1;
  UART0_RWFIFO = UART0_RWFIFO + 1;
  UART1_BDH = UART1_BDH + 1;
  UART1_BDL = UART1_BDL + 1;
  UART1_C1 = UART1_C1 + 1;
  UART1_C2 = UART1_C2 + 1;
  UART1_S2 = UART1_S2 + 1;
  UART1_C3 = UART1_C3 + 1;
  UART1_D = UART1_D + 1;
  UART1_MA1 = UART1_MA1 + 1;
  UART1_MA2 = UART1_MA2 + 1;
  UART1_C4 = UART1_C4 + 1;
  UART1_C5 = UART1_C5 + 1;
  UART1_MODEM = UART1_MODEM + 1;
  UART1_PFIFO = UART1_PFIFO + 1;
  UART1_CFIFO = UART1_CFIFO + 1;
  UART1_SFIFO = UART1_SFIFO + 1;
  UART1_TWFIFO = UART1_TWFIFO + 1;
  UART1_RWFIFO = UART1_RWFIFO + 1;
  UART1_C7816 = UART1_C7816 + 1;
  UART1_IE7816 = UART1_IE7816 + 1;
  UART1_IS7816 = UART1_IS7816 + 1;
  UART1_WP7816T0 = UART1_WP7816T0 + 1;
  UART1_WP7816T1 = UART1_WP7816T1 + 1;
  UART1_WN7816 = UART1_WN7816 + 1;
  UART1_WF7816 = UART1_WF7816 + 1;
  UART1_ET7816 = UART1_ET7816 + 1;
  UART1_TL7816 = UART1_TL7816 + 1;
  UART2_BDH = UART2_BDH + 1;
  UART2_BDL = UART2_BDL + 1;
  UART2_C1 = UART2_C1 + 1;
  UART2_C2 = UART2_C2 + 1;
  UART2_S2 = UART2_S2 + 1;
  UART2_C3 = UART2_C3 + 1;
  UART2_D = UART2_D + 1;
  UART2_MA1 = UART2_MA1 + 1;
  UART2_MA2 = UART2_MA2 + 1;
  UART2_C4 = UART2_C4 + 1;
  UART2_C5 = UART2_C5 + 1;
  UART2_MODEM = UART2_MODEM + 1;
  UART2_PFIFO = UART2_PFIFO + 1;
  UART2_CFIFO = UART2_CFIFO + 1;
  UART2_SFIFO = UART2_SFIFO + 1;
  UART2_TWFIFO = UART2_TWFIFO + 1;
  UART2_RWFIFO = UART2_RWFIFO + 1;
  UART3_BDH = UART3_BDH + 1;
  UART3_BDL = UART3_BDL + 1;
  UART3_C1 = UART3_C1 + 1;
  UART3_C2 = UART3_C2 + 1;
  UART3_S2 = UART3_S2 + 1;
  UART3_C3 = UART3_C3 + 1;
  UART3_D = UART3_D + 1;
  UART3_MA1 = UART3_MA1 + 1;
  UART3_MA2 = UART3_MA2 + 1;
  UART3_C4 = UART3_C4 + 1;
  UART3_C5 = UART3_C5 + 1;
  UART3_MODEM = UART3_MODEM + 1;
  UART3_PFIFO = UART3_PFIFO + 1;
  UART3_CFIFO = UART3_CFIFO + 1;
  UART3_SFIFO = UART3_SFIFO + 1;
  UART3_TWFIFO = UART3_TWFIFO + 1;
  UART3_RWFIFO = UART3_RWFIFO + 1;
  UART3_C7816 = UART3_C7816 + 1;
  UART3_IE7816 = UART3_IE7816 + 1;
  UART3_IS7816 = UART3_IS7816 + 1;
  UART3_WP7816T0 = UART3_WP7816T0 + 1;
  UART3_WP7816T1 = UART3_WP7816T1 + 1;
  UART3_WN7816 = UART3_WN7816 + 1;
  UART3_WF7816 = UART3_WF7816 + 1;
  UART3_ET7816 = UART3_ET7816 + 1;
  UART3_TL7816 = UART3_TL7816 + 1;
  UART_BDH_REG(UART0) = UART_BDH_REG(UART0) + 1;
  UART_BDH_REG(UART1) = UART_BDH_REG(UART1) + 1;
  UART_BDH_REG(UART2) = UART_BDH_REG(UART2) + 1;
  UART_BDH_REG(UART3) = UART_BDH_REG(UART3) + 1;
  (void)UART_BDH_SBR_MASK;
  (void)UART_BDH_SBR_SHIFT;
  (void)UART_BDH_SBR(1);
  UART0_BDH |= UART_BDH_SBR_MASK;
  UART0_BDH &= ~(1U << UART_BDH_SBR_SHIFT);
  (void)UART_BDH_RXEDGIE_MASK;
  (void)UART_BDH_RXEDGIE_SHIFT;
  UART0_BDH |= UART_BDH_RXEDGIE_MASK;
  UART0_BDH &= ~(1U << UART_BDH_RXEDGIE_SHIFT);
  UART_BDL_REG(UART0) = UART_BDL_REG(UART0) + 1;
  UART_BDL_REG(UART1) = UART_BDL_REG(UART1) + 1;
  UART_BDL_REG(UART2) = UART_BDL_REG(UART2) + 1;
  UART_BDL_REG(UART3) = UART_BDL_REG(UART3) + 1;
  (void)UART_BDL_SBR_MASK;
  (void)UART_BDL_SBR_SHIFT;
  (void)UART_BDL_SBR(1);
  UART0_BDL |= UART_BDL_SBR_MASK;
  UART0_BDL &= ~(1U << UART_BDL_SBR_SHIFT);
  UART_C1_REG(UART0) = UART_C1_REG(UART0) + 1;
  UART_C1_REG(UART1) = UART_C1_REG(UART1) + 1;
  UART_C1_REG(UART2) = UART_C1_REG(UART2) + 1;
  UART_C1_REG(UART3) = UART_C1_REG(UART3) + 1;
  (void)UART_C1_PT_MASK;
  (void)UART_C1_PT_SHIFT;
  UART0_C1 |= UART_C1_PT_MASK;
  UART0_C1 &= ~(1U << UART_C1_PT_SHIFT);
  (void)UART_C1_PE_MASK;
  (void)UART_C1_PE_SHIFT;
  UART0_C1 |= UART_C1_PE_MASK;
  UART0_C1 &= ~(1U << UART_C1_PE_SHIFT);
  (void)UART_C1_ILT_MASK;
  (void)UART_C1_ILT_SHIFT;
  UART0_C1 |= UART_C1_ILT_MASK;
  UART0_C1 &= ~(1U << UART_C1_ILT_SHIFT);
  (void)UART_C1_WAKE_MASK;
  (void)UART_C1_WAKE_SHIFT;
  UART0_C1 |= UART_C1_WAKE_MASK;
  UART0_C1 &= ~(1U << UART_C1_WAKE_SHIFT);
  (void)UART_C1_M_MASK;
  (void)UART_C1_M_SHIFT;
  UART0_C1 |= UART_C1_M_MASK;
  UART0_C1 &= ~(1U << UART_C1_M_SHIFT);
  (void)UART_C1_RSRC_MASK;
  (void)UART_C1_RSRC_SHIFT;
  UART0_C1 |= UART_C1_RSRC_MASK;
  UART0_C1 &= ~(1U << UART_C1_RSRC_SHIFT);
  (void)UART_C1_LOOPS_MASK;
  (void)UART_C1_LOOPS_SHIFT;
  UART0_C1 |= UART_C1_LOOPS_MASK;
  UART0_C1 &= ~(1U << UART_C1_LOOPS_SHIFT);
  UART_C2_REG(UART0) = UART_C2_REG(UART0) + 1;
  UART_C2_REG(UART1) = UART_C2_REG(UART1) + 1;
  UART_C2_REG(UART2) = UART_C2_REG(UART2) + 1;
  UART_C2_REG(UART3) = UART_C2_REG(UART3) + 1;
  (void)UART_C2_SBK_MASK;
  (void)UART_C2_SBK_SHIFT;
  UART0_C2 |= UART_C2_SBK_MASK;
  UART0_C2 &= ~(1U << UART_C2_SBK_SHIFT);
  (void)UART_C2_RWU_MASK;
  (void)UART_C2_RWU_SHIFT;
  UART0_C2 |= UART_C2_RWU_MASK;
  UART0_C2 &= ~(1U << UART_C2_RWU_SHIFT);
  (void)UART_C2_RE_MASK;
  (void)UART_C2_RE_SHIFT;
  UART0_C2 |= UART_C2_RE_MASK;
  UART0_C2 &= ~(1U << UART_C2_RE_SHIFT);
  (void)UART_C2_TE_MASK;
  (void)UART_C2_TE_SHIFT;
  UART0_C2 |= UART_C2_TE_MASK;
  UART0_C2 &= ~(1U << UART_C2_TE_SHIFT);
  (void)UART_C2_ILIE_MASK;
  (void)UART_C2_ILIE_SHIFT;
  UART0_C2 |= UART_C2_ILIE_MASK;
  UART0_C2 &= ~(1U << UART_C2_ILIE_SHIFT);
  (void)UART_C2_RIE_MASK;
  (void)UART_C2_RIE_SHIFT;
  UART0_C2 |= UART_C2_RIE_MASK;
  UART0_C2 &= ~(1U << UART_C2_RIE_SHIFT);
  (void)UART_C2_TCIE_MASK;
  (void)UART_C2_TCIE_SHIFT;
  UART0_C2 |= UART_C2_TCIE_MASK;
  UART0_C2 &= ~(1U << UART_C2_TCIE_SHIFT);
  (void)UART_C2_TIE_MASK;
  (void)UART_C2_TIE_SHIFT;
  UART0_C2 |= UART_C2_TIE_MASK;
  UART0_C2 &= ~(1U << UART_C2_TIE_SHIFT);
  (void)UART_S1_PF_MASK;
  (void)UART_S1_PF_SHIFT;
  (void)UART_S1_FE_MASK;
  (void)UART_S1_FE_SHIFT;
  (void)UART_S1_NF_MASK;
  (void)UART_S1_NF_SHIFT;
  (void)UART_S1_OR_MASK;
  (void)UART_S1_OR_SHIFT;
  (void)UART_S1_IDLE_MASK;
  (void)UART_S1_IDLE_SHIFT;
  (void)UART_S1_RDRF_MASK;
  (void)UART_S1_RDRF_SHIFT;
  (void)UART_S1_TC_MASK;
  (void)UART_S1_TC_SHIFT;
  (void)UART_S1_TDRE_MASK;
  (void)UART_S1_TDRE_SHIFT;
  UART_S2_REG(UART0) = UART_S2_REG(UART0) + 1;
  UART_S2_REG(UART1) = UART_S2_REG(UART1) + 1;
  UART_S2_REG(UART2) = UART_S2_REG(UART2) + 1;
  UART_S2_REG(UART3) = UART_S2_REG(UART3) + 1;
  (void)UART_S2_RAF_MASK;
  (void)UART_S2_RAF_SHIFT;
  UART0_S2 |= UART_S2_RAF_MASK;
  UART0_S2 &= ~(1U << UART_S2_RAF_SHIFT);
  (void)UART_S2_BRK13_MASK;
  (void)UART_S2_BRK13_SHIFT;
  UART0_S2 |= UART_S2_BRK13_MASK;
  UART0_S2 &= ~(1U << UART_S2_BRK13_SHIFT);
  (void)UART_S2_RWUID_MASK;
  (void)UART_S2_RWUID_SHIFT;
  UART0_S2 |= UART_S2_RWUID_MASK;
  UART0_S2 &= ~(1U << UART_S2_RWUID_SHIFT);
  (void)UART_S2_RXINV_MASK;
  (void)UART_S2_RXINV_SHIFT;
  UART0_S2 |= UART_S2_RXINV_MASK;
  UART0_S2 &= ~(1U << UART_S2_RXINV_SHIFT);
  (void)UART_S2_MSBF_MASK;
  (void)UART_S2_MSBF_SHIFT;
  UART0_S2 |= UART_S2_MSBF_MASK;
  UART0_S2 &= ~(1U << UART_S2_MSBF_SHIFT);
  (void)UART_S2_RXEDGIF_MASK;
  (void)UART_S2_RXEDGIF_SHIFT;
  UART0_S2 |= UART_S2_RXEDGIF_MASK;
  UART0_S2 &= ~(1U << UART_S2_RXEDGIF_SHIFT);
  UART_C3_REG(UART0) = UART_C3_REG(UART0) + 1;
  UART_C3_REG(UART1) = UART_C3_REG(UART1) + 1;
  UART_C3_REG(UART2) = UART_C3_REG(UART2) + 1;
  UART_C3_REG(UART3) = UART_C3_REG(UART3) + 1;
  (void)UART_C3_PEIE_MASK;
  (void)UART_C3_PEIE_SHIFT;
  UART0_C3 |= UART_C3_PEIE_MASK;
  UART0_C3 &= ~(1U << UART_C3_PEIE_SHIFT);
  (void)UART_C3_FEIE_MASK;
  (void)UART_C3_FEIE_SHIFT;
  UART0_C3 |= UART_C3_FEIE_MASK;
  UART0_C3 &= ~(1U << UART_C3_FEIE_SHIFT);
  (void)UART_C3_NEIE_MASK;
  (void)UART_C3_NEIE_SHIFT;
  UART0_C3 |= UART_C3_NEIE_MASK;
  UART0_C3 &= ~(1U << UART_C3_NEIE_SHIFT);
  (void)UART_C3_ORIE_MASK;
  (void)UART_C3_ORIE_SHIFT;
  UART0_C3 |= UART_C3_ORIE_MASK;
  UART0_C3 &= ~(1U << UART_C3_ORIE_SHIFT);
  (void)UART_C3_TXINV_MASK;
  (void)UART_C3_TXINV_SHIFT;
  UART0_C3 |= UART_C3_TXINV_MASK;
  UART0_C3 &= ~(1U << UART_C3_TXINV_SHIFT);
  (void)UART_C3_TXDIR_MASK;
  (void)UART_C3_TXDIR_SHIFT;
  UART0_C3 |= UART_C3_TXDIR_MASK;
  UART0_C3 &= ~(1U << UART_C3_TXDIR_SHIFT);
  (void)UART_C3_T8_MASK;
  (void)UART_C3_T8_SHIFT;
  UART0_C3 |= UART_C3_T8_MASK;
  UART0_C3 &= ~(1U << UART_C3_T8_SHIFT);
  (void)UART_C3_R8_MASK;
  (void)UART_C3_R8_SHIFT;
  UART0_C3 |= UART_C3_R8_MASK;
  UART0_C3 &= ~(1U << UART_C3_R8_SHIFT);
  UART_D_REG(UART0) = UART_D_REG(UART0) + 1;
  UART_D_REG(UART1) = UART_D_REG(UART1) + 1;
  UART_D_REG(UART2) = UART_D_REG(UART2) + 1;
  UART_D_REG(UART3) = UART_D_REG(UART3) + 1;
  (void)UART_D_RT_MASK;
  (void)UART_D_RT_SHIFT;
  (void)UART_D_RT(1);
  UART0_D |= UART_D_RT_MASK;
  UART0_D &= ~(1U << UART_D_RT_SHIFT);
  UART_MA1_REG(UART0) = UART_MA1_REG(UART0) + 1;
  UART_MA1_REG(UART1) = UART_MA1_REG(UART1) + 1;
  UART_MA1_REG(UART2) = UART_MA1_REG(UART2) + 1;
  UART_MA1_REG(UART3) = UART_MA1_REG(UART3) + 1;
  (void)UART_MA1_MA_MASK;
  (void)UART_MA1_MA_SHIFT;
  (void)UART_MA1_MA(1);
  UART0_MA1 |= UART_MA1_MA_MASK;
  UART0_MA1 &= ~(1U << UART_MA1_MA_SHIFT);
  UART_MA2_REG(UART0) = UART_MA2_REG(UART0) + 1;
  UART_MA2_REG(UART1) = UART_MA2_REG(UART1) + 1;
  UART_MA2_REG(UART2) = UART_MA2_REG(UART2) + 1;
  UART_MA2_REG(UART3) = UART_MA2_REG(UART3) + 1;
  (void)UART_MA2_MA_MASK;
  (void)UART_MA2_MA_SHIFT;
  (void)UART_MA2_MA(1);
  UART0_MA2 |= UART_MA2_MA_MASK;
  UART0_MA2 &= ~(1U << UART_MA2_MA_SHIFT);
  UART_C4_REG(UART0) = UART_C4_REG(UART0) + 1;
  UART_C4_REG(UART1) = UART_C4_REG(UART1) + 1;
  UART_C4_REG(UART2) = UART_C4_REG(UART2) + 1;
  UART_C4_REG(UART3) = UART_C4_REG(UART3) + 1;
  (void)UART_C4_BRFA_MASK;
  (void)UART_C4_BRFA_SHIFT;
  (void)UART_C4_BRFA(1);
  UART0_C4 |= UART_C4_BRFA_MASK;
  UART0_C4 &= ~(1U << UART_C4_BRFA_SHIFT);
  (void)UART_C4_M10_MASK;
  (void)UART_C4_M10_SHIFT;
  UART0_C4 |= UART_C4_M10_MASK;
  UART0_C4 &= ~(1U << UART_C4_M10_SHIFT);
  (void)UART_C4_MAEN2_MASK;
  (void)UART_C4_MAEN2_SHIFT;
  UART0_C4 |= UART_C4_MAEN2_MASK;
  UART0_C4 &= ~(1U << UART_C4_MAEN2_SHIFT);
  (void)UART_C4_MAEN1_MASK;
  (void)UART_C4_MAEN1_SHIFT;
  UART0_C4 |= UART_C4_MAEN1_MASK;
  UART0_C4 &= ~(1U << UART_C4_MAEN1_SHIFT);
  UART_C5_REG(UART0) = UART_C5_REG(UART0) + 1;
  UART_C5_REG(UART1) = UART_C5_REG(UART1) + 1;
  UART_C5_REG(UART2) = UART_C5_REG(UART2) + 1;
  UART_C5_REG(UART3) = UART_C5_REG(UART3) + 1;
  (void)UART_C5_RDMAS_MASK;
  (void)UART_C5_RDMAS_SHIFT;
  UART0_C5 |= UART_C5_RDMAS_MASK;
  UART0_C5 &= ~(1U << UART_C5_RDMAS_SHIFT);
  (void)UART_C5_TDMAS_MASK;
  (void)UART_C5_TDMAS_SHIFT;
  UART0_C5 |= UART_C5_TDMAS_MASK;
  UART0_C5 &= ~(1U << UART_C5_TDMAS_SHIFT);
  (void)UART_ED_PARITYE_MASK;
  (void)UART_ED_PARITYE_SHIFT;
  (void)UART_ED_NOISY_MASK;
  (void)UART_ED_NOISY_SHIFT;
  UART_MODEM_REG(UART0) = UART_MODEM_REG(UART0) + 1;
  UART_MODEM_REG(UART1) = UART_MODEM_REG(UART1) + 1;
  UART_MODEM_REG(UART2) = UART_MODEM_REG(UART2) + 1;
  UART_MODEM_REG(UART3) = UART_MODEM_REG(UART3) + 1;
  (void)UART_MODEM_TXCTSE_MASK;
  (void)UART_MODEM_TXCTSE_SHIFT;
  UART0_MODEM |= UART_MODEM_TXCTSE_MASK;
  UART0_MODEM &= ~(1U << UART_MODEM_TXCTSE_SHIFT);
  (void)UART_MODEM_TXRTSE_MASK;
  (void)UART_MODEM_TXRTSE_SHIFT;
  UART0_MODEM |= UART_MODEM_TXRTSE_MASK;
  UART0_MODEM &= ~(1U << UART_MODEM_TXRTSE_SHIFT);
  (void)UART_MODEM_TXRTSPOL_MASK;
  (void)UART_MODEM_TXRTSPOL_SHIFT;
  UART0_MODEM |= UART_MODEM_TXRTSPOL_MASK;
  UART0_MODEM &= ~(1U << UART_MODEM_TXRTSPOL_SHIFT);
  (void)UART_MODEM_RXRTSE_MASK;
  (void)UART_MODEM_RXRTSE_SHIFT;
  UART0_MODEM |= UART_MODEM_RXRTSE_MASK;
  UART0_MODEM &= ~(1U << UART_MODEM_RXRTSE_SHIFT);
  UART_PFIFO_REG(UART0) = UART_PFIFO_REG(UART0) + 1;
  UART_PFIFO_REG(UART1) = UART_PFIFO_REG(UART1) + 1;
  UART_PFIFO_REG(UART2) = UART_PFIFO_REG(UART2) + 1;
  UART_PFIFO_REG(UART3) = UART_PFIFO_REG(UART3) + 1;
  (void)UART_PFIFO_RXFIFOSIZE_MASK;
  (void)UART_PFIFO_RXFIFOSIZE_SHIFT;
  (void)UART_PFIFO_RXFIFOSIZE(1);
  UART0_PFIFO |= UART_PFIFO_RXFIFOSIZE_MASK;
  UART0_PFIFO &= ~(1U << UART_PFIFO_RXFIFOSIZE_SHIFT);
  (void)UART_PFIFO_RXFE_MASK;
  (void)UART_PFIFO_RXFE_SHIFT;
  UART0_PFIFO |= UART_PFIFO_RXFE_MASK;
  UART0_PFIFO &= ~(1U << UART_PFIFO_RXFE_SHIFT);
  (void)UART_PFIFO_TXFIFOSIZE_MASK;
  (void)UART_PFIFO_TXFIFOSIZE_SHIFT;
  (void)UART_PFIFO_TXFIFOSIZE(1);
  UART0_PFIFO |= UART_PFIFO_TXFIFOSIZE_MASK;
  UART0_PFIFO &= ~(1U << UART_PFIFO_TXFIFOSIZE_SHIFT);
  (void)UART_PFIFO_TXFE_MASK;
  (void)UART_PFIFO_TXFE_SHIFT;
  UART0_PFIFO |= UART_PFIFO_TXFE_MASK;
  UART0_PFIFO &= ~(1U << UART_PFIFO_TXFE_SHIFT);
  UART_CFIFO_REG(UART0) = UART_CFIFO_REG(UART0) + 1;
  UART_CFIFO_REG(UART1) = UART_CFIFO_REG(UART1) + 1;
  UART_CFIFO_REG(UART2) = UART_CFIFO_REG(UART2) + 1;
  UART_CFIFO_REG(UART3) = UART_CFIFO_REG(UART3) + 1;
  (void)UART_CFIFO_RXUFE_MASK;
  (void)UART_CFIFO_RXUFE_SHIFT;
  UART0_CFIFO |= UART_CFIFO_RXUFE_MASK;
  UART0_CFIFO &= ~(1U << UART_CFIFO_RXUFE_SHIFT);
  (void)UART_CFIFO_TXOFE_MASK;
  (void)UART_CFIFO_TXOFE_SHIFT;
  UART0_CFIFO |= UART_CFIFO_TXOFE_MASK;
  UART0_CFIFO &= ~(1U << UART_CFIFO_TXOFE_SHIFT);
  (void)UART_CFIFO_RXOFE_MASK;
  (void)UART_CFIFO_RXOFE_SHIFT;
  UART0_CFIFO |= UART_CFIFO_RXOFE_MASK;
  UART0_CFIFO &= ~(1U << UART_CFIFO_RXOFE_SHIFT);
  (void)UART_CFIFO_RXFLUSH_MASK;
  (void)UART_CFIFO_RXFLUSH_SHIFT;
  UART0_CFIFO |= UART_CFIFO_RXFLUSH_MASK;
  UART0_CFIFO &= ~(1U << UART_CFIFO_RXFLUSH_SHIFT);
  (void)UART_CFIFO_TXFLUSH_MASK;
  (void)UART_CFIFO_TXFLUSH_SHIFT;
  UART0_CFIFO |= UART_CFIFO_TXFLUSH_MASK;
  UART0_CFIFO &= ~(1U << UART_CFIFO_TXFLUSH_SHIFT);
  UART_SFIFO_REG(UART0) = UART_SFIFO_REG(UART0) + 1;
  UART_SFIFO_REG(UART1) = UART_SFIFO_REG(UART1) + 1;
  UART_SFIFO_REG(UART2) = UART_SFIFO_REG(UART2) + 1;
  UART_SFIFO_REG(UART3) = UART_SFIFO_REG(UART3) + 1;
  (void)UART_SFIFO_RXUF_MASK;
  (void)UART_SFIFO_RXUF_SHIFT;
  UART0_SFIFO |= UART_SFIFO_RXUF_MASK;
  UART0_SFIFO &= ~(1U << UART_SFIFO_RXUF_SHIFT);
  (void)UART_SFIFO_TXOF_MASK;
  (void)UART_SFIFO_TXOF_SHIFT;
  UART0_SFIFO |= UART_SFIFO_TXOF_MASK;
  UART0_SFIFO &= ~(1U << UART_SFIFO_TXOF_SHIFT);
  (void)UART_SFIFO_RXOF_MASK;
  (void)UART_SFIFO_RXOF_SHIFT;
  UART0_SFIFO |= UART_SFIFO_RXOF_MASK;
  UART0_SFIFO &= ~(1U << UART_SFIFO_RXOF_SHIFT);
  (void)UART_SFIFO_RXEMPT_MASK;
  (void)UART_SFIFO_RXEMPT_SHIFT;
  UART0_SFIFO |= UART_SFIFO_RXEMPT_MASK;
  UART0_SFIFO &= ~(1U << UART_SFIFO_RXEMPT_SHIFT);
  (void)UART_SFIFO_TXEMPT_MASK;
  (void)UART_SFIFO_TXEMPT_SHIFT;
  UART0_SFIFO |= UART_SFIFO_TXEMPT_MASK;
  UART0_SFIFO &= ~(1U << UART_SFIFO_TXEMPT_SHIFT);
  UART_TWFIFO_REG(UART0) = UART_TWFIFO_REG(UART0) + 1;
  UART_TWFIFO_REG(UART1) = UART_TWFIFO_REG(UART1) + 1;
  UART_TWFIFO_REG(UART2) = UART_TWFIFO_REG(UART2) + 1;
  UART_TWFIFO_REG(UART3) = UART_TWFIFO_REG(UART3) + 1;
  (void)UART_TWFIFO_TXWATER_MASK;
  (void)UART_TWFIFO_TXWATER_SHIFT;
  (void)UART_TWFIFO_TXWATER(1);
  UART0_TWFIFO |= UART_TWFIFO_TXWATER_MASK;
  UART0_TWFIFO &= ~(1U << UART_TWFIFO_TXWATER_SHIFT);
  (void)UART_TCFIFO_TXCOUNT_MASK;
  (void)UART_TCFIFO_TXCOUNT_SHIFT;
  (void)UART_TCFIFO_TXCOUNT(1);
  UART_RWFIFO_REG(UART0) = UART_RWFIFO_REG(UART0) + 1;
  UART_RWFIFO_REG(UART1) = UART_RWFIFO_REG(UART1) + 1;
  UART_RWFIFO_REG(UART2) = UART_RWFIFO_REG(UART2) + 1;
  UART_RWFIFO_REG(UART3) = UART_RWFIFO_REG(UART3) + 1;
  (void)UART_RWFIFO_RXWATER_MASK;
  (void)UART_RWFIFO_RXWATER_SHIFT;
  (void)UART_RWFIFO_RXWATER(1);
  UART0_RWFIFO |= UART_RWFIFO_RXWATER_MASK;
  UART0_RWFIFO &= ~(1U << UART_RWFIFO_RXWATER_SHIFT);
  (void)UART_RCFIFO_RXCOUNT_MASK;
  (void)UART_RCFIFO_RXCOUNT_SHIFT;
  (void)UART_RCFIFO_RXCOUNT(1);
  UART_C7816_REG(UART1) = UART_C7816_REG(UART1) + 1;
  UART_C7816_REG(UART3) = UART_C7816_REG(UART3) + 1;
  (void)UART_C7816_ISO_7816E_MASK;
  (void)UART_C7816_ISO_7816E_SHIFT;
  UART1_C7816 |= UART_C7816_ISO_7816E_MASK;
  UART1_C7816 &= ~(1U << UART_C7816_ISO_7816E_SHIFT);
  (void)UART_C7816_TTYPE_MASK;
  (void)UART_C7816_TTYPE_SHIFT;
  UART1_C7816 |= UART_C7816_TTYPE_MASK;
  UART1_C7816 &= ~(1U << UART_C7816_TTYPE_SHIFT);
  (void)UART_C7816_INIT_MASK;
  (void)UART_C7816_INIT_SHIFT;
  UART1_C7816 |= UART_C7816_INIT_MASK;
  UART1_C7816 &= ~(1U << UART_C7816_INIT_SHIFT);
  (void)UART_C7816_ANACK_MASK;
  (void)UART_C7816_ANACK_SHIFT;
  UART1_C7816 |= UART_C7816_ANACK_MASK;
  UART1_C7816 &= ~(1U << UART_C7816_ANACK_SHIFT);
  (void)UART_C7816_ONACK_MASK;
  (void)UART_C7816_ONACK_SHIFT;
  UART1_C7816 |= UART_C7816_ONACK_MASK;
  UART1_C7816 &= ~(1U << UART_C7816_ONACK_SHIFT);
  UART_IE7816_REG(UART1) = UART_IE7816_REG(UART1) + 1;
  UART_IE7816_REG(UART3) = UART_IE7816_REG(UART3) + 1;
  (void)UART_IE7816_RXTE_MASK;
  (void)UART_IE7816_RXTE_SHIFT;
  UART1_IE7816 |= UART_IE7816_RXTE_MASK;
  UART1_IE7816 &= ~(1U << UART_IE7816_RXTE_SHIFT);
  (void)UART_IE7816_TXTE_MASK;
  (void)UART_IE7816_TXTE_SHIFT;
  UART1_IE7816 |= UART_IE7816_TXTE_MASK;
  UART1_IE7816 &= ~(1U << UART_IE7816_TXTE_SHIFT);
  (void)UART_IE7816_GTVE_MASK;
  (void)UART_IE7816_GTVE_SHIFT;
  UART1_IE7816 |= UART_IE7816_GTVE_MASK;
  UART1_IE7816 &= ~(1U << UART_IE7816_GTVE_SHIFT);
  (void)UART_IE7816_INITDE_MASK;
  (void)UART_IE7816_INITDE_SHIFT;
  UART1_IE7816 |= UART_IE7816_INITDE_MASK;
  UART1_IE7816 &= ~(1U << UART_IE7816_INITDE_SHIFT);
  (void)UART_IE7816_BWTE_MASK;
  (void)UART_IE7816_BWTE_SHIFT;
  UART1_IE7816 |= UART_IE7816_BWTE_MASK;
  UART1_IE7816 &= ~(1U << UART_IE7816_BWTE_SHIFT);
  (void)UART_IE7816_CWTE_MASK;
  (void)UART_IE7816_CWTE_SHIFT;
  UART1_IE7816 |= UART_IE7816_CWTE_MASK;
  UART1_IE7816 &= ~(1U << UART_IE7816_CWTE_SHIFT);
  (void)UART_IE7816_WTE_MASK;
  (void)UART_IE7816_WTE_SHIFT;
  UART1_IE7816 |= UART_IE7816_WTE_MASK;
  UART1_IE7816 &= ~(1U << UART_IE7816_WTE_SHIFT);
  UART_IS7816_REG(UART1) = UART_IS7816_REG(UART1) + 1;
  UART_IS7816_REG(UART3) = UART_IS7816_REG(UART3) + 1;
  (void)UART_IS7816_RXT_MASK;
  (void)UART_IS7816_RXT_SHIFT;
  UART1_IS7816 |= UART_IS7816_RXT_MASK;
  UART1_IS7816 &= ~(1U << UART_IS7816_RXT_SHIFT);
  (void)UART_IS7816_TXT_MASK;
  (void)UART_IS7816_TXT_SHIFT;
  UART1_IS7816 |= UART_IS7816_TXT_MASK;
  UART1_IS7816 &= ~(1U << UART_IS7816_TXT_SHIFT);
  (void)UART_IS7816_GTV_MASK;
  (void)UART_IS7816_GTV_SHIFT;
  UART1_IS7816 |= UART_IS7816_GTV_MASK;
  UART1_IS7816 &= ~(1U << UART_IS7816_GTV_SHIFT);
  (void)UART_IS7816_INITD_MASK;
  (void)UART_IS7816_INITD_SHIFT;
  UART1_IS7816 |= UART_IS7816_INITD_MASK;
  UART1_IS7816 &= ~(1U << UART_IS7816_INITD_SHIFT);
  (void)UART_IS7816_BWT_MASK;
  (void)UART_IS7816_BWT_SHIFT;
  UART1_IS7816 |= UART_IS7816_BWT_MASK;
  UART1_IS7816 &= ~(1U << UART_IS7816_BWT_SHIFT);
  (void)UART_IS7816_CWT_MASK;
  (void)UART_IS7816_CWT_SHIFT;
  UART1_IS7816 |= UART_IS7816_CWT_MASK;
  UART1_IS7816 &= ~(1U << UART_IS7816_CWT_SHIFT);
  (void)UART_IS7816_WT_MASK;
  (void)UART_IS7816_WT_SHIFT;
  UART1_IS7816 |= UART_IS7816_WT_MASK;
  UART1_IS7816 &= ~(1U << UART_IS7816_WT_SHIFT);
  UART_WP7816T0_REG(UART1) = UART_WP7816T0_REG(UART1) + 1;
  UART_WP7816T0_REG(UART3) = UART_WP7816T0_REG(UART3) + 1;
  (void)UART_WP7816T0_WI_MASK;
  (void)UART_WP7816T0_WI_SHIFT;
  (void)UART_WP7816T0_WI(1);
  UART1_WP7816T0 |= UART_WP7816T0_WI_MASK;
  UART1_WP7816T0 &= ~(1U << UART_WP7816T0_WI_SHIFT);
  UART_WP7816T1_REG(UART1) = UART_WP7816T1_REG(UART1) + 1;
  UART_WP7816T1_REG(UART3) = UART_WP7816T1_REG(UART3) + 1;
  (void)UART_WP7816T1_BWI_MASK;
  (void)UART_WP7816T1_BWI_SHIFT;
  (void)UART_WP7816T1_BWI(1);
  UART1_WP7816T1 |= UART_WP7816T1_BWI_MASK;
  UART1_WP7816T1 &= ~(1U << UART_WP7816T1_BWI_SHIFT);
  (void)UART_WP7816T1_CWI_MASK;
  (void)UART_WP7816T1_CWI_SHIFT;
  (void)UART_WP7816T1_CWI(1);
  UART1_WP7816T1 |= UART_WP7816T1_CWI_MASK;
  UART1_WP7816T1 &= ~(1U << UART_WP7816T1_CWI_SHIFT);
  UART_WN7816_REG(UART1) = UART_WN7816_REG(UART1) + 1;
  UART_WN7816_REG(UART3) = UART_WN7816_REG(UART3) + 1;
  (void)UART_WN7816_GTN_MASK;
  (void)UART_WN7816_GTN_SHIFT;
  (void)UART_WN7816_GTN(1);
  UART1_WN7816 |= UART_WN7816_GTN_MASK;
  UART1_WN7816 &= ~(1U << UART_WN7816_GTN_SHIFT);
  UART_WF7816_REG(UART1) = UART_WF7816_REG(UART1) + 1;
  UART_WF7816_REG(UART3) = UART_WF7816_REG(UART3) + 1;
  (void)UART_WF7816_GTFD_MASK;
  (void)UART_WF7816_GTFD_SHIFT;
  (void)UART_WF7816_GTFD(1);
  UART1_WF7816 |= UART_WF7816_GTFD_MASK;
  UART1_WF7816 &= ~(1U << UART_WF7816_GTFD_SHIFT);
  UART_ET7816_REG(UART1) = UART_ET7816_REG(UART1) + 1;
  UART_ET7816_REG(UART3) = UART_ET7816_REG(UART3) + 1;
  (void)UART_ET7816_RXTHRESHOLD_MASK;
  (void)UART_ET7816_RXTHRESHOLD_SHIFT;
  (void)UART_ET7816_RXTHRESHOLD(1);
  UART1_ET7816 |= UART_ET7816_RXTHRESHOLD_MASK;
  UART1_ET7816 &= ~(1U << UART_ET7816_RXTHRESHOLD_SHIFT);
  (void)UART_ET7816_TXTHRESHOLD_MASK;
  (void)UART_ET7816_TXTHRESHOLD_SHIFT;
  (void)UART_ET7816_TXTHRESHOLD(1);
  UART1_ET7816 |= UART_ET7816_TXTHRESHOLD_MASK;
  UART1_ET7816 &= ~(1U << UART_ET7816_TXTHRESHOLD_SHIFT);
  UART_TL7816_REG(UART1) = UART_TL7816_REG(UART1) + 1;
  UART_TL7816_REG(UART3) = UART_TL7816_REG(UART3) + 1;
  (void)UART_TL7816_TLEN_MASK;
  (void)UART_TL7816_TLEN_SHIFT;
  (void)UART_TL7816_TLEN(1);
  UART1_TL7816 |= UART_TL7816_TLEN_MASK;
  UART1_TL7816 &= ~(1U << UART_TL7816_TLEN_SHIFT);
}

void test_VREF(void) {
  (void)VREF_BASE;
  (void)VREF;
  VREF_VREFH_TRM = VREF_VREFH_TRM + 1;
  VREF_VREFH_SC = VREF_VREFH_SC + 1;
  VREF_VREFL_TRM = VREF_VREFL_TRM + 1;
  VREF_VREFH_TRM_REG(VREF) = VREF_VREFH_TRM_REG(VREF) + 1;
  (void)VREF_VREFH_TRM_TRIM_MASK;
  (void)VREF_VREFH_TRM_TRIM_SHIFT;
  (void)VREF_VREFH_TRM_TRIM(1);
  VREF_VREFH_TRM |= VREF_VREFH_TRM_TRIM_MASK;
  VREF_VREFH_TRM &= ~(1U << VREF_VREFH_TRM_TRIM_SHIFT);
  (void)VREF_VREFH_TRM_CHOPEN_MASK;
  (void)VREF_VREFH_TRM_CHOPEN_SHIFT;
  VREF_VREFH_TRM |= VREF_VREFH_TRM_CHOPEN_MASK;
  VREF_VREFH_TRM &= ~(1U << VREF_VREFH_TRM_CHOPEN_SHIFT);
  VREF_VREFH_SC_REG(VREF) = VREF_VREFH_SC_REG(VREF) + 1;
  (void)VREF_VREFH_SC_MODE_LV_MASK;
  (void)VREF_VREFH_SC_MODE_LV_SHIFT;
  (void)VREF_VREFH_SC_MODE_LV(1);
  VREF_VREFH_SC |= VREF_VREFH_SC_MODE_LV_MASK;
  VREF_VREFH_SC &= ~(1U << VREF_VREFH_SC_MODE_LV_SHIFT);
  (void)VREF_VREFH_SC_VREFST_MASK;
  (void)VREF_VREFH_SC_VREFST_SHIFT;
  VREF_VREFH_SC |= VREF_VREFH_SC_VREFST_MASK;
  VREF_VREFH_SC &= ~(1U << VREF_VREFH_SC_VREFST_SHIFT);
  (void)VREF_VREFH_SC_ICOMPEN_MASK;
  (void)VREF_VREFH_SC_ICOMPEN_SHIFT;
  VREF_VREFH_SC |= VREF_VREFH_SC_ICOMPEN_MASK;
  VREF_VREFH_SC &= ~(1U << VREF_VREFH_SC_ICOMPEN_SHIFT);
  (void)VREF_VREFH_SC_REGEN_MASK;
  (void)VREF_VREFH_SC_REGEN_SHIFT;
  VREF_VREFH_SC |= VREF_VREFH_SC_REGEN_MASK;
  VREF_VREFH_SC &= ~(1U << VREF_VREFH_SC_REGEN_SHIFT);
  (void)VREF_VREFH_SC_VREFEN_MASK;
  (void)VREF_VREFH_SC_VREFEN_SHIFT;
  VREF_VREFH_SC |= VREF_VREFH_SC_VREFEN_MASK;
  VREF_VREFH_SC &= ~(1U << VREF_VREFH_SC_VREFEN_SHIFT);
  VREF_VREFL_TRM_REG(VREF) = VREF_VREFL_TRM_REG(VREF) + 1;
  (void)VREF_VREFL_TRM_VREFL_TRIM_MASK;
  (void)VREF_VREFL_TRM_VREFL_TRIM_SHIFT;
  (void)VREF_VREFL_TRM_VREFL_TRIM(1);
  VREF_VREFL_TRM |= VREF_VREFL_TRM_VREFL_TRIM_MASK;
  VREF_VREFL_TRM &= ~(1U << VREF_VREFL_TRM_VREFL_TRIM_SHIFT);
  (void)VREF_VREFL_TRM_VREFL_EN_MASK;
  (void)VREF_VREFL_TRM_VREFL_EN_SHIFT;
  VREF_VREFL_TRM |= VREF_VREFL_TRM_VREFL_EN_MASK;
  VREF_VREFL_TRM &= ~(1U << VREF_VREFL_TRM_VREFL_EN_SHIFT);
  (void)VREF_VREFL_TRM_VREFL_SEL_MASK;
  (void)VREF_VREFL_TRM_VREFL_SEL_SHIFT;
  VREF_VREFL_TRM |= VREF_VREFL_TRM_VREFL_SEL_MASK;
  VREF_VREFL_TRM &= ~(1U << VREF_VREFL_TRM_VREFL_SEL_SHIFT);
}

