kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/CMSIS_Test_MKM33Z5_v1_3.c
void test_WDOG(void) {
  (void)WDOG_BASE;
  (void)WDOG;
  WDOG_STCTRLH = WDOG_STCTRLH + 1;
  WDOG_STCTRLL = WDOG_STCTRLL + 1;
  WDOG_TOVALH = WDOG_TOVALH + 1;
  WDOG_TOVALL = WDOG_TOVALL + 1;
  WDOG_WINH = WDOG_WINH + 1;
  WDOG_WINL = WDOG_WINL + 1;
  WDOG_REFRESH = WDOG_REFRESH + 1;
  WDOG_UNLOCK = WDOG_UNLOCK + 1;
  WDOG_TMROUTH = WDOG_TMROUTH + 1;
  WDOG_TMROUTL = WDOG_TMROUTL + 1;
  WDOG_RSTCNT = WDOG_RSTCNT + 1;
  WDOG_PRESC = WDOG_PRESC + 1;
  WDOG_STCTRLH_REG(WDOG) = WDOG_STCTRLH_REG(WDOG) + 1;
  (void)WDOG_STCTRLH_WDOGEN_MASK;
  (void)WDOG_STCTRLH_WDOGEN_SHIFT;
  WDOG_STCTRLH |= WDOG_STCTRLH_WDOGEN_MASK;
  WDOG_STCTRLH &= ~(1U << WDOG_STCTRLH_WDOGEN_SHIFT);
  (void)WDOG_STCTRLH_CLKSRC_MASK;
  (void)WDOG_STCTRLH_CLKSRC_SHIFT;
  WDOG_STCTRLH |= WDOG_STCTRLH_CLKSRC_MASK;
  WDOG_STCTRLH &= ~(1U << WDOG_STCTRLH_CLKSRC_SHIFT);
  (void)WDOG_STCTRLH_IRQRSTEN_MASK;
  (void)WDOG_STCTRLH_IRQRSTEN_SHIFT;
  WDOG_STCTRLH |= WDOG_STCTRLH_IRQRSTEN_MASK;
  WDOG_STCTRLH &= ~(1U << WDOG_STCTRLH_IRQRSTEN_SHIFT);
  (void)WDOG_STCTRLH_WINEN_MASK;
  (void)WDOG_STCTRLH_WINEN_SHIFT;
  WDOG_STCTRLH |= WDOG_STCTRLH_WINEN_MASK;
  WDOG_STCTRLH &= ~(1U << WDOG_STCTRLH_WINEN_SHIFT);
  (void)WDOG_STCTRLH_ALLOWUPDATE_MASK;
  (void)WDOG_STCTRLH_ALLOWUPDATE_SHIFT;
  WDOG_STCTRLH |= WDOG_STCTRLH_ALLOWUPDATE_MASK;
  WDOG_STCTRLH &= ~(1U << WDOG_STCTRLH_ALLOWUPDATE_SHIFT);
  (void)WDOG_STCTRLH_DBGEN_MASK;
  (void)WDOG_STCTRLH_DBGEN_SHIFT;
  WDOG_STCTRLH |= WDOG_STCTRLH_DBGEN_MASK;
  WDOG_STCTRLH &= ~(1U << WDOG_STCTRLH_DBGEN_SHIFT);
  (void)WDOG_STCTRLH_STOPEN_MASK;
  (void)WDOG_STCTRLH_STOPEN_SHIFT;
  WDOG_STCTRLH |= WDOG_STCTRLH_STOPEN_MASK;
  WDOG_STCTRLH &= ~(1U << WDOG_STCTRLH_STOPEN_SHIFT);
  (void)WDOG_STCTRLH_TESTWDOG_MASK;
  (void)WDOG_STCTRLH_TESTWDOG_SHIFT;
  WDOG_STCTRLH |= WDOG_STCTRLH_TESTWDOG_MASK;
  WDOG_STCTRLH &= ~(1U << WDOG_STCTRLH_TESTWDOG_SHIFT);
  (void)WDOG_STCTRLH_TESTSEL_MASK;
  (void)WDOG_STCTRLH_TESTSEL_SHIFT;
  WDOG_STCTRLH |= WDOG_STCTRLH_TESTSEL_MASK;
  WDOG_STCTRLH &= ~(1U << WDOG_STCTRLH_TESTSEL_SHIFT);
  (void)WDOG_STCTRLH_BYTESEL_MASK;
  (void)WDOG_STCTRLH_BYTESEL_SHIFT;
  (void)WDOG_STCTRLH_BYTESEL(1);
  WDOG_STCTRLH |= WDOG_STCTRLH_BYTESEL_MASK;
  WDOG_STCTRLH &= ~(1U << WDOG_STCTRLH_BYTESEL_SHIFT);
  (void)WDOG_STCTRLH_DISTESTWDOG_MASK;
  (void)WDOG_STCTRLH_DISTESTWDOG_SHIFT;
  WDOG_STCTRLH |= WDOG_STCTRLH_DISTESTWDOG_MASK;
  WDOG_STCTRLH &= ~(1U << WDOG_STCTRLH_DISTESTWDOG_SHIFT);
  WDOG_STCTRLL_REG(WDOG) = WDOG_STCTRLL_REG(WDOG) + 1;
  (void)WDOG_STCTRLL_INTFLG_MASK;
  (void)WDOG_STCTRLL_INTFLG_SHIFT;
  WDOG_STCTRLL |= WDOG_STCTRLL_INTFLG_MASK;
  WDOG_STCTRLL &= ~(1U << WDOG_STCTRLL_INTFLG_SHIFT);
  WDOG_TOVALH_REG(WDOG) = WDOG_TOVALH_REG(WDOG) + 1;
  (void)WDOG_TOVALH_TOVALHIGH_MASK;
  (void)WDOG_TOVALH_TOVALHIGH_SHIFT;
  (void)WDOG_TOVALH_TOVALHIGH(1);
  WDOG_TOVALH |= WDOG_TOVALH_TOVALHIGH_MASK;
  WDOG_TOVALH &= ~(1U << WDOG_TOVALH_TOVALHIGH_SHIFT);
  WDOG_TOVALL_REG(WDOG) = WDOG_TOVALL_REG(WDOG) + 1;
  (void)WDOG_TOVALL_TOVALLOW_MASK;
  (void)WDOG_TOVALL_TOVALLOW_SHIFT;
  (void)WDOG_TOVALL_TOVALLOW(1);
  WDOG_TOVALL |= WDOG_TOVALL_TOVALLOW_MASK;
  WDOG_TOVALL &= ~(1U << WDOG_TOVALL_TOVALLOW_SHIFT);
  WDOG_WINH_REG(WDOG) = WDOG_WINH_REG(WDOG) + 1;
  (void)WDOG_WINH_WINHIGH_MASK;
  (void)WDOG_WINH_WINHIGH_SHIFT;
  (void)WDOG_WINH_WINHIGH(1);
  WDOG_WINH |= WDOG_WINH_WINHIGH_MASK;
  WDOG_WINH &= ~(1U << WDOG_WINH_WINHIGH_SHIFT);
  WDOG_WINL_REG(WDOG) = WDOG_WINL_REG(WDOG) + 1;
  (void)WDOG_WINL_WINLOW_MASK;
  (void)WDOG_WINL_WINLOW_SHIFT;
  (void)WDOG_WINL_WINLOW(1);
  WDOG_WINL |= WDOG_WINL_WINLOW_MASK;
  WDOG_WINL &= ~(1U << WDOG_WINL_WINLOW_SHIFT);
  WDOG_REFRESH_REG(WDOG) = WDOG_REFRESH_REG(WDOG) + 1;
  (void)WDOG_REFRESH_WDOGREFRESH_MASK;
  (void)WDOG_REFRESH_WDOGREFRESH_SHIFT;
  (void)WDOG_REFRESH_WDOGREFRESH(1);
  WDOG_REFRESH |= WDOG_REFRESH_WDOGREFRESH_MASK;
  WDOG_REFRESH &= ~(1U << WDOG_REFRESH_WDOGREFRESH_SHIFT);
  WDOG_UNLOCK_REG(WDOG) = WDOG_UNLOCK_REG(WDOG) + 1;
  (void)WDOG_UNLOCK_WDOGUNLOCK_MASK;
  (void)WDOG_UNLOCK_WDOGUNLOCK_SHIFT;
  (void)WDOG_UNLOCK_WDOGUNLOCK(1);
  WDOG_UNLOCK |= WDOG_UNLOCK_WDOGUNLOCK_MASK;
  WDOG_UNLOCK &= ~(1U << WDOG_UNLOCK_WDOGUNLOCK_SHIFT);
  WDOG_TMROUTH_REG(WDOG) = WDOG_TMROUTH_REG(WDOG) + 1;
  (void)WDOG_TMROUTH_TIMEROUTHIGH_MASK;
  (void)WDOG_TMROUTH_TIMEROUTHIGH_SHIFT;
  (void)WDOG_TMROUTH_TIMEROUTHIGH(1);
  WDOG_TMROUTH |= WDOG_TMROUTH_TIMEROUTHIGH_MASK;
  WDOG_TMROUTH &= ~(1U << WDOG_TMROUTH_TIMEROUTHIGH_SHIFT);
  WDOG_TMROUTL_REG(WDOG) = WDOG_TMROUTL_REG(WDOG) + 1;
  (void)WDOG_TMROUTL_TIMEROUTLOW_MASK;
  (void)WDOG_TMROUTL_TIMEROUTLOW_SHIFT;
  (void)WDOG_TMROUTL_TIMEROUTLOW(1);
  WDOG_TMROUTL |= WDOG_TMROUTL_TIMEROUTLOW_MASK;
  WDOG_TMROUTL &= ~(1U << WDOG_TMROUTL_TIMEROUTLOW_SHIFT);
  WDOG_RSTCNT_REG(WDOG) = WDOG_RSTCNT_REG(WDOG) + 1;
  (void)WDOG_RSTCNT_RSTCNT_MASK;
  (void)WDOG_RSTCNT_RSTCNT_SHIFT;
  (void)WDOG_RSTCNT_RSTCNT(1);
  WDOG_RSTCNT |= WDOG_RSTCNT_RSTCNT_MASK;
  WDOG_RSTCNT &= ~(1U << WDOG_RSTCNT_RSTCNT_SHIFT);
  WDOG_PRESC_REG(WDOG) = WDOG_PRESC_REG(WDOG) + 1;
  (void)WDOG_PRESC_PRESCVAL_MASK;
  (void)WDOG_PRESC_PRESCVAL_SHIFT;
  (void)WDOG_PRESC_PRESCVAL(1);
  WDOG_PRESC |= WDOG_PRESC_PRESCVAL_MASK;
  WDOG_PRESC &= ~(1U << WDOG_PRESC_PRESCVAL_SHIFT);
}

void test_XBAR(void) {
  (void)XBAR_BASE;
  (void)XBAR;
  XBAR_SEL0 = XBAR_SEL0 + 1;
  XBAR_SEL1 = XBAR_SEL1 + 1;
  XBAR_SEL2 = XBAR_SEL2 + 1;
  XBAR_SEL3 = XBAR_SEL3 + 1;
  XBAR_SEL4 = XBAR_SEL4 + 1;
  XBAR_SEL5 = XBAR_SEL5 + 1;
  XBAR_SEL6 = XBAR_SEL6 + 1;
  XBAR_SEL7 = XBAR_SEL7 + 1;
  XBAR_SEL8 = XBAR_SEL8 + 1;
  XBAR_SEL9 = XBAR_SEL9 + 1;
  XBAR_SEL10 = XBAR_SEL10 + 1;
  XBAR_SEL11 = XBAR_SEL11 + 1;
  XBAR_SEL12 = XBAR_SEL12 + 1;
  XBAR_SEL13 = XBAR_SEL13 + 1;
  XBAR_SEL14 = XBAR_SEL14 + 1;
  XBAR_SEL15 = XBAR_SEL15 + 1;
  XBAR_SEL16 = XBAR_SEL16 + 1;
  XBAR_CTRL0 = XBAR_CTRL0 + 1;
  XBAR_SEL0_REG(XBAR) = XBAR_SEL0_REG(XBAR) + 1;
  (void)XBAR_SEL0_SEL0_MASK;
  (void)XBAR_SEL0_SEL0_SHIFT;
  (void)XBAR_SEL0_SEL0(1);
  XBAR_SEL0 |= XBAR_SEL0_SEL0_MASK;
  XBAR_SEL0 &= ~(1U << XBAR_SEL0_SEL0_SHIFT);
  (void)XBAR_SEL0_SEL1_MASK;
  (void)XBAR_SEL0_SEL1_SHIFT;
  (void)XBAR_SEL0_SEL1(1);
  XBAR_SEL0 |= XBAR_SEL0_SEL1_MASK;
  XBAR_SEL0 &= ~(1U << XBAR_SEL0_SEL1_SHIFT);
  XBAR_SEL1_REG(XBAR) = XBAR_SEL1_REG(XBAR) + 1;
  (void)XBAR_SEL1_SEL2_MASK;
  (void)XBAR_SEL1_SEL2_SHIFT;
  (void)XBAR_SEL1_SEL2(1);
  XBAR_SEL1 |= XBAR_SEL1_SEL2_MASK;
  XBAR_SEL1 &= ~(1U << XBAR_SEL1_SEL2_SHIFT);
  (void)XBAR_SEL1_SEL3_MASK;
  (void)XBAR_SEL1_SEL3_SHIFT;
  (void)XBAR_SEL1_SEL3(1);
  XBAR_SEL1 |= XBAR_SEL1_SEL3_MASK;
  XBAR_SEL1 &= ~(1U << XBAR_SEL1_SEL3_SHIFT);
  XBAR_SEL2_REG(XBAR) = XBAR_SEL2_REG(XBAR) + 1;
  (void)XBAR_SEL2_SEL4_MASK;
  (void)XBAR_SEL2_SEL4_SHIFT;
  (void)XBAR_SEL2_SEL4(1);
  XBAR_SEL2 |= XBAR_SEL2_SEL4_MASK;
  XBAR_SEL2 &= ~(1U << XBAR_SEL2_SEL4_SHIFT);
  (void)XBAR_SEL2_SEL5_MASK;
  (void)XBAR_SEL2_SEL5_SHIFT;
  (void)XBAR_SEL2_SEL5(1);
  XBAR_SEL2 |= XBAR_SEL2_SEL5_MASK;
  XBAR_SEL2 &= ~(1U << XBAR_SEL2_SEL5_SHIFT);
  XBAR_SEL3_REG(XBAR) = XBAR_SEL3_REG(XBAR) + 1;
  (void)XBAR_SEL3_SEL6_MASK;
  (void)XBAR_SEL3_SEL6_SHIFT;
  (void)XBAR_SEL3_SEL6(1);
  XBAR_SEL3 |= XBAR_SEL3_SEL6_MASK;
  XBAR_SEL3 &= ~(1U << XBAR_SEL3_SEL6_SHIFT);
  (void)XBAR_SEL3_SEL7_MASK;
  (void)XBAR_SEL3_SEL7_SHIFT;
  (void)XBAR_SEL3_SEL7(1);
  XBAR_SEL3 |= XBAR_SEL3_SEL7_MASK;
  XBAR_SEL3 &= ~(1U << XBAR_SEL3_SEL7_SHIFT);
  XBAR_SEL4_REG(XBAR) = XBAR_SEL4_REG(XBAR) + 1;
  (void)XBAR_SEL4_SEL8_MASK;
  (void)XBAR_SEL4_SEL8_SHIFT;
  (void)XBAR_SEL4_SEL8(1);
  XBAR_SEL4 |= XBAR_SEL4_SEL8_MASK;
  XBAR_SEL4 &= ~(1U << XBAR_SEL4_SEL8_SHIFT);
  (void)XBAR_SEL4_SEL9_MASK;
  (void)XBAR_SEL4_SEL9_SHIFT;
  (void)XBAR_SEL4_SEL9(1);
  XBAR_SEL4 |= XBAR_SEL4_SEL9_MASK;
  XBAR_SEL4 &= ~(1U << XBAR_SEL4_SEL9_SHIFT);
  XBAR_SEL5_REG(XBAR) = XBAR_SEL5_REG(XBAR) + 1;
  (void)XBAR_SEL5_SEL10_MASK;
  (void)XBAR_SEL5_SEL10_SHIFT;
  (void)XBAR_SEL5_SEL10(1);
  XBAR_SEL5 |= XBAR_SEL5_SEL10_MASK;
  XBAR_SEL5 &= ~(1U << XBAR_SEL5_SEL10_SHIFT);
  (void)XBAR_SEL5_SEL11_MASK;
  (void)XBAR_SEL5_SEL11_SHIFT;
  (void)XBAR_SEL5_SEL11(1);
  XBAR_SEL5 |= XBAR_SEL5_SEL11_MASK;
  XBAR_SEL5 &= ~(1U << XBAR_SEL5_SEL11_SHIFT);
  XBAR_SEL6_REG(XBAR) = XBAR_SEL6_REG(XBAR) + 1;
  (void)XBAR_SEL6_SEL12_MASK;
  (void)XBAR_SEL6_SEL12_SHIFT;
  (void)XBAR_SEL6_SEL12(1);
  XBAR_SEL6 |= XBAR_SEL6_SEL12_MASK;
  XBAR_SEL6 &= ~(1U << XBAR_SEL6_SEL12_SHIFT);
  (void)XBAR_SEL6_SEL13_MASK;
  (void)XBAR_SEL6_SEL13_SHIFT;
  (void)XBAR_SEL6_SEL13(1);
  XBAR_SEL6 |= XBAR_SEL6_SEL13_MASK;
  XBAR_SEL6 &= ~(1U << XBAR_SEL6_SEL13_SHIFT);
  XBAR_SEL7_REG(XBAR) = XBAR_SEL7_REG(XBAR) + 1;
  (void)XBAR_SEL7_SEL14_MASK;
  (void)XBAR_SEL7_SEL14_SHIFT;
  (void)XBAR_SEL7_SEL14(1);
  XBAR_SEL7 |= XBAR_SEL7_SEL14_MASK;
  XBAR_SEL7 &= ~(1U << XBAR_SEL7_SEL14_SHIFT);
  (void)XBAR_SEL7_SEL15_MASK;
  (void)XBAR_SEL7_SEL15_SHIFT;
  (void)XBAR_SEL7_SEL15(1);
  XBAR_SEL7 |= XBAR_SEL7_SEL15_MASK;
  XBAR_SEL7 &= ~(1U << XBAR_SEL7_SEL15_SHIFT);
  XBAR_SEL8_REG(XBAR) = XBAR_SEL8_REG(XBAR) + 1;
  (void)XBAR_SEL8_SEL16_MASK;
  (void)XBAR_SEL8_SEL16_SHIFT;
  (void)XBAR_SEL8_SEL16(1);
  XBAR_SEL8 |= XBAR_SEL8_SEL16_MASK;
  XBAR_SEL8 &= ~(1U << XBAR_SEL8_SEL16_SHIFT);
  (void)XBAR_SEL8_SEL17_MASK;
  (void)XBAR_SEL8_SEL17_SHIFT;
  (void)XBAR_SEL8_SEL17(1);
  XBAR_SEL8 |= XBAR_SEL8_SEL17_MASK;
  XBAR_SEL8 &= ~(1U << XBAR_SEL8_SEL17_SHIFT);
  XBAR_SEL9_REG(XBAR) = XBAR_SEL9_REG(XBAR) + 1;
  (void)XBAR_SEL9_SEL18_MASK;
  (void)XBAR_SEL9_SEL18_SHIFT;
  (void)XBAR_SEL9_SEL18(1);
  XBAR_SEL9 |= XBAR_SEL9_SEL18_MASK;
  XBAR_SEL9 &= ~(1U << XBAR_SEL9_SEL18_SHIFT);
  (void)XBAR_SEL9_SEL19_MASK;
  (void)XBAR_SEL9_SEL19_SHIFT;
  (void)XBAR_SEL9_SEL19(1);
  XBAR_SEL9 |= XBAR_SEL9_SEL19_MASK;
  XBAR_SEL9 &= ~(1U << XBAR_SEL9_SEL19_SHIFT);
  XBAR_SEL10_REG(XBAR) = XBAR_SEL10_REG(XBAR) + 1;
  (void)XBAR_SEL10_SEL20_MASK;
  (void)XBAR_SEL10_SEL20_SHIFT;
  (void)XBAR_SEL10_SEL20(1);
  XBAR_SEL10 |= XBAR_SEL10_SEL20_MASK;
  XBAR_SEL10 &= ~(1U << XBAR_SEL10_SEL20_SHIFT);
  (void)XBAR_SEL10_SEL21_MASK;
  (void)XBAR_SEL10_SEL21_SHIFT;
  (void)XBAR_SEL10_SEL21(1);
  XBAR_SEL10 |= XBAR_SEL10_SEL21_MASK;
  XBAR_SEL10 &= ~(1U << XBAR_SEL10_SEL21_SHIFT);
  XBAR_SEL11_REG(XBAR) = XBAR_SEL11_REG(XBAR) + 1;
  (void)XBAR_SEL11_SEL22_MASK;
  (void)XBAR_SEL11_SEL22_SHIFT;
  (void)XBAR_SEL11_SEL22(1);
  XBAR_SEL11 |= XBAR_SEL11_SEL22_MASK;
  XBAR_SEL11 &= ~(1U << XBAR_SEL11_SEL22_SHIFT);
  (void)XBAR_SEL11_SEL23_MASK;
  (void)XBAR_SEL11_SEL23_SHIFT;
  (void)XBAR_SEL11_SEL23(1);
  XBAR_SEL11 |= XBAR_SEL11_SEL23_MASK;
  XBAR_SEL11 &= ~(1U << XBAR_SEL11_SEL23_SHIFT);
  XBAR_SEL12_REG(XBAR) = XBAR_SEL12_REG(XBAR) + 1;
  (void)XBAR_SEL12_SEL24_MASK;
  (void)XBAR_SEL12_SEL24_SHIFT;
  (void)XBAR_SEL12_SEL24(1);
  XBAR_SEL12 |= XBAR_SEL12_SEL24_MASK;
  XBAR_SEL12 &= ~(1U << XBAR_SEL12_SEL24_SHIFT);
  (void)XBAR_SEL12_SEL25_MASK;
  (void)XBAR_SEL12_SEL25_SHIFT;
  (void)XBAR_SEL12_SEL25(1);
  XBAR_SEL12 |= XBAR_SEL12_SEL25_MASK;
  XBAR_SEL12 &= ~(1U << XBAR_SEL12_SEL25_SHIFT);
  XBAR_SEL13_REG(XBAR) = XBAR_SEL13_REG(XBAR) + 1;
  (void)XBAR_SEL13_SEL26_MASK;
  (void)XBAR_SEL13_SEL26_SHIFT;
  (void)XBAR_SEL13_SEL26(1);
  XBAR_SEL13 |= XBAR_SEL13_SEL26_MASK;
  XBAR_SEL13 &= ~(1U << XBAR_SEL13_SEL26_SHIFT);
  (void)XBAR_SEL13_SEL27_MASK;
  (void)XBAR_SEL13_SEL27_SHIFT;
  (void)XBAR_SEL13_SEL27(1);
  XBAR_SEL13 |= XBAR_SEL13_SEL27_MASK;
  XBAR_SEL13 &= ~(1U << XBAR_SEL13_SEL27_SHIFT);
  XBAR_SEL14_REG(XBAR) = XBAR_SEL14_REG(XBAR) + 1;
  (void)XBAR_SEL14_SEL28_MASK;
  (void)XBAR_SEL14_SEL28_SHIFT;
  (void)XBAR_SEL14_SEL28(1);
  XBAR_SEL14 |= XBAR_SEL14_SEL28_MASK;
  XBAR_SEL14 &= ~(1U << XBAR_SEL14_SEL28_SHIFT);
  (void)XBAR_SEL14_SEL29_MASK;
  (void)XBAR_SEL14_SEL29_SHIFT;
  (void)XBAR_SEL14_SEL29(1);
  XBAR_SEL14 |= XBAR_SEL14_SEL29_MASK;
  XBAR_SEL14 &= ~(1U << XBAR_SEL14_SEL29_SHIFT);
  XBAR_SEL15_REG(XBAR) = XBAR_SEL15_REG(XBAR) + 1;
  (void)XBAR_SEL15_SEL30_MASK;
  (void)XBAR_SEL15_SEL30_SHIFT;
  (void)XBAR_SEL15_SEL30(1);
  XBAR_SEL15 |= XBAR_SEL15_SEL30_MASK;
  XBAR_SEL15 &= ~(1U << XBAR_SEL15_SEL30_SHIFT);
  (void)XBAR_SEL15_SEL31_MASK;
  (void)XBAR_SEL15_SEL31_SHIFT;
  (void)XBAR_SEL15_SEL31(1);
  XBAR_SEL15 |= XBAR_SEL15_SEL31_MASK;
  XBAR_SEL15 &= ~(1U << XBAR_SEL15_SEL31_SHIFT);
  XBAR_SEL16_REG(XBAR) = XBAR_SEL16_REG(XBAR) + 1;
  (void)XBAR_SEL16_SEL32_MASK;
  (void)XBAR_SEL16_SEL32_SHIFT;
  (void)XBAR_SEL16_SEL32(1);
  XBAR_SEL16 |= XBAR_SEL16_SEL32_MASK;
  XBAR_SEL16 &= ~(1U << XBAR_SEL16_SEL32_SHIFT);
  XBAR_CTRL0_REG(XBAR) = XBAR_CTRL0_REG(XBAR) + 1;
  (void)XBAR_CTRL0_DEN0_MASK;
  (void)XBAR_CTRL0_DEN0_SHIFT;
  XBAR_CTRL0 |= XBAR_CTRL0_DEN0_MASK;
  XBAR_CTRL0 &= ~(1U << XBAR_CTRL0_DEN0_SHIFT);
  (void)XBAR_CTRL0_IEN0_MASK;
  (void)XBAR_CTRL0_IEN0_SHIFT;
  XBAR_CTRL0 |= XBAR_CTRL0_IEN0_MASK;
  XBAR_CTRL0 &= ~(1U << XBAR_CTRL0_IEN0_SHIFT);
  (void)XBAR_CTRL0_EDGE0_MASK;
  (void)XBAR_CTRL0_EDGE0_SHIFT;
  (void)XBAR_CTRL0_EDGE0(1);
  XBAR_CTRL0 |= XBAR_CTRL0_EDGE0_MASK;
  XBAR_CTRL0 &= ~(1U << XBAR_CTRL0_EDGE0_SHIFT);
  (void)XBAR_CTRL0_STS0_MASK;
  (void)XBAR_CTRL0_STS0_SHIFT;
  XBAR_CTRL0 |= XBAR_CTRL0_STS0_MASK;
  XBAR_CTRL0 &= ~(1U << XBAR_CTRL0_STS0_SHIFT);
}

void test_MKM33Z5(void) {
  test_ADC();
  test_AFE();
  test_AIPS();
  test_CMP();
  test_CRC();
  test_DMA();
  test_DMAMUX();
  test_EWM();
  test_FTFA();
  test_GPIO();
  test_I2C();
  test_LCD();
  test_LLWU();
  test_LPTMR();
  test_MCG();
  test_MCM();
  test_MPU();
  test_MTB();
  test_MTBDWT();
  test_NV();
  test_OSC();
  test_PIT();
  test_PMC();
  test_PORT();
  test_RCM();
  test_RNG();
  test_ROM();
  test_RTC();
  test_SIM();
  test_SMC();
  test_SPI();
  test_TMR();
  test_UART();
  test_VREF();
  test_WDOG();
  test_XBAR();
}
